{
    "HomeLayout": {
        "Support me on Buy me a coffee": "Sostienimi su Comprami un caffè!",
        "Description": "Libreria multilingue realizzata per la validazione, vari campi del modulo, come: email, telefono, password, cpf, cnpj, carta di credito, numeri magici per la convalida del mimetype dell'immagine e molto altro.",
        "Technology": "Tecnologia",
        "Opengraph description": "Libreria multilingue realizzata per la validazione, vari campi del modulo, come: email, immagine, cpf, cnpj, carta di credito, numeri magici e molto altro.",
        "Classification": "Libreria di convalida",
        "Title": "Validatore multiforma",
        "Opengraph title": "Multiform Validator - La tua libreria di convalida multilingue"
    },
    "DocumentationJs": {
        "By - Gabriel Logan": "Di - Gabriel Logan",
        "Installation": "Installazione",
        "This package contains various modules for validating different types of data. Below are the available validation modules:": "Questo pacchetto contiene vari moduli per la convalida di diversi tipi di dati. Di seguito sono riportati i moduli di convalida disponibili:",
        "INFO: ": "INFORMAZIONI: ",
        "Welcome Introduction Text": "Benvenuto nella pagina principale di Multiform Validator! Qui troverai la documentazione dettagliata per le varie funzioni fornite da Multiform Validator, un'utile libreria JavaScript per la convalida dei dati. Ogni funzione è progettata per aiutare a convalidare diversi tipi di dati, rendendo il codice più robusto e sicuro. Multiform Validator è costituito da una serie di funzioni specializzate che consentono di convalidare vari tipi di dati, come e-mail, password, nomi, cognomi, numeri di passaporto, numeri di telefono e altro ancora. Ogni funzione ha parametri configurabili e fornisce messaggi di errore personalizzabili in base alle esigenze del progetto. In ogni pagina della documentazione è disponibile una descrizione completa della funzione, incluso lo scopo, i parametri accettati e gli esempi di utilizzo. Inoltre, avrai accesso ai dettagli sui messaggi di errore predefiniti e su come personalizzarli per adattarli alla tua applicazione. Utilizzando Multiform Validator, è possibile garantire che l'input dell'utente nei moduli sia corretto e conforme alle regole stabilite. Questa convalida è essenziale per evitare problemi quali voci non valide, dati danneggiati o vulnerabilità di sicurezza. Lavoriamo continuamente per migliorare ed espandere Multiform Validator con nuove funzionalità e miglioramenti per renderlo uno strumento ancora più potente e flessibile per le tue esigenze di convalida. Ci auguriamo che queste documentazioni si rivelino utili e semplifichino l'utilizzo di Multiform Validator nei vostri progetti. Sentitevi liberi di esplorare le varie funzioni disponibili e non esitate a contattarci se avete domande o suggerimenti. Grazie per aver scelto Multiform Validator come strumento di validazione dei dati e ti auguriamo successo nei tuoi progetti! Team di validatori multiformi",
        "if you prefer, you can use importing as:": "Se si preferisce, è possibile utilizzare l'importazione come:",
        "Official documentation": "Documentazione ufficiale",
        "Example of use with CDN": "Esempio di utilizzo con CDN",
        "Data Validator": "Validatore di dati",
        "FirstInfoText": "Tutte le funzioni che hanno il nome \"validate\" restituiscono un oggetto con due proprietà, isValid: true | false e errorMsg: 'Stringa con errori'",
        "Feel free to find bugs Text Msg": "Sentitevi liberi di trovare bug e segnalarmeli . Il tuo feedback è molto apprezzato. Un abbraccio da Gabriel Logan!",
        "Back to home page": "Torna alla home page",
        "If you want to help me, you can buy me a coffee (:": "Se vuoi aiutarmi, puoi offrirmi un caffè (:",
        "SecondInfoText": "I rimanenti possono restituire true|false|string|array, guarda il doc per ciascuno",
        "Available Validation Modules": "Moduli di convalida disponibili",
        "Feel free to explore msg": "Sentiti libero di esplorare le varie funzioni e sperimentare diversi input per comprenderne il comportamento. Se riscontri problemi o hai suggerimenti, non esitare a contattarmi. Il tuo feedback è prezioso e aiuta a migliorare il pacchetto. Buona programmazione!",
        "This npm package provides JavaScript functions to validate various forms fields.": "Questo pacchetto npm fornisce funzioni JavaScript per convalidare vari campi dei moduli."
    },
    "DocumentationLayout": {
        "Documentation": "Documentazione",
        "Documentation for the Multiform Validator library.": "Documentazione per la libreria Multiform Validator."
    },
    "Terms": {
        "Terms and Conditions": "Termini e condizioni",
        "Unauthorized use of this website is strictly prohibited.": "L'uso non autorizzato di questo sito web è severamente vietato.",
        "Terms and Conditions of Multiform Validator library": "Termini e condizioni della libreria Multiform Validator",
        "Welcome to Gabriel Logan Web Services. By using this website, you agree to the following terms and conditions:": "Benvenuti nei servizi Web di Gabriel Logan. Utilizzando questo sito web, l'utente accetta i seguenti termini e condizioni:",
        "We do not collect any personal data through this website, and your privacy is important to us.": "Non raccogliamo alcun dato personale attraverso questo sito web e la tua privacy è importante per noi.",
        "Your use of this website and any disputes arising are subject to the laws of [Your Country/Region].": "L'utilizzo di questo sito Web da parte dell'utente e qualsiasi controversia derivante sono soggetti alle leggi di [Paese/regione dell'utente].",
        "The content provided on this website is for general information purposes only, and we make no warranties or representations regarding its accuracy or completeness.": "Il contenuto fornito su questo sito Web è solo a scopo informativo generale e non forniamo alcuna garanzia o dichiarazione in merito alla sua accuratezza o completezza.",
        "We use the \"multiform-validator\" library, licensed under the MIT License, to enhance form field validation. However, we are not responsible for its usage or any consequences resulting from third-party use of the library.": "Utilizziamo la libreria \"multiform-validator\", concessa in licenza con licenza MIT, per migliorare la convalida dei campi del modulo. Tuttavia, non siamo responsabili per il suo utilizzo o per eventuali conseguenze derivanti dall'uso della libreria da parte di terzi.",
        "Thank you for visiting our website and using our services. If you have any questions or concerns, please don’t hesitate to contact us.": "Grazie per aver visitato il nostro sito web e per aver utilizzato i nostri servizi. Se hai domande o dubbi, non esitare a contattarci."
    },
    "PrivacyPolices": {
        "privacy_questions": "Se hai domande o dubbi sulle nostre politiche sulla privacy o sull'uso della libreria \"multiform-validator\", non esitare a contattarci. Siamo qui per rispondere a qualsiasi richiesta e garantire la tua tranquillità.",
        "privacy_intro": "Gabriel Logan Web Services prende sul serio la tua privacy. Vogliamo assicurarvi che non raccogliamo alcun dato sul nostro sito web e non utilizziamo alcun dato attraverso la libreria \"multiform-validator\". Le tue informazioni rimangono completamente confidenziali e la tua privacy è fondamentale per noi.",
        "Privacy Policy": "Informativa sulla privacy",
        "validator_local": "La libreria \"multiform-validator\" è progettata per convalidare i campi del modulo sulle applicazioni Web senza accedere o trasmettere dati a server esterni. Tutta la convalida avviene localmente all'interno del browser, garantendo che le informazioni sensibili non lascino mai il dispositivo.",
        "privacy_thanks": "Grazie per aver scelto Gabriel Logan Web Services. Non vediamo l'ora di fornirti soluzioni eccezionali salvaguardando la tua privacy in ogni fase del processo.",
        "privacy_title": "Politiche sulla privacy - I tuoi dati sono al sicuro con noi",
        "validator_secure": "Comprendiamo l'importanza della sicurezza dei dati, ed è per questo che abbiamo meticolosamente sviluppato la libreria \"multiform-validator\" per essere sicura al 100%. I tuoi dati rimangono sotto il tuo controllo e non abbiamo accesso ad alcuna informazione elaborata dalla biblioteca.",
        "privacy_no_personal_data": "Quando visiti il nostro sito web, ti assicuriamo che nessun dato personale, come il tuo nome, indirizzo e-mail o informazioni di contatto, viene raccolto o memorizzato. Crediamo nell'importanza di fornirti un'esperienza di navigazione sicura e anonima.",
        "privacy_trust": "La tua fiducia è preziosa per noi e vogliamo che tu ti senta sicuro nell'utilizzo dei nostri servizi e della libreria \"multiform-validator\". Il nostro impegno per la tua privacy è incrollabile e continueremo a dare priorità alla sicurezza e alla protezione dei tuoi dati in tutti gli aspetti del nostro lavoro."
    },
    "Info": {
        "info_intro": "Vi presentiamo multiform-validator, una potente Multi Library sviluppata da Gabriel Logan. Questa libreria versatile è progettata per convalidare numerosi campi del modulo, inclusi indirizzi e-mail, numeri di telefono, password, CPF (numeri di registro dei contribuenti brasiliani), numeri di carte di credito e altro ancora.",
        "info_conclusion": "Quindi, se stai cercando una soluzione completa per la convalida dei campi modulo, non cercare oltre multiform-validator. Sfrutta la potenza di questa libreria e assicurati che il tuo processo di raccolta dei dati sarà semplificato, accurato e sicuro.",
        "info_title": "multiform-validator - Multi libreria per la convalida dei campi modulo",
        "info_performance": "Gabriel Logan è orgoglioso di sviluppare la libreria multiform-validator con particolare attenzione alle prestazioni, all'efficienza e all'affidabilità. La libreria è ottimizzata per vari browser, garantendo una perfetta compatibilità per il tuo pubblico diversificato.",
        "info_prebuilt_rules": "La libreria multiform-validator viene fornita con un ampio set di regole di convalida predefinite e opzioni personalizzabili. Puoi integrarlo facilmente nelle tue applicazioni Web e godere dei vantaggi della convalida lato client, riducendo il numero di invii di moduli non validi e migliorando l'esperienza utente complessiva.",
        "info_flexibility": "Ciò che distingue multiform-validator è la sua flessibilità e facilità d'uso. È possibile applicare facilmente le regole di convalida a diversi campi del modulo semplicemente aggiungendo alcune righe di codice JavaScript. Inoltre, la libreria fornisce messaggi di errore informativi, guidando gli utenti su come correggere i propri input, riducendo così la frustrazione e i tassi di abbandono dei moduli.",
        "Info_Page": "Pagina delle informazioni",
        "info_backend": "Puoi anche usare il multiform-validator per fare convalide nel tuo backend, funziona per qualsiasi tipo di convalida del modulo o funzioni che utilizzano javascript, python, quindi sentiti libero di usarlo",
        "info_ensure": "Con multiform-validator, puoi assicurarti che i dati inviati tramite i tuoi moduli siano accurati e sicuri. Che tu stia creando un modulo di registrazione, un processo di checkout o qualsiasi sistema di immissione dati, questa libreria ti copre."
    },
    "Manifest": {
        "Description": "Libreria multilingue realizzata per la validazione, vari campi del modulo, come: email, telefono, password, cpf, cnpj, carta di credito, numeri magici per la convalida del mimetype dell'immagine e molto altro.",
        "ShortName": "Validatore multiforma",
        "Name": "Multiform Validator - La tua libreria di convalida multilingue"
    },
    "DocumentationPage": {
        "doc_java_title": "Giava",
        "doc_py_text": "Qui puoi trovare la documentazione per il linguaggio Python.",
        "doc_title": "Pagina Documentazione",
        "doc_subtitle": "Ecco tutte le lingue supportate",
        "doc_java_text": "Qui puoi trovare la documentazione per il linguaggio Java.",
        "doc_py_title": "Pitone",
        "doc_js_title": "JavaScript (Inglese)",
        "doc_intro": "Benvenuto nella pagina della documentazione. Qui puoi trovare tutte le lingue che supportiamo e la documentazione per ognuna di esse.",
        "doc_js_text": "Qui puoi trovare la documentazione per il linguaggio JavaScript.",
        "doc_java_coming": "A venire ..."
    },
    "About": {
        "about_backend": "Ma le mie competenze non si fermano qui. Sono altrettanto competente nello sviluppo back-end, con esperienza in linguaggi come Python, Java e JavaScript (Node.js). Costruire applicazioni web robuste e sicure è il mio punto di forza, in quanto comprendo le complessità della logica lato server. Le mie soluzioni sono orientate all'efficienza, all'affidabilità e alla scalabilità, assicurandomi che anche durante i periodi di picco, le mie applicazioni offrano un'esperienza utente fluida.",
        "about_frontend": "In qualità di sviluppatore front-end, ho un occhio attento per l'esperienza utente e il design dell'interfaccia. Adoro trasformare concetti creativi in applicazioni web visivamente accattivanti e interattive utilizzando React e Nextjs con dattiloscritto. Dalla navigazione senza soluzione di continuità alle animazioni fluide, presto attenzione a ogni dettaglio per garantire che i miei progetti front-end trasudino eleganza e funzionalità.",
        "About_Page": "Informazioni sulla pagina",
        "about_achievement": "Uno dei risultati di cui vado più fiero è la creazione di una pagina web innovativa che semplifica e velocizza la convalida dei moduli. Questa soluzione ingegnosa è progettata per aiutare le persone e le aziende a semplificare il processo di convalida dei moduli. Sfruttando la mia vasta conoscenza dello sviluppo web e incorporando tecnologie all'avanguardia, la mia pagina offre un modo velocissimo e SUPER efficiente per convalidare i moduli. La sua interfaccia user-friendly e le funzionalità intuitive lo rendono uno strumento indispensabile per i professionisti che cercano di migliorare la loro produttività e precisione nella raccolta dei dati.",
        "about_title": "Ciao, sono Gabriel Logan",
        "about_inspiration": "Quando non sono assorto nel codice, potresti trovarmi a cercare ispirazione nel mondo che mi circonda. Che si tratti di esplorare la vita all'aria aperta, immergermi nell'arte e nella cultura o partecipare a discussioni stimolanti, attingo da una vasta gamma di esperienze che modellano il mio approccio alla programmazione e le mie interazioni con colleghi e clienti.",
        "About_Page_Description": "Conosci Gabriel Logan, il creatore della libreria multiform-validator, e scopri la sua passione per lo sviluppo web, le soluzioni innovative e la dedizione all'esperienza utente.",
        "about_creative": "A parte le mie competenze tecniche, prospero come risolutore di problemi creativo. Amo affrontare le sfide con una mentalità innovativa e sono sempre alla ricerca di modi per migliorare l'esperienza dell'utente. La mia capacità di pensare fuori dagli schemi e di fornire soluzioni creative mi distingue come un vero leader nel campo dello sviluppo web.",
        "about_conclusion": "In conclusione, sono Gabriel Logan, un programmatore appassionato che intreccia perfettamente competenze front-end e back-end per creare esperienze web eccezionali. La mia mentalità innovativa, l'attenzione ai dettagli e la dedizione all'efficienza mi hanno portato a sviluppare una pagina innovativa che credo avrà un impatto significativo sul mondo della convalida dei moduli. Mentre il panorama digitale continua ad evolversi, io sono in prima linea, pronto ad abbracciare nuove sfide e a fare la differenza attraverso il mio eccezionale lavoro nello sviluppo web.",
        "about_intro": "Mi considero un programmatore versatile con la passione per lo sviluppo sia front-end che back-end. Creare esperienze web eccezionali è ciò che mi motiva e sono immensamente orgoglioso del lavoro che produco."
    },
    "HomePage": {
        "HelpMsg": "Puoi anche aiutare il programmatore acquistando un caffè al link qui sotto, grazie in anticipo (:",
        "SeeThePypiPage": "Consulta la pagina pypi",
        "Intro": "Usando la mia libreria, puoi convertire molte righe di codice in pochissime righe e come risultato hai un codice più pulito, più forte e più sicuro, avrai diversi strumenti e funzioni che faranno diverse convalide di moduli",
        "Hello": "Ciao",
        "Documentation": "Documentazione",
        "FollowThe": "Segui il",
        "Welcome": "Benvenuti nel sito web di multiform-validator",
        "SeeTheGithubSourceCode": "Vedi il codice sorgente di Github",
        "ForMoreInfo": "Per maggiori informazioni",
        "SeeTheNpmPage": "Vedi la pagina npm",
        "SeeTheJitPackPage": "Vedi la pagina jitpack"
    },
    "DocumentationJsFunctions": {
        "Alternatively, you can import the function using CommonJS syntax with": "In alternativa, è possibile importare la funzione utilizzando la sintassi CommonJS con",
        "if the input value matches any of the supported postal code formats, and": "se il valore di input corrisponde a uno dei formati di codice postale supportati, e",
        "The function takes two parameters:": "La funzione accetta due parametri:",
        "containing the default error message 'Unknown error'.": "contenente il messaggio di errore predefinito «Errore sconosciuto».",
        "If the conversion is successful (resulting in a valid integer), the function checks if the integer is within the valid port range (1 to 65535). If the value is within this range and it is an integer, the function returns true, indicating that the input value represents a valid port number. Otherwise, it returns false.": "Se la conversione ha esito positivo (con conseguente numero intero valido), la funzione controlla se il numero intero si trova all'interno dell'intervallo di porte valido (da 1 a 65535). Se il valore è compreso in questo intervallo ed è un numero intero, la funzione restituisce true, indicando che il valore di input rappresenta un numero di porta valido. In caso contrario, restituisce false.",
        "The function can be imported using ES6 syntax from the \"multiform-validator\" package:": "La funzione può essere importata utilizzando la sintassi ES6 dal pacchetto \"multiform-validator\":",
        "Brazil: 9 digits (e.g., '123456789')": "Brasile: 9 cifre (ad esempio, \"123456789\")",
        "The US phone number to be validated.": "Il numero di telefono degli Stati Uniti da convalidare.",
        "if the input string is a valid MD5 hash and follows the supported format, and": "se la stringa di input è un hash MD5 valido e segue il formato supportato, e",
        "parameter (non-array), or if an error occurs during the validation process, the function will return an object with": "(non-array), o se si verifica un errore durante il processo di convalida, la funzione restituirà un oggetto con",
        "Note:": "Nota:",
        "function checks if the input string is a valid MAC address. It returns": "controlla se la stringa di input è un indirizzo MAC valido. Ritorna",
        "[optional] - The maximum length allowed for the email address. If not provided, the default value is 400.": "[facoltativo] - La lunghezza massima consentita per l'indirizzo e-mail. Se non specificato, il valore predefinito è 400.",
        "Parameters": "Parametri",
        "The password to be validated.": "La password da convalidare.",
        "This function just checks the syntax of the email to see if it's valid or not, if you need a stronger validation, use: ": "Questa funzione controlla solo la sintassi dell'e-mail per vedere se è valida o meno, se hai bisogno di una convalida più forte, usa: ",
        "function is used to validate Brazilian phone numbers. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"errorMsg\" property will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "viene utilizzata per convalidare i numeri di telefono brasiliani. Restituisce un oggetto con due proprietà: \"isValid\" (booleano) e \"errorMsg\" (stringa). La proprietà \"errorMsg\" conterrà il messaggio di errore se il numero di telefono non è valido oppure sarà null se il numero di telefono è valido.",
        "if the input string is empty or consists of only whitespace characters, and": "se la stringa di input è vuota o è costituita solo da spazi vuoti e",
        "The CPF number to be validated.": "Il numero CPF da convalidare.",
        "The function first checks if the input value is either a string or a number. If the value is a string, it is converted to an integer using": "La funzione controlla innanzitutto se il valore di input è una stringa o un numero. Se il valore è una stringa, viene convertito in un numero intero utilizzando",
        "Supported Passport Formats": "Formati di passaporto supportati",
        "Default Error Messages": "Messaggi di errore predefiniti",
        "optional array": "Matrice opzionale",
        "Whether the password requires at least one number. Default value: false.": "Indica se la password richiede almeno un numero. Valore predefinito: false.",
        "The function is a text area validation utility that checks the validity of a given textarea string based on certain criteria.": "La funzione è un'utilità di convalida dell'area di testo che controlla la validità di una determinata stringa dell'area di testo in base a determinati criteri.",
        "The input string to check if it is a valid Brazilian ZIP Code (CEP).": "Stringa di input per verificare se si tratta di un codice postale brasiliano (CEP) valido.",
        "The input text from which emails will be extracted.": "Il testo di input da cui verranno estratte le e-mail.",
        "function is used to validate passport numbers. It returns an object with two properties: 'isValid' (boolean) and 'country' (string). The 'isValid' property will be true if the passport number matches the supported formats, and 'country' property will indicate the country associated with the passport number. If the passport number does not match any supported format, 'isValid' will be false, and 'country' will be null.": "viene utilizzata per convalidare i numeri di passaporto. Restituisce un oggetto con due proprietà: 'isValid' (booleano) e 'country' (stringa). La proprietà 'isValid' sarà true se il numero di passaporto corrisponde ai formati supportati e la proprietà 'country' indicherà il paese associato al numero di passaporto. Se il numero di passaporto non corrisponde ad alcun formato supportato, 'isValid' sarà false e 'country' sarà null.",
        "How to use the isValidVideo function": "Come utilizzare la funzione isValidVideo",
        "function is used to validate surnames. It returns an object with two properties: 'isValid' (boolean) and 'errorMsg' (string). The 'isValid' property will be true if the surname meets the specified criteria, and 'errorMsg' will contain the error message if the surname is invalid, or it will be null if the surname is valid.": "viene utilizzata per convalidare i cognomi. Restituisce un oggetto con due proprietà: 'isValid' (booleano) e 'errorMsg' (stringa). La proprietà 'isValid' sarà true se il cognome soddisfa i criteri specificati e 'errorMsg' conterrà il messaggio di errore se il cognome non è valido o sarà null se il cognome è valido.",
        "The surname to be validated.": "Il cognome da convalidare.",
        "Contains the corresponding error message, if any, based on the validation result.": "Contiene il messaggio di errore corrispondente, se presente, in base al risultato della convalida.",
        "You can also pass an options object as a second argument to exclude a specific type.": "È inoltre possibile passare un oggetto options come secondo argomento per escludere un tipo specifico.",
        "Australia: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Australia: 1 lettera maiuscola seguita da 7 cifre (ad esempio, 'A1234567')",
        "United States: 9 digits (e.g., '123456789')": "Stati Uniti: 9 cifre (ad esempio, \"123456789\")",
        "function is used to validate email addresses. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"errorMsg\" property will contain the error message if the email address is invalid, or it will be null if the email address is valid.": "viene utilizzata per convalidare gli indirizzi e-mail. Restituisce un oggetto con due proprietà: \"isValid\" (booleano) e \"errorMsg\" (stringa). La proprietà \"errorMsg\" conterrà il messaggio di errore se l'indirizzo di posta elettronica non è valido oppure sarà null se l'indirizzo di posta elettronica è valido.",
        "The": "Le",
        "The function expects the input value to be passed as a string. It checks each character of the string, and if any character has a character code greater than 127 (non-ASCII), the function returns": "La funzione prevede che il valore di input venga passato come stringa. Controlla ogni carattere della stringa e, se un carattere ha un codice carattere maggiore di 127 (non ASCII), la funzione restituisce",
        "The input string to check if it is a valid Base64 string.": "Stringa di input per verificare se si tratta di una stringa Base64 valida.",
        "The maximum length of the surname. Default is 25.": "La lunghezza massima del cognome. Il valore predefinito è 25.",
        "[optional] - The minimum length of the username. Default is 1.": "[facoltativo] - La lunghezza minima del nome utente. Il valore predefinito è 1.",
        "If the input is not a string or an empty string, it throws an error.": "Se l'input non è una stringa o una stringa vuota, genera un errore.",
        "The function expects the input value to be passed as a string. It checks if the string is a valid Base64 string using a regular expression. If the input is not a string or an empty string, it throws an error.": "La funzione prevede che il valore di input venga passato come stringa. Controlla se la stringa è una stringa Base64 valida utilizzando un'espressione regolare. Se l'input non è una stringa o una stringa vuota, genera un errore.",
        "'veryWeak' - Password with less than 6 characters, consisting only of numbers": "'veryWeak' - Password con meno di 6 caratteri, composta solo da numeri",
        "if the credit card number is valid, and": "se il numero della carta di credito è valido, e",
        "The function expects the input value to be passed as a string representing a credit card number. It removes any non-digit characters and applies the Luhn algorithm to validate the credit card number. If the input is not a string, the function throws an error.": "La funzione prevede che il valore di input venga passato come stringa che rappresenta un numero di carta di credito. Rimuove tutti i caratteri non numerici e applica l'algoritmo di Luhn per convalidare il numero della carta di credito. Se l'input non è una stringa, la funzione genera un errore.",
        "function from 'multiform-validator'. Then, define the path to the image you want to check. Call the": "funzione da 'multiform-validator'. Quindi, definisci il percorso dell'immagine che desideri controllare. Chiamare il metodo",
        "function checks if the input string is a valid date.": "controlla se la stringa di input è una data valida.",
        "The input string to check if it is empty or contains only whitespace characters.": "Stringa di input per verificare se è vuota o contiene solo spazi vuoti.",
        "function checks if the input string is a valid email address. It returns": "controlla se la stringa di input è un indirizzo e-mail valido. Ritorna",
        "Whether the password requires at least one special character": "Se la password richiede almeno un carattere speciale",
        "The passport number to be validated.": "Il numero del passaporto da convalidare.",
        "The function returns an object with two properties:": "La funzione restituisce un oggetto con due proprietà:",
        "The function expects the input to be passed as a string.": "La funzione prevede che l'input venga passato come stringa.",
        "if the value is a valid port number (within the range 1 to 65535), and": "se il valore è un numero di porta valido (compreso nell'intervallo da 1 a 65535) e",
        "The email address to be validated.": "L'indirizzo e-mail da convalidare.",
        "'regular' - Password greater than 10 and has characters that are repeated more than 5 times in sequence": "'regular' - Password maggiore di 10 e con caratteri ripetuti più di 5 volte in sequenza",
        "function evaluates the strength of a given password and returns the type of password strength as a string. The possible strength types are: \"veryWeak\", \"weak\", \"regular\", \"strong\", or \"veryStrong\", based on specific criteria.": "valuta la complessità di una determinata password e restituisce il tipo di complessità della password come stringa. I tipi di forza possibili sono: \"moltoDebole\", \"debole\", \"regolare\", \"forte\" o \"moltoForte\", in base a criteri specifici.",
        "which means it won't clean the email addresses after default domains ['.br', '.io', '.pt', '.us', '.org', '.com'];. If set to": "il che significa che non pulirà gli indirizzi e-mail dopo i domini predefiniti ['.br', '.io', '.pt', '.us', '.org', '.com'];. Se impostato su",
        "Using": "Utilizzando",
        "postalCode": "Codice postale",
        "The postal code to be checked for validity.": "Il codice postale di cui verificare la validità.",
        "or not provided, it will return only the first email address found as a string.": "o non fornito, restituirà solo il primo indirizzo e-mail trovato come stringa.",
        "Function is used to validate phone numbers. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the phone number meets the specified criteria, and \"errorMsg\" will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "La funzione viene utilizzata per convalidare i numeri di telefono. Restituisce un oggetto con due proprietà: \"isValid\" (booleano) e \"errorMsg\" (stringa). La proprietà \"isValid\" sarà true se il numero di telefono soddisfa i criteri specificati e \"errorMsg\" conterrà il messaggio di errore se il numero di telefono non è valido oppure sarà null se il numero di telefono è valido.",
        "otherwise.": "altrimenti.",
        "[optional] - An object with the following optional properties:": "[optional] - Un oggetto con le seguenti proprietà facoltative:",
        "If no email address is found in the input text, the function will return the string 'No email found'.": "Se non viene trovato alcun indirizzo e-mail nel testo di input, la funzione restituirà la stringa \"Nessuna e-mail trovata\".",
        "function extracts email addresses from a given text. If the optional": "estrae gli indirizzi e-mail da un determinato testo. Se l'opzione facoltativa",
        "Brazil": "Brasile",
        "The input value to check if it represents a valid decimal number.": "Il valore di input per verificare se rappresenta un numero decimale valido.",
        "Usage Examples": "Esempi di utilizzo",
        "Index 2: \"Unknown error\"": "Indice 2: \"Errore sconosciuto\"",
        "The function expects the input value to be passed as a string.": "La funzione prevede che il valore di input venga passato come stringa.",
        "the function will return an array with all the email addresses found. If set to": "La funzione restituirà un array con tutti gli indirizzi e-mail trovati. Se impostato su",
        "The input string to check for ASCII characters.": "Stringa di input per verificare la presenza di caratteri ASCII.",
        "function checks if the input value represents a valid postal code for supported countries. It returns": "controlla se il valore di input rappresenta un codice postale valido per i paesi supportati. Ritorna",
        "The input string representing the credit card number to validate.": "Stringa di input che rappresenta il numero di carta di credito da convalidare.",
        "method and checks if the resulting string is empty (i.e., has a length of 0). If the input string consists of only whitespace characters, the function also returns.": "e controlla se la stringa risultante è vuota (cioè ha una lunghezza pari a 0). Se la stringa di input è costituita solo da spazi vuoti, viene restituita anche la funzione.",
        "function is used to check whether an image file is valid or not. It accepts a Buffer as an argument.": "viene utilizzata per verificare se un file immagine è valido o meno. Accetta un oggetto Buffer come argomento.",
        "The function expects the input value to be passed as a string or a number representing a decimal number. If the input is not a string or number, or an empty string, the function throws an error. It uses a regular expression to validate decimal numbers, supports both dot (.) and comma (,) as decimal separators, and checks for multiple decimal separators. Additionally, it performs checks for the negative sign to ensure it is only at the beginning of the value.": "La funzione prevede che il valore di input venga passato come stringa o come numero che rappresenta un numero decimale. Se l'input non è una stringa o un numero o una stringa vuota, la funzione genera un errore. Utilizza un'espressione regolare per convalidare i numeri decimali, supporta sia il punto (.) che la virgola (,) come separatori decimali e verifica la presenza di più separatori decimali. Inoltre, esegue controlli per il segno negativo per assicurarsi che sia solo all'inizio del valore.",
        "Italy": "Italia",
        "function checks if the input string contains only ASCII characters. It returns": "controlla se la stringa di input contiene solo caratteri ASCII. Ritorna",
        "[optional] - The country code to check if the email ends with it. If not provided, no country code check will be performed.": "[facoltativo] - Il prefisso internazionale per verificare se l'e-mail termina con esso. Se non viene fornito, non verrà eseguito alcun controllo del codice paese.",
        "India: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "India: 1 lettera maiuscola seguita da 7 cifre (ad esempio, 'A1234567')",
        "function checks if the input value is a valid number. It returns": "controlla se il valore di input è un numero valido. Ritorna",
        "[optional] - An array of error messages to customize the response. If not provided, the function will use default error messages.": "[facoltativo] - Una matrice di messaggi di errore per personalizzare la risposta. Se non viene fornito, la funzione utilizzerà i messaggi di errore predefiniti.",
        "'veryStrong' - Password longer than 16 characters": "'veryStrong' - Password più lunga di 16 caratteri",
        "function is used to identify the credit card flag based on the first digits of the card number. It returns the name of the card flag as a string.": "viene utilizzata per identificare il flag della carta di credito in base alle prime cifre del numero della carta. Restituisce il nome del flag della scheda come stringa.",
        "United Kingdom: 2 uppercase letters followed by 6 digits (e.g., 'AB123456')": "Regno Unito: 2 lettere maiuscole seguite da 6 cifre (ad esempio, \"AB123456\")",
        "How to use the isValidAudio function": "Come utilizzare la funzione isValidAudio",
        "First, import the": "Innanzitutto, importare il file",
        "if the image is valid and": "se l'immagine è valida e",
        "[optional] The minimum length allowed for the name. Default value: 1.": "[Facoltativo] Lunghezza minima consentita per il nome. Valore predefinito: 1.",
        "the function will remove duplicate emails from the output list. If set to": "La funzione rimuoverà le e-mail duplicate dall'elenco di output. Se impostato su",
        "as it considers such strings to be empty.": "in quanto considera tali stringhe vuote.",
        "Netherlands": "Paesi Bassi",
        "or not provided, it will keep the duplicate emails in the output list.": "o non fornito, manterrà le e-mail duplicate nell'elenco di output.",
        "[optional] - The maximum length of the username. Default is Infinity.": "[optional] - La lunghezza massima del nome utente. Il valore predefinito è Infinito.",
        "Germany: 2 uppercase letters followed by 8 digits (e.g., 'AB12345678')": "Germania: 2 lettere maiuscole seguite da 8 cifre (ad esempio, \"AB12345678\")",
        "'regular' - Password greater than or equal to 6 and less than 8 characters, containing at least one number and one letter": "'regular' - Password maggiore o uguale a 6 e inferiore a 8 caratteri, contenente almeno un numero e una lettera",
        "'veryStrong' - Password with 8 or more characters, containing at least one uppercase letter, one number, one special character and one lowercase letter": "'veryStrong' - Password con 8 o più caratteri, contenente almeno una lettera maiuscola, un numero, un carattere speciale e una lettera minuscola",
        "Default value: false.": "Valore predefinito: false.",
        "The input textarea string to be validated.": "Stringa textarea di input da convalidare.",
        "function checks if the input string is a valid MD5 hash. It returns": "controlla se la stringa di input è un hash MD5 valido. Ritorna",
        "if it is not.": "se non lo è.",
        "Notes": "Note",
        "Return Value": "Valore restituito",
        "false": "falso",
        "The examples provided demonstrate how to use the function with different parameters and show the expected return values.": "Gli esempi forniti illustrano come utilizzare la funzione con parametri diversi e mostrano i valori restituiti previsti.",
        "Canada: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Canada: 1 lettera maiuscola seguita da 7 cifre (ad esempio, \"A1234567\")",
        "function is used to validate US phone numbers. It supports various formats, including \"XXX-XXX-XXXX\", \"(XXX) XXX-XXXX\", and \"1 (XXX) XXX-XXXX\". It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the phone number is valid, and \"errorMsg\" will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "viene utilizzata per convalidare i numeri di telefono statunitensi. Supporta vari formati, tra cui \"XXX-XXX-XXXX\", \"(XXX) XXX-XXXX\" e \"1 (XXX) XXX-XXXX\". Restituisce un oggetto con due proprietà: \"isValid\" (booleano) e \"errorMsg\" (stringa). La proprietà \"isValid\" sarà true se il numero di telefono è valido e \"errorMsg\" conterrà il messaggio di errore se il numero di telefono non è valido oppure sarà null se il numero di telefono è valido.",
        "The function expects the credit card number to be passed as a string. It uses the first digits of the card number to identify the card flag and returns the corresponding flag name as a string. If the card flag cannot be identified or the input is not a string, it returns 'Unknown'.": "La funzione prevede che il numero della carta di credito venga passato come stringa. Usa le prime cifre del numero della carta per identificare il flag della carta e restituisce il nome del flag corrispondente come stringa. Se il flag della scheda non può essere identificato o l'input non è una stringa, restituisce 'Unknown'.",
        "function with the image path as an argument. The function will return": "funzione con il percorso dell'immagine come argomento. La funzione restituirà",
        "Whether the password requires at least one letter. Default value: false.": "Indica se la password richiede almeno una lettera. Valore predefinito: false.",
        "function checks if the input string or number represents a valid decimal number. It returns": "controlla se la stringa o il numero di input rappresenta un numero decimale valido. Ritorna",
        "'regular' - Password between 9 and 12 characters": "'regular' - Password compresa tra 9 e 12 caratteri",
        "if the value matches the postal code format for any of the supported countries, and": "se il valore corrisponde al formato del codice postale per uno dei paesi supportati, e",
        "The function can be imported using ES6 syntax from the \"validateBRPhoneNumber\" package:": "La funzione può essere importata utilizzando la sintassi ES6 dal pacchetto \"validateBRPhoneNumber\":",
        "How to use the isValidTxt function": "Come usare la funzione isValidTxt",
        "set to": "Imposta su",
        "if the MAC address is valid and follows the supported formats, and": "se l'indirizzo MAC è valido e segue i formati supportati, e",
        "'weak' - Password that repeats the same character more than 3 times in a row and is less than 10 characters long": "'weak' - Password che ripete lo stesso carattere più di 3 volte di seguito ed è lunga meno di 10 caratteri",
        "This function is a text area validation utility that checks the validity of a given textarea string based on certain criteria.": "Questa funzione è un'utilità di convalida dell'area di testo che controlla la validità di una determinata stringa dell'area di testo in base a determinati criteri.",
        "The minimum length of the surname. Default is 1.": "La lunghezza minima del cognome. Il valore predefinito è 1.",
        "if the input value matches any of the supported formats, and": "se il valore di input corrisponde a uno dei formati supportati, e",
        "Passing options to the": "Passando le opzioni al metodo",
        "The name to be validated.": "Nome da convalidare.",
        "function checks if the input string is a valid Brazilian ZIP Code (CEP). It returns": "controlla se la stringa di input è un codice postale brasiliano (CEP) valido. Ritorna",
        "The function takes one parameter, which must be a string representing the password to be evaluated.": "La funzione accetta un parametro, che deve essere una stringa che rappresenta la password da valutare.",
        "function is used to validate passwords. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the password meets the specified criteria, and \"errorMsg\" will contain the error message if the password is invalid, or it will be null if the password is valid.": "viene utilizzata per convalidare le password. Restituisce un oggetto con due proprietà: \"isValid\" (booleano) e \"errorMsg\" (stringa). La proprietà \"isValid\" sarà true se la password soddisfa i criteri specificati e \"errorMsg\" conterrà il messaggio di errore se la password non è valida oppure sarà null se la password è valida.",
        "France: 2 uppercase letters followed by 7 digits (e.g., 'AB1234567')": "Francia: 2 lettere maiuscole seguite da 7 cifre (ad esempio, 'AB1234567')",
        "Example": "Esempio",
        "[optional]": "[Facoltativo]",
        "the function will use a default list of valid domains. If set to": "La funzione utilizzerà un elenco predefinito di domini validi. Se impostato su",
        "Default list of valid domains": "Elenco predefinito di domini validi",
        "The input string representing the MD5 hash to validate. The MD5 hash should be a 32-character string consisting of hexadecimal digits (0-9, A-F, a-f).": "Stringa di input che rappresenta l'hash MD5 da convalidare. L'hash MD5 deve essere una stringa di 32 caratteri costituita da cifre esadecimali (0-9, A-F, a-f).",
        "if the email address is valid and follows the supported format, and": "se l'indirizzo e-mail è valido e segue il formato supportato, e",
        "properties, indicating whether the CPF is valid and, in case of an error, the corresponding error message.": "indicante se il CPF è valido e, in caso di errore, il messaggio di errore corrispondente.",
        "function checks if the input string is empty or contains only whitespace characters. It returns": "controlla se la stringa di input è vuota o contiene solo spazi vuoti. Ritorna",
        "The maximum length allowed for the password. Default value: Infinity.": "Lunghezza massima consentita per la password. Valore predefinito: Infinito.",
        "Index 1: \"Can not be empty\"": "Indice 1: \"Non può essere vuoto\"",
        "Canada": "Canada",
        "(optional boolean) - If set to": "(booleano facoltativo) - Se impostato su",
        "The input string representing the date": "Stringa di input che rappresenta la data",
        "[optional] The maximum length allowed for the name. Default value: 20.": "[Facoltativo] Lunghezza massima consentita per il nome. Valore predefinito: 20.",
        "The credit card number for which to identify the flag based on the first digits.": "Il numero della carta di credito per il quale identificare il flag in base alle prime cifre.",
        "The phone number to be validated.": "Il numero di telefono da convalidare.",
        "The maximum allowed length for the textarea.": "Lunghezza massima consentita per l'area di testo.",
        "if the value is a valid decimal number and follows one of the supported formats, and": "se il valore è un numero decimale valido e segue uno dei formati supportati, e",
        "South Africa": "Sud Africa",
        "The minimum length allowed for the password. Default value: 1.": "La lunghezza minima consentita per la password. Valore predefinito: 1.",
        "Examples": "Esempi",
        "Germany": "Germania",
        "How to use the isValidImage function": "Come usare la funzione isValidImage",
        "Function Signature": "Firma della funzione",
        "An array of error messages to customize the response. If not provided, the function will use default error messages.": "Una matrice di messaggi di errore per personalizzare la risposta. Se non viene fornito, la funzione utilizzerà i messaggi di errore predefiniti.",
        "The value to be checked if it represents a valid number.": "Il valore da controllare se rappresenta un numero valido.",
        "The function takes one parameter, which must be a string representing the time to be checked.": "La funzione accetta un parametro, che deve essere una stringa che rappresenta l'ora da controllare.",
        "function checks if the input string represents a valid credit card number using the Luhn algorithm. It returns": "controlla se la stringa di input rappresenta un numero di carta di credito valido utilizzando l'algoritmo di Luhn. Ritorna",
        "if the string is a valid Base64, and": "se la stringa è un valore Base64 valido e",
        "The username to be validated.": "Il nome utente da convalidare.",
        "'weak' - Password between 5 and 8 characters, consisting only of numbers": "'weak' - Password compresa tra 5 e 8 caratteri, composta solo da numeri",
        "China: 1 uppercase letter followed by 8 digits (e.g., 'A12345678')": "Cina: 1 lettera maiuscola seguita da 8 cifre (ad esempio, 'A12345678')",
        "Whether the password requires at least one uppercase letter. Default value: false.": "Indica se la password richiede almeno una lettera maiuscola. Valore predefinito: false.",
        "Function Documentation": "Documentazione delle funzioni",
        "The function expects the input value to be passed as a string. If the input is not a string, the function throws a TypeError. It removes any leading and trailing whitespace from the input string using the.": "La funzione prevede che il valore di input venga passato come stringa. Se l'input non è una stringa, la funzione genera un oggetto TypeError. Rimuove tutti gli spazi vuoti iniziali e finali dalla stringa di input utilizzando il metodo .",
        "The function uses regular expressions to check the input postal code against supported 'countries' postal code formats. It returns": "La funzione utilizza espressioni regolari per controllare il codice postale di input rispetto ai formati di codice postale \"paesi\" supportati. Ritorna",
        "'strong' - Password with 8 or more characters, containing at least one uppercase letter, one number and one lowercase letter": "'strong' - Password con 8 o più caratteri, contenente almeno una lettera maiuscola, un numero e una lettera minuscola",
        "function is used to validate a Brazilian CNPJ (National Registry of Legal Entities) number. It returns an object containing the": "viene utilizzata per convalidare un numero CNPJ (Registro Nazionale delle Persone Giuridiche) brasiliano. Restituisce un oggetto contenente il metodo",
        "The value to be checked if it represents a valid port number.": "Il valore da controllare se rappresenta un numero di porta valido.",
        "United Kingdom": "Regno Unito",
        "isEmail just does simple validations like checking if the string has the formatting of an email like several validators out there,": "isEmail esegue solo semplici convalide come controllare se la stringa ha la formattazione di un'e-mail come molti validatori là fuori,",
        "Switzerland": "Svizzera",
        "if the value is a valid number, and": "se il valore è un numero valido, e",
        "Spain": "Spagna",
        "The input string representing the email address to validate.": "Stringa di input che rappresenta l'indirizzo di posta elettronica da convalidare.",
        "The function checks the length of the password and applies certain criteria to classify the password strength. The returned strength type is based on the following criteria:": "La funzione controlla la lunghezza della password e applica determinati criteri per classificare la complessità della password. Il tipo di resistenza restituito si basa sui seguenti criteri:",
        "What is the difference between": "Qual è la differenza tra",
        "The input string representing the MAC address to validate. The MAC address can be in the following formats: \"001A2B3C4D5E\", \"00:1A:2B:3C:4D:5E\", or \"00-1A-2B-3C-4D-5E\".": "Stringa di input che rappresenta l'indirizzo MAC da convalidare. L'indirizzo MAC può essere nei seguenti formati: \"001A2B3C4D5E\", \"00:1A:2B:3C:4D:5E\" o \"00-1A-2B-3C-4D-5E\".",
        "function checks if the input value represents a valid time in the format \"hh:mm\" or \"hh:mm AM/PM\" or \"hh:mm:ss\" or \"hh:mm:ss AM/PM\". It returns": "controlla se il valore di ingresso rappresenta un'ora valida nel formato \"hh:mm\" o \"hh:mm AM/PM\" o \"hh:mm:ss\" o \"hh:mm:ss AM/PM\". Ritorna",
        "Index 0: \"This textarea is too big\"": "Indice 0: \"Questa area di testo è troppo grande\"",
        "The function uses a regular expression to check if the input time string matches any of the supported time formats. It returns": "La funzione utilizza un'espressione regolare per verificare se la stringa temporale di input corrisponde a uno dei formati di ora supportati. Ritorna",
        "[optional] - This parameter determines whether to check for specific valid email domains or not. If set to": "[facoltativo] - Questo parametro determina se verificare o meno la presenza di domini di posta elettronica validi specifici. Se impostato su",
        "it will clean after default domains. If set to an array of strings, it will clean after the specified custom domains.": "pulirà dopo i domini predefiniti. Se impostato su una matrice di stringhe, verrà pulito dopo i domini personalizzati specificati.",
        "The time to be checked for validity. It must be in one of the supported formats: \"hh:mm\", \"hh:mm AM/PM\", \"hh:mm:ss\", or \"hh:mm:ss AM/PM\".": "L'ora da verificare per verificarne la validità. Deve essere in uno dei formati supportati: \"hh:mm\", \"hh:mm AM/PM\", \"hh:mm:ss\" o \"hh:mm:ss AM/PM\".",
        "Supported Countries": "Paesi supportati",
        "no domain check will be performed. Alternatively, you can pass an array of custom valid domains to perform the check against a specific list.": "Non verrà eseguito alcun controllo del dominio. In alternativa, è possibile passare una matrice di domini validi personalizzati per eseguire il controllo rispetto a un elenco specifico.",
        "it returns an array with all the email addresses found. Otherwise, it returns only the first email address found as a string.": "Restituisce un array con tutti gli indirizzi e-mail trovati. In caso contrario, restituisce solo il primo indirizzo e-mail trovato come stringa.",
        "The function takes one parameter that can be either a string or a number: ": "La funzione accetta un parametro che può essere una stringa o un numero: ",
        "The default error messages are as follows:": "I messaggi di errore predefiniti sono i seguenti:",
        "How to use the isValidPdf function": "Come utilizzare la funzione isValidPdf",
        "function is used to validate usernames. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the username meets the specified criteria, and \"errorMsg\" will contain the error message if the username is invalid, or it will be null if the username is valid.": "viene utilizzata per convalidare i nomi utente. Restituisce un oggetto con due proprietà: \"isValid\" (booleano) e \"errorMsg\" (stringa). La proprietà \"isValid\" sarà true se il nome utente soddisfa i criteri specificati e \"errorMsg\" conterrà il messaggio di errore se il nome utente non è valido oppure sarà null se il nome utente è valido.",
        "if the string is composed of ASCII characters, and": "se la stringa è composta da caratteri ASCII, e",
        "In this example it only allocates 4 bytes for performance reasons, but you can pass the entire file.": "In questo esempio alloca solo 4 byte per motivi di prestazioni, ma è possibile passare l'intero file.",
        "The Brazilian phone number to be validated.": "Il numero di telefono brasiliano da convalidare.",
        "'weak' - Password with less than 6 characters, consisting of numbers and letters": "'weak' - Password con meno di 6 caratteri, composta da numeri e lettere",
        "Japan": "Giappone",
        "function checks if the input string is a valid Base64 string. It returns": "controlla se la stringa di input è una stringa Base64 valida. Ritorna",
        "A flag to determine if the textarea is required.": "Flag per determinare se l'area di testo è obbligatoria.",
        "'strong' - Password between 13 and 16 characters": "'strong' - Password tra 13 e 16 caratteri",
        "(optional boolean | string[]) - Either a boolean value indicating whether to clean after default domains or an array of custom domains to clean after. Default is": "(facoltativo booleano | string[]) - Un valore booleano che indica se pulire dopo i domini predefiniti o una matrice di domini personalizzati da pulire dopo. Il valore predefinito è",
        "true": "vero",
        "The function takes one parameter, which must be a string representing the postal code to be checked.": "La funzione accetta un parametro, che deve essere una stringa che rappresenta il codice postale da controllare.",
        "function checks if the input value represents a valid port number. It returns": "controlla se il valore di input rappresenta un numero di porta valido. Ritorna",
        "function is used to validate a Brazilian CPF (Individual Taxpayer Identification) number. It returns an object containing the": "viene utilizzata per convalidare un numero CPF (Individual Taxpayer Identification) brasiliano. Restituisce un oggetto contenente il metodo",
        "The function expects the input MD5 hash to be passed as a string. If the input is not a string, the function throws a TypeError. It removes leading and trailing whitespace from the input string and checks if the resulting string has a valid length (exactly 32 characters). Then, it uses a regular expression to verify if the cleaned MD5 hash consists only of hexadecimal digits. Additionally, the function checks if the MD5 hash is not a known weak hash, such as \"d41d8cd98f00b204e9800998ecf8427e\". If any of the checks fail, the function returns false; otherwise, it returns true, indicating that the input string is a valid MD5 hash.": "La funzione prevede che l'hash MD5 di input venga passato come stringa. Se l'input non è una stringa, la funzione genera un oggetto TypeError. Rimuove gli spazi vuoti iniziali e finali dalla stringa di input e controlla se la stringa risultante ha una lunghezza valida (esattamente 32 caratteri). Quindi, utilizza un'espressione regolare per verificare se l'hash MD5 pulito è costituito solo da cifre esadecimali. Inoltre, la funzione controlla se l'hash MD5 non è un hash debole noto, ad esempio \"d41d8cd98f00b204e9800998ecf8427e\". Se uno dei controlli ha esito negativo, la funzione restituisce false; in caso contrario, restituisce true, indicando che la stringa di input è un hash MD5 valido.",
        "if the value matches any of these formats, and": "se il valore corrisponde a uno di questi formati, e",
        "The function takes one parameter:": "La funzione accetta un parametro:",
        "The function expects the input MAC address to be passed as a string. If the input is not a string, the function throws a TypeError. It removes all non-alphanumeric characters from the input string using a regular expression and checks if the resulting string has a valid length (exactly 12 characters). Then, it uses another regular expression to verify if the cleaned MAC address matches the supported pattern. The supported pattern is a 12-character string consisting of hexadecimal digits (0-9, A-F, a-f), with optional separators (\":\", \"-\") between pairs of hexadecimal digits.": "La funzione prevede che l'indirizzo MAC di input venga passato come stringa. Se l'input non è una stringa, la funzione genera un oggetto TypeError. Rimuove tutti i caratteri non alfanumerici dalla stringa di input utilizzando un'espressione regolare e controlla se la stringa risultante ha una lunghezza valida (esattamente 12 caratteri). Quindi, utilizza un'altra espressione regolare per verificare se l'indirizzo MAC pulito corrisponde al modello supportato. Il modello supportato è una stringa di 12 caratteri costituita da cifre esadecimali (0-9, A-F, a-f), con separatori facoltativi (\":\", \"-\") tra coppie di cifre esadecimali.",
        "function to convert the value to a floating-point number. If the conversion results in a valid number and the value is finite (not infinity or NaN), the function returns true, indicating that the input value is a valid number. Otherwise, it returns false.": "per convertire il valore in un numero a virgola mobile. Se la conversione restituisce un numero valido e il valore è finito (non infinito o NaN), la funzione restituisce true, indicando che il valore di input è un numero valido. In caso contrario, restituisce false.",
        "United States of America": "Stati Uniti d'America",
        "Function is used to validate names. It returns an object with two properties: 'isValid' (boolean) and 'errorMsg' (string). The 'errorMsg' property will contain the error message if the name is invalid, or it will be null if the name is valid.": "La funzione viene utilizzata per convalidare i nomi. Restituisce un oggetto con due proprietà: 'isValid' (booleano) e 'errorMsg' (stringa). La proprietà 'errorMsg' conterrà il messaggio di errore se il nome non è valido oppure sarà null se il nome è valido.",
        "The function expects the input email to be passed as a string. If the input is not a string, it will throw an error. If the email passed is an invalid email, it will return.": "La funzione prevede che l'e-mail di input venga passata come stringa. Se l'input non è una stringa, genererà un errore. Se l'e-mail passata è un'e-mail non valida, verrà restituita.",
        "The function checks if the input value is not null, undefined, or a boolean type. If any of these conditions are met, the function returns false since these values cannot represent valid numbers. For all other types, the function uses the.": "La funzione controlla se il valore di input non è null, undefined o di tipo booleano. Se una di queste condizioni viene soddisfatta, la funzione restituisce false poiché questi valori non possono rappresentare numeri validi. Per tutti gli altri tipi, la funzione utilizza il metodo .",
        "function is used to check whether an txt file is valid or not. It accepts a Buffer as an argument.": "viene utilizzata per verificare se un file txt è valido o meno. Accetta un oggetto Buffer come argomento.",
        "The password to be evaluated for strength.": "Password da valutare per la sicurezza.",
        "Indicates if the textarea is valid based on the given criteria.": "Indica se l'area di testo è valida in base ai criteri specificati.",
        "if the CEP is valid, and": "se il CEP è valido, e",
        "function is used to check whether an audio file is valid or not. It accepts a Buffer as an argument.": "viene utilizzata per verificare se un file audio è valido o meno. Accetta un oggetto Buffer come argomento.",
        "and": "e",
        "does not, it does complex validations and better than that, you can customize the validations passing the information in the parameters.": "non lo fa, fa convalide complesse e, meglio ancora, puoi personalizzare le convalide passando le informazioni nei parametri.",
        "If the function is called with an invalid value for the": "Se la funzione viene chiamata con un valore non valido per il metodo",
        "function is used to check whether an video file is valid or not. It accepts a Buffer as an argument.": "viene utilizzata per verificare se un file video è valido o meno. Accetta un oggetto Buffer come argomento.",
        "France": "Francia",
        "parameter is set to": "il parametro è impostato su",
        "There are two ways to import the function:": "Esistono due modi per importare la funzione:",
        "An array of custom error messages for different validation conditions. The array should contain three elements corresponding to different error scenarios. If not provided, default error messages will be used. Default Error Messages:": "Matrice di messaggi di errore personalizzati per diverse condizioni di convalida. La matrice deve contenere tre elementi corrispondenti a diversi scenari di errore. Se non specificato, verranno utilizzati i messaggi di errore predefiniti. Messaggi di errore predefiniti:",
        "Italy: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Italia: 1 lettera maiuscola seguita da 7 cifre (ad esempio, 'A1234567')",
        "The function can be imported using ES6 syntax from the \"password-strength-tester\" package:": "La funzione può essere importata utilizzando la sintassi ES6 dal pacchetto \"password-strength-tester\":",
        "Types that are validated": "Tipi convalidati",
        "A list of custom error messages. If not provided, it uses a default list of error messages.": "Elenco di messaggi di errore personalizzati. Se non viene specificato, viene utilizzato un elenco predefinito di messaggi di errore.",
        "The CNPJ number to be validate.": "Il numero CNPJ da convalidare.",
        "Example Usage with Nestjs and Multer": "Esempio di utilizzo con Nestjs e Multer",
        "properties, indicating whether the CNPJ is valid and, in case of an error, the corresponding error message.": "indicando se il CNPJ è valido e, in caso di errore, il messaggio di errore corrispondente.",
        "The function supports postal codes for the following countries:": "La funzione supporta i codici postali per i seguenti paesi:",
        "function is used to check whether an pdf file is valid or not. It accepts a Buffer as an argument.": "viene utilizzata per verificare se un file PDF è valido o meno. Accetta un oggetto Buffer come argomento."
    },
    "Header": {
        "header_docs": "Documentazione",
        "header_already_here": "Tu sei già qui (:",
        "header_title": "Validatore multiforma",
        "header_buy_coffee": "Comprami un caffè ?",
        "header_github": "Il mio github",
        "header_home": "Casa",
        "header_go_home": "Va' a casa",
        "header_info": "Informazioni"
    },
    "Footer": {
        "Services": "Servizi",
        "Terms": "Termini",
        "Privacy Policy": "Informativa sulla privacy",
        "CopyRightMsg": "Validatore © multiforme 2023 - Gabriel Logan",
        "Home": "Casa",
        "About": "Circa"
    },
    "SidebarWrapperJs": {
        "Documentation": "Documentazione",
        "Home": "Casa"
    },
    "DocumentationPython": {
        "Back to home": "Torna alla home",
        "Installation": "Installazione",
        "Install the package using pip: ": "Installare il pacchetto usando pip: ",
        "Functions signature": "Firma delle funzioni",
        "All params with default values are optional.": "Tutti i parametri con valori predefiniti sono facoltativi.",
        "Methods": "Metodi"
    },
    "NotFound": {
        "Msg": "Impossibile trovare questa pagina.",
        "Status": "404"
    },
    "News": {
        "News Ad Page": "Pagina dell'annuncio di notizie",
        "News Ad Page for the Multiform Validator library.": "Pagina dell'annuncio di notizie per la libreria Multiform Validator."
    }
}