{
  "HomeLayout": {
    "Support me on Buy me a coffee": "Soutenez-moi sur Achetez-moi un café !",
    "Description": "Bibliothèque multilingue conçue pour la validation, divers champs de formulaire, tels que : e-mail, téléphone, mot de passe, cpf, cnpj, carte de crédit, chiffres magiques pour la validation du type de mime d’image et bien plus encore.",
    "Technology": "Technologie",
    "Opengraph description": "Bibliothèque multilingue conçue pour la validation, divers champs de formulaire, tels que : e-mail, image, cpf, cnpj, carte de crédit, chiffres magiques et bien plus encore.",
    "Classification": "Bibliothèque de validation",
    "Title": "Validateur multiforme",
    "Opengraph title": "Multiform Validator - Votre bibliothèque de validation multilingue"
  },
  "DocumentationJs": {
    "By - Gabriel Logan": "Par - Gabriel Logan",
    "Installation": "Installation",
    "This package contains various modules for validating different types of data. Below are the available validation modules:": "Ce package contient différents modules permettant de valider différents types de données. Vous trouverez ci-dessous les modules de validation disponibles :",
    "INFO: ": "INFO: ",
    "Welcome Introduction Text": "Bienvenue sur la page principale de Multiform Validator ! Vous trouverez ici une documentation détaillée pour diverses fonctions fournies par Multiform Validator, une bibliothèque JavaScript utile pour la validation des données. Chaque fonction est conçue pour aider à valider différents types de données, ce qui rend votre code plus robuste et plus sûr. Multiform Validator se compose d’une série de fonctions spécialisées qui vous permettent de valider différents types de données, telles que les e-mails, les mots de passe, les noms, les prénoms, les numéros de passeport, les numéros de téléphone, etc. Chaque fonction a des paramètres configurables et fournit des messages d’erreur personnalisables pour répondre aux besoins de votre projet. Sur chaque page de documentation, vous trouverez une description complète de la fonction, y compris son objectif, les paramètres acceptés et des exemples d’utilisation. De plus, vous aurez accès à des détails sur les messages d’erreur par défaut et sur la façon de les personnaliser pour les adapter à votre application. En utilisant le validateur multiforme, vous pouvez vous assurer que l’entrée utilisateur dans vos formulaires est correcte et conforme aux règles établies. Cette validation est essentielle pour éviter des problèmes tels que des entrées non valides, des données corrompues ou des failles de sécurité. Nous travaillons en permanence à l’amélioration et à l’extension de Multiform Validator avec de nouvelles fonctionnalités et améliorations pour en faire un outil encore plus puissant et flexible pour vos besoins de validation. Nous espérons que ces documentations s’avéreront utiles et simplifieront l’utilisation de Multiform Validator dans vos projets. N’hésitez pas à explorer les différentes fonctions disponibles et n’hésitez pas à nous contacter si vous avez des questions ou des suggestions. Merci d’avoir choisi Multiform Validator comme outil de validation de données, et nous vous souhaitons beaucoup de succès dans vos projets ! Équipe de validation multiforme",
    "if you prefer, you can use importing as:": "Si vous préférez, vous pouvez utiliser l’importation comme suit :",
    "Official documentation": "Documentation officielle",
    "Example of use with CDN": "Exemple d’utilisation avec CDN",
    "Data Validator": "Validateur de données",
    "FirstInfoText": "Toutes les fonctions qui ont le nom « validate » renvoient un objet avec deux propriétés, isValid : true | false et errorMsg : 'Chaîne avec erreurs'",
    "Feel free to find bugs Text Msg": "N’hésitez pas à trouver des bugs et à me les signaler. Vos commentaires sont très appréciés. Câlins de Gabriel Logan !",
    "Back to home page": "Retour à la page d’accueil",
    "If you want to help me, you can buy me a coffee (:": "Si vous voulez m’aider, vous pouvez m’acheter un café ( :",
    "SecondInfoText": "Les autres peuvent renvoyer true|false|string|array, regardez la documentation pour chacun d’eux",
    "Available Validation Modules": "Modules de validation disponibles",
    "Feel free to explore msg": "N’hésitez pas à explorer les différentes fonctions et à expérimenter différentes entrées pour comprendre leur comportement. Si vous rencontrez des problèmes ou avez des suggestions, n’hésitez pas à me contacter. Vos commentaires sont précieux et aident à améliorer le package. Bon codage !",
    "This npm package provides JavaScript functions to validate various forms fields.": "Ce package npm fournit des fonctions JavaScript pour valider divers champs de formulaires."
  },
  "DocumentationLayout": {
    "Documentation": "Documentation",
    "Documentation for the Multiform Validator library.": "Documentation de la bibliothèque Multiform Validator."
  },
  "Terms": {
    "Terms and Conditions": "Termes et conditions",
    "Unauthorized use of this website is strictly prohibited.": "L’utilisation non autorisée de ce site Web est strictement interdite.",
    "Terms and Conditions of Multiform Validator library": "Conditions générales de la bibliothèque Multiform Validator",
    "Welcome to Gabriel Logan Web Services. By using this website, you agree to the following terms and conditions:": "Bienvenue sur Gabriel Logan Web Services. En utilisant ce site Web, vous acceptez les termes et conditions suivants :",
    "We do not collect any personal data through this website, and your privacy is important to us.": "Nous ne collectons aucune donnée personnelle par le biais de ce site Web, et votre vie privée est importante pour nous.",
    "Your use of this website and any disputes arising are subject to the laws of [Your Country/Region].": "Votre utilisation de ce site Web et tout litige qui en découle sont soumis aux lois de [Votre pays/région].",
    "The content provided on this website is for general information purposes only, and we make no warranties or representations regarding its accuracy or completeness.": "Le contenu fourni sur ce site Web est fourni à titre d’information générale uniquement, et nous ne donnons aucune garantie ou représentation quant à son exactitude ou son exhaustivité.",
    "We use the \"multiform-validator\" library, licensed under the MIT License, to enhance form field validation. However, we are not responsible for its usage or any consequences resulting from third-party use of the library.": "Nous utilisons la bibliothèque « multiform-validator », sous licence MIT, pour améliorer la validation des champs de formulaire. Cependant, nous ne sommes pas responsables de son utilisation ou des conséquences résultant de l’utilisation de la bibliothèque par des tiers.",
    "Thank you for visiting our website and using our services. If you have any questions or concerns, please don’t hesitate to contact us.": "Merci de visiter notre site Web et d’utiliser nos services. Si vous avez des questions ou des préoccupations, n’hésitez pas à nous contacter."
  },
  "PrivacyPolices": {
    "privacy_questions": "Si vous avez des questions ou des préoccupations concernant nos politiques de confidentialité ou l’utilisation de la bibliothèque « multiform-validator », n’hésitez pas à nous contacter. Nous sommes là pour répondre à toutes vos demandes et assurer votre tranquillité d’esprit.",
    "privacy_intro": "Chez Gabriel Logan Web Services, nous prenons votre vie privée au sérieux. Nous tenons à vous assurer que nous ne collectons aucune donnée sur notre site web, et que nous n’utilisons aucune donnée via la bibliothèque « multiform-validator ». Vos informations restent entièrement confidentielles et votre vie privée est primordiale pour nous.",
    "Privacy Policy": "Politique de confidentialité",
    "validator_local": "La bibliothèque « multiform-validator » est conçue pour valider les champs de formulaire sur vos applications web sans accéder ni transmettre de données à des serveurs externes. Toute la validation se fait localement dans votre navigateur, ce qui garantit que vos informations sensibles ne quittent jamais votre appareil.",
    "privacy_thanks": "Merci d’avoir choisi Gabriel Logan Web Services. Nous sommes impatients de vous fournir des solutions exceptionnelles tout en protégeant votre vie privée à chaque étape du processus.",
    "privacy_title": "Politiques de confidentialité - Vos données sont en sécurité avec nous",
    "validator_secure": "Nous comprenons l’importance de la sécurité des données, et c’est pourquoi nous avons méticuleusement développé la bibliothèque « multiform-validator » pour qu’elle soit 100% sécurisée. Vos données restent sous votre contrôle et nous n’avons accès à aucune information traitée par la bibliothèque.",
    "privacy_no_personal_data": "Lorsque vous visitez notre site Web, soyez assuré qu’aucune donnée personnelle, telle que votre nom, votre adresse e-mail ou vos coordonnées, n’est collectée ou stockée. Nous croyons qu’il est important de vous offrir une expérience de navigation sûre et anonyme.",
    "privacy_trust": "Votre confiance nous est précieuse et nous voulons que vous vous sentiez en confiance dans l’utilisation de nos services et de la bibliothèque « multiform-validator ». Notre engagement envers votre vie privée est inébranlable et nous continuerons à donner la priorité à la sécurité et à la protection de vos données dans tous les aspects de notre travail."
  },
  "Info": {
    "info_intro": "Présentation de multiform-validator, une puissante multi-bibliothèque développée par Gabriel Logan. Cette bibliothèque polyvalente est conçue pour valider de nombreux champs de formulaire, notamment les adresses e-mail, les numéros de téléphone, les mots de passe, les numéros d’enregistrement des contribuables brésiliens, les numéros de carte de crédit, etc.",
    "info_conclusion": "Donc, si vous recherchez une solution complète pour la validation des champs de formulaire, ne cherchez pas plus loin que multiform-validator. Adoptez la puissance de cette bibliothèque et soyez assuré que votre processus de collecte de données sera rationalisé, précis et sécurisé.",
    "info_title": "multiform-validator - Multi bibliothèque pour la validation des champs de formulaire",
    "info_performance": "Gabriel Logan est fier d’avoir développé la bibliothèque de validation multiforme en mettant l’accent sur la performance, l’efficacité et la fiabilité. La bibliothèque est optimisée pour différents navigateurs, assurant une compatibilité transparente pour votre public diversifié.",
    "info_prebuilt_rules": "La bibliothèque de validation multiforme est livrée avec un ensemble complet de règles de validation prédéfinies et d’options personnalisables. Vous pouvez facilement l’intégrer dans vos applications Web et profiter des avantages de la validation côté client, réduisant le nombre de soumissions de formulaires non valides et améliorant l’expérience utilisateur globale.",
    "info_flexibility": "Ce qui distingue multiform-validator, c’est sa flexibilité et sa facilité d’utilisation. Vous pouvez appliquer sans effort des règles de validation à différents champs de formulaire en ajoutant simplement quelques lignes de code JavaScript. De plus, la bibliothèque fournit des messages d’erreur informatifs guidant les utilisateurs sur la façon de corriger leurs entrées, réduisant ainsi la frustration et les taux d’abandon de formulaires.",
    "Info_Page": "Page d’information",
    "info_backend": "Vous pouvez également utiliser le validateur multiformulaire pour faire des validations dans votre backend, cela fonctionne pour tout type de validation de formulaire ou de fonctions qui utilisent javascript, python, alors n’hésitez pas à l’utiliser",
    "info_ensure": "Avec multiform-validator, vous pouvez vous assurer que les données soumises via vos formulaires sont exactes et sécurisées. Que vous créiez un formulaire d’inscription, un processus de paiement ou tout autre système de saisie de données, cette bibliothèque est là pour vous."
  },
  "Manifest": {
    "Description": "Bibliothèque multilingue conçue pour la validation, divers champs de formulaire, tels que : e-mail, téléphone, mot de passe, cpf, cnpj, carte de crédit, chiffres magiques pour la validation du type de mime d’image et bien plus encore.",
    "ShortName": "Validateur multiforme",
    "Name": "Multiform Validator - Votre bibliothèque de validation multilingue"
  },
  "DocumentationPage": {
    "doc_java_title": "Java",
    "doc_py_text": "Vous trouverez ici la documentation du langage Python.",
    "doc_title": "Documentations Page",
    "doc_subtitle": "Voici toutes les langues que nous prenons en charge",
    "doc_java_text": "Vous trouverez ici la documentation du langage Java.",
    "doc_py_title": "Python",
    "doc_js_title": "Javascript",
    "doc_intro": "Bienvenue sur la page de documentation. Vous trouverez ici toutes les langues que nous prenons en charge et la documentation pour chacune d’entre elles.",
    "doc_js_text": "Vous trouverez ici la documentation du langage JavaScript.",
    "doc_java_coming": "En venant ..."
  },
  "About": {
    "about_backend": "Mais mes compétences ne s’arrêtent pas là. Je suis également compétent en développement back-end, avec une expertise dans des langages tels que Python, Java et JavaScript (Node.js). La création d’applications Web robustes et sécurisées est mon point fort, car je comprends les subtilités de la logique côté serveur. Mes solutions sont axées sur l’efficacité, la fiabilité et l’évolutivité, en veillant à ce que même pendant les périodes de pointe, mes applications offrent une expérience utilisateur fluide.",
    "about_frontend": "En tant que développeur front-end, j’ai un œil attentif pour l’expérience utilisateur et la conception d’interfaces. J’aime transformer des concepts créatifs en applications web visuellement captivantes et interactives en utilisant React et Nextjs avec typescript. De la navigation fluide aux animations fluides, je fais attention à chaque détail pour m’assurer que mes projets front-end respirent l’élégance et la fonctionnalité.",
    "About_Page": "À propos de la page",
    "about_achievement": "L’une de mes réalisations les plus fières est la création d’une page Web révolutionnaire qui simplifie et accélère la validation des formulaires. Cette solution ingénieuse est conçue pour aider les particuliers et les entreprises à rationaliser leur processus de validation de formulaires. En tirant parti de mes connaissances approfondies en développement web et en intégrant des technologies de pointe, ma page offre un moyen rapide et SUPER efficace de valider les formulaires. Son interface conviviale et ses fonctionnalités intuitives en font un outil indispensable pour les professionnels qui cherchent à améliorer leur productivité et leur précision dans la collecte de données.",
    "about_title": "Bonjour, je m’appelle Gabriel Logan",
    "about_inspiration": "Lorsque je ne suis pas absorbé par le code, vous pouvez me trouver en train de chercher l’inspiration dans le monde qui m’entoure. Que ce soit pour explorer le plein air, m’immerger dans l’art et la culture ou participer à des discussions stimulantes, je m’inspire d’un large éventail d’expériences qui façonnent mon approche de la programmation et mes interactions avec mes collègues et mes clients.",
    "About_Page_Description": "Faites connaissance avec Gabriel Logan, le créateur de la bibliothèque de validation multiforme, et découvrez sa passion pour le développement Web, les solutions innovantes et son dévouement à l’expérience utilisateur.",
    "about_creative": "Outre mes compétences techniques, je m’épanouis en tant que résolveur de problèmes créatif. J’aime relever les défis avec un état d’esprit innovant et je suis toujours à la recherche de moyens d’améliorer l’expérience utilisateur. Ma capacité à sortir des sentiers battus et à fournir des solutions inventives me distingue comme un véritable leader dans le domaine du développement web.",
    "about_conclusion": "En conclusion, je suis Gabriel Logan, un programmeur passionné qui tisse de manière transparente des compétences front-end et back-end pour créer des expériences web exceptionnelles. Mon esprit d’innovation, mon souci du détail et mon dévouement à l’efficacité m’ont amené à développer une page révolutionnaire qui, je pense, aura un impact significatif sur le monde de la validation des formulaires. Alors que le paysage numérique continue d’évoluer, je suis à l’avant-garde, prêt à relever de nouveaux défis et à faire la différence grâce à mon travail exceptionnel en développement web.",
    "about_intro": "Je me considère comme un programmeur polyvalent passionné par le développement front-end et back-end. Créer des expériences Web exceptionnelles est ce qui me motive, et je suis extrêmement fier du travail que je produis."
  },
  "HomePage": {
    "HelpMsg": "Vous pouvez également aider le programmeur en achetant un café au lien ci-dessous, merci d’avance ( :",
    "SeeThePypiPage": "Voir la page pypi",
    "Intro": "En utilisant ma bibliothèque, vous pouvez convertir de nombreuses lignes de code en très peu de lignes et par conséquent vous avez un code plus propre, plus fort et plus sûr, vous aurez plusieurs outils et fonctions qui feront plusieurs validations de formulaires",
    "Hello": "Bonjour",
    "Documentation": "Documentation",
    "FollowThe": "Suivez le",
    "Welcome": "Bienvenue sur le site du validateur multiformulaire",
    "SeeTheGithubSourceCode": "Voir le code source github",
    "ForMoreInfo": "Pour plus d’informations",
    "SeeTheNpmPage": "Voir la page npm"
  },
  "DocumentationJsFunctions": {
    "Alternatively, you can import the function using CommonJS syntax with": "Vous pouvez également importer la fonction en utilisant la syntaxe CommonJS avec",
    "if the input value matches any of the supported postal code formats, and": "si la valeur d’entrée correspond à l’un des formats de code postal pris en charge, et",
    "The function takes two parameters:": "La fonction prend deux paramètres :",
    "containing the default error message 'Unknown error'.": "contenant le message d’erreur par défaut 'Erreur inconnue'.",
    "If the conversion is successful (resulting in a valid integer), the function checks if the integer is within the valid port range (1 to 65535). If the value is within this range and it is an integer, the function returns true, indicating that the input value represents a valid port number. Otherwise, it returns false.": "Si la conversion réussit (ce qui donne un entier valide), la fonction vérifie si l’entier se trouve dans la plage de ports valide (1 à 65535). Si la valeur se situe dans cette plage et qu’il s’agit d’un entier, la fonction renvoie true, indiquant que la valeur d’entrée représente un numéro de port valide. Sinon, il renvoie false.",
    "The function can be imported using ES6 syntax from the \"multiform-validator\" package:": "La fonction peut être importée en utilisant la syntaxe ES6 du package « multiform-validator » :",
    "Brazil: 9 digits (e.g., '123456789')": "Brésil : 9 chiffres (par exemple, « 123456789 »)",
    "The US phone number to be validated.": "Le numéro de téléphone américain à valider.",
    "if the input string is a valid MD5 hash and follows the supported format, and": "si la chaîne d’entrée est un hachage MD5 valide et suit le format pris en charge, et",
    "parameter (non-array), or if an error occurs during the validation process, the function will return an object with": "(non-tableau), ou si une erreur se produit pendant le processus de validation, la fonction renverra un objet avec",
    "Note:": "Note:",
    "function checks if the input string is a valid MAC address. It returns": "vérifie si la chaîne d’entrée est une adresse MAC valide. Il revient",
    "[optional] - The maximum length allowed for the email address. If not provided, the default value is 400.": "[facultatif] - La longueur maximale autorisée pour l’adresse e-mail. Si elle n’est pas fournie, la valeur par défaut est 400.",
    "Parameters": "Paramètres",
    "The password to be validated.": "Le mot de passe à valider.",
    "This function just checks the syntax of the email to see if it's valid or not, if you need a stronger validation, use: ": "Cette fonction vérifie simplement la syntaxe de l’e-mail pour voir s’il est valide ou non, si vous avez besoin d’une validation plus forte, utilisez : ",
    "function is used to validate Brazilian phone numbers. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"errorMsg\" property will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "est utilisée pour valider les numéros de téléphone brésiliens. Il renvoie un objet avec deux propriétés : « isValid » (booléen) et « errorMsg » (chaîne). La propriété « errorMsg » contient le message d’erreur si le numéro de téléphone n’est pas valide, ou elle est nulle si le numéro de téléphone est valide.",
    "if the input string is empty or consists of only whitespace characters, and": "si la chaîne d’entrée est vide ou ne contient que des caractères d’espace, et",
    "The CPF number to be validated.": "Numéro CPF à valider.",
    "The function first checks if the input value is either a string or a number. If the value is a string, it is converted to an integer using": "La fonction vérifie d’abord si la valeur d’entrée est une chaîne ou un nombre. Si la valeur est une chaîne, elle est convertie en un entier à l’aide de",
    "Supported Passport Formats": "Formats de passeport pris en charge",
    "Default Error Messages": "Messages d’erreur par défaut",
    "optional array": "Matrice en option",
    "Whether the password requires at least one number. Default value: false.": "Si le mot de passe nécessite au moins un chiffre. Valeur par défaut : false.",
    "The function is a text area validation utility that checks the validity of a given textarea string based on certain criteria.": "La fonction est un utilitaire de validation de zone de texte qui vérifie la validité d’une chaîne de zone de texte donnée en fonction de certains critères.",
    "The input string to check if it is a valid Brazilian ZIP Code (CEP).": "Chaîne d’entrée pour vérifier s’il s’agit d’un code postal brésilien (CEP) valide.",
    "The input text from which emails will be extracted.": "Texte d’entrée à partir duquel les e-mails seront extraits.",
    "function is used to validate passport numbers. It returns an object with two properties: 'isValid' (boolean) and 'country' (string). The 'isValid' property will be true if the passport number matches the supported formats, and 'country' property will indicate the country associated with the passport number. If the passport number does not match any supported format, 'isValid' will be false, and 'country' will be null.": "est utilisée pour valider les numéros de passeport. Il renvoie un objet avec deux propriétés : 'isValid' (booléen) et 'country' (chaîne). La propriété 'isValid' sera vraie si le numéro de passeport correspond aux formats pris en charge, et la propriété 'country' indiquera le pays associé au numéro de passeport. Si le numéro de passeport ne correspond à aucun format pris en charge, 'isValid' sera faux et 'country' sera nul.",
    "How to use the isValidVideo function": "Comment utiliser la fonction isValidVideo",
    "function is used to validate surnames. It returns an object with two properties: 'isValid' (boolean) and 'errorMsg' (string). The 'isValid' property will be true if the surname meets the specified criteria, and 'errorMsg' will contain the error message if the surname is invalid, or it will be null if the surname is valid.": "est utilisée pour valider les noms de famille. Il renvoie un objet avec deux propriétés : 'isValid' (booléen) et 'errorMsg' (chaîne). La propriété 'isValid' sera vraie si le nom de famille répond aux critères spécifiés, et 'errorMsg' contiendra le message d’erreur si le nom de famille n’est pas valide, ou il sera nul si le nom de famille est valide.",
    "The surname to be validated.": "Le nom de famille à valider.",
    "Contains the corresponding error message, if any, based on the validation result.": "Contient le message d’erreur correspondant, le cas échéant, en fonction du résultat de la validation.",
    "You can also pass an options object as a second argument to exclude a specific type.": "Vous pouvez également passer un objet options en tant que deuxième argument pour exclure un type spécifique.",
    "Australia: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Australie : 1 lettre majuscule suivie de 7 chiffres (par exemple, « A1234567 »)",
    "United States: 9 digits (e.g., '123456789')": "États-Unis : 9 chiffres (par exemple, « 123456789 »)",
    "function is used to validate email addresses. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"errorMsg\" property will contain the error message if the email address is invalid, or it will be null if the email address is valid.": "est utilisée pour valider les adresses e-mail. Il renvoie un objet avec deux propriétés : « isValid » (booléen) et « errorMsg » (chaîne). La propriété « errorMsg » contiendra le message d’erreur si l’adresse e-mail n’est pas valide, ou elle sera nulle si l’adresse e-mail est valide.",
    "The": "Le",
    "The function expects the input value to be passed as a string. It checks each character of the string, and if any character has a character code greater than 127 (non-ASCII), the function returns": "La fonction s’attend à ce que la valeur d’entrée soit transmise sous forme de chaîne. Elle vérifie chaque caractère de la chaîne, et si un caractère a un code de caractère supérieur à 127 (non-ASCII), la fonction renvoie",
    "The input string to check if it is a valid Base64 string.": "Chaîne d’entrée pour vérifier s’il s’agit d’une chaîne Base64 valide.",
    "The maximum length of the surname. Default is 25.": "La longueur maximale du nom de famille. La valeur par défaut est 25.",
    "[optional] - The minimum length of the username. Default is 1.": "[facultatif] - La longueur minimale du nom d’utilisateur. La valeur par défaut est 1.",
    "If the input is not a string or an empty string, it throws an error.": "Si l’entrée n’est pas une chaîne ou une chaîne vide, elle génère une erreur.",
    "The function expects the input value to be passed as a string. It checks if the string is a valid Base64 string using a regular expression. If the input is not a string or an empty string, it throws an error.": "La fonction s’attend à ce que la valeur d’entrée soit transmise sous forme de chaîne. Il vérifie si la chaîne est une chaîne Base64 valide à l’aide d’une expression régulière. Si l’entrée n’est pas une chaîne ou une chaîne vide, elle génère une erreur.",
    "'veryWeak' - Password with less than 6 characters, consisting only of numbers": "'veryWeak' - Mot de passe de moins de 6 caractères, composé uniquement de chiffres",
    "if the credit card number is valid, and": "si le numéro de carte de crédit est valide, et",
    "The function expects the input value to be passed as a string representing a credit card number. It removes any non-digit characters and applies the Luhn algorithm to validate the credit card number. If the input is not a string, the function throws an error.": "La fonction s’attend à ce que la valeur d’entrée soit transmise sous la forme d’une chaîne représentant un numéro de carte de crédit. Il supprime tous les caractères non numériques et applique l’algorithme de Luhn pour valider le numéro de carte de crédit. Si l’entrée n’est pas une chaîne, la fonction génère une erreur.",
    "function from 'multiform-validator'. Then, define the path to the image you want to check. Call the": "de 'multiform-validator'. Ensuite, définissez le chemin d’accès à l’image que vous souhaitez vérifier. Appelez le",
    "function checks if the input string is a valid date.": "La fonction vérifie si la chaîne d’entrée est une date valide.",
    "The input string to check if it is empty or contains only whitespace characters.": "Chaîne d’entrée pour vérifier si elle est vide ou ne contient que des caractères d’espace.",
    "function checks if the input string is a valid email address. It returns": "vérifie si la chaîne d’entrée est une adresse e-mail valide. Il revient",
    "Whether the password requires at least one special character": "Si le mot de passe nécessite au moins un caractère spécial",
    "The passport number to be validated.": "Le numéro de passeport à valider.",
    "The function returns an object with two properties:": "La fonction renvoie un objet avec deux propriétés :",
    "The function expects the input to be passed as a string.": "La fonction s’attend à ce que l’entrée soit transmise sous forme de chaîne.",
    "if the value is a valid port number (within the range 1 to 65535), and": "si la valeur est un numéro de port valide (compris entre 1 et 65535), et",
    "The email address to be validated.": "L’adresse email à valider.",
    "'regular' - Password greater than 10 and has characters that are repeated more than 5 times in sequence": "'regular' - Mot de passe supérieur à 10 et dont les caractères sont répétés plus de 5 fois dans l’ordre",
    "function evaluates the strength of a given password and returns the type of password strength as a string. The possible strength types are: \"veryWeak\", \"weak\", \"regular\", \"strong\", or \"veryStrong\", based on specific criteria.": "évalue la force d’un mot de passe donné et renvoie le type de force du mot de passe sous forme de chaîne. Les types de force possibles sont : « trèsFaible », « faible », « régulier », « fort » ou « trèsStrong », en fonction de critères spécifiques.",
    "which means it won't clean the email addresses after default domains ['.br', '.io', '.pt', '.us', '.org', '.com'];. If set to": "ce qui signifie qu’il ne nettoiera pas les adresses e-mail après les domaines par défaut ['.br', '.io', '.pt', '.us', '.org', '.com'] ;. Si défini sur",
    "Using": "Utilisant",
    "postalCode": "code postal",
    "The postal code to be checked for validity.": "Le code postal dont la validité doit être vérifiée.",
    "or not provided, it will return only the first email address found as a string.": "ou non fourni, il ne renverra que la première adresse e-mail trouvée sous forme de chaîne.",
    "Function is used to validate phone numbers. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the phone number meets the specified criteria, and \"errorMsg\" will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "La fonction est utilisée pour valider les numéros de téléphone. Il renvoie un objet avec deux propriétés : « isValid » (booléen) et « errorMsg » (chaîne). La propriété « isValid » est true si le numéro de téléphone répond aux critères spécifiés, et « errorMsg » contient le message d’erreur si le numéro de téléphone n’est pas valide, ou il est null si le numéro de téléphone est valide.",
    "otherwise.": "autrement.",
    "[optional] - An object with the following optional properties:": "[facultatif] : objet avec les propriétés facultatives suivantes :",
    "If no email address is found in the input text, the function will return the string 'No email found'.": "Si aucune adresse e-mail n’est trouvée dans le texte d’entrée, la fonction renvoie la chaîne « Aucune adresse e-mail trouvée ».",
    "function extracts email addresses from a given text. If the optional": "extrait les adresses e-mail d’un texte donné. Si l’option",
    "Brazil": "Brésil",
    "The input value to check if it represents a valid decimal number.": "Valeur d’entrée pour vérifier si elle représente un nombre décimal valide.",
    "Usage Examples": "Exemples d’utilisation",
    "Index 2: \"Unknown error\"": "Index 2 : « Erreur inconnue »",
    "The function expects the input value to be passed as a string.": "La fonction s’attend à ce que la valeur d’entrée soit transmise sous forme de chaîne.",
    "the function will return an array with all the email addresses found. If set to": "La fonction renverra un tableau avec toutes les adresses e-mail trouvées. Si défini sur",
    "The input string to check for ASCII characters.": "Chaîne d’entrée pour vérifier les caractères ASCII.",
    "function checks if the input value represents a valid postal code for supported countries. It returns": "vérifie si la valeur d’entrée représente un code postal valide pour les pays pris en charge. Il revient",
    "The input string representing the credit card number to validate.": "Chaîne d’entrée représentant le numéro de carte de crédit à valider.",
    "method and checks if the resulting string is empty (i.e., has a length of 0). If the input string consists of only whitespace characters, the function also returns.": "et vérifie si la chaîne résultante est vide (c’est-à-dire si elle a une longueur de 0). Si la chaîne d’entrée se compose uniquement d’espaces, la fonction renvoie également.",
    "function is used to check whether an image file is valid or not. It accepts a Buffer as an argument.": "est utilisée pour vérifier si un fichier image est valide ou non. Il accepte un tampon comme argument.",
    "The function expects the input value to be passed as a string or a number representing a decimal number. If the input is not a string or number, or an empty string, the function throws an error. It uses a regular expression to validate decimal numbers, supports both dot (.) and comma (,) as decimal separators, and checks for multiple decimal separators. Additionally, it performs checks for the negative sign to ensure it is only at the beginning of the value.": "La fonction s’attend à ce que la valeur d’entrée soit transmise sous forme de chaîne ou de nombre représentant un nombre décimal. Si l’entrée n’est pas une chaîne ou un nombre, ou une chaîne vide, la fonction génère une erreur. Il utilise une expression régulière pour valider les nombres décimaux, prend en charge le point (.) et la virgule (,) comme séparateurs décimaux et vérifie les séparateurs décimaux multiples. De plus, il vérifie le signe négatif pour s’assurer qu’il n’est qu’au début de la valeur.",
    "Italy": "Italie",
    "function checks if the input string contains only ASCII characters. It returns": "vérifie si la chaîne d’entrée ne contient que des caractères ASCII. Il revient",
    "[optional] - The country code to check if the email ends with it. If not provided, no country code check will be performed.": "[facultatif] - Le code pays pour vérifier si l’e-mail se termine par celui-ci. Si elle n’est pas fournie, aucune vérification du code de pays ne sera effectuée.",
    "India: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Inde : 1 lettre majuscule suivie de 7 chiffres (par exemple, « A1234567 »)",
    "function checks if the input value is a valid number. It returns": "vérifie si la valeur d’entrée est un nombre valide. Il revient",
    "[optional] - An array of error messages to customize the response. If not provided, the function will use default error messages.": "[facultatif] - Tableau de messages d’erreur pour personnaliser la réponse. Si elle n’est pas fournie, la fonction utilisera des messages d’erreur par défaut.",
    "'veryStrong' - Password longer than 16 characters": "'veryStrong' - Mot de passe de plus de 16 caractères",
    "function is used to identify the credit card flag based on the first digits of the card number. It returns the name of the card flag as a string.": "est utilisée pour identifier l’indicateur de carte de crédit en fonction des premiers chiffres du numéro de carte. Il renvoie le nom de l’indicateur de carte sous forme de chaîne.",
    "United Kingdom: 2 uppercase letters followed by 6 digits (e.g., 'AB123456')": "Royaume-Uni : 2 lettres majuscules suivies de 6 chiffres (par exemple, « AB123456 »)",
    "How to use the isValidAudio function": "Comment utiliser la fonction isValidAudio",
    "First, import the": "Tout d’abord, importez le fichier",
    "if the image is valid and": "si l’image est valide et",
    "[optional] The minimum length allowed for the name. Default value: 1.": "[facultatif] Longueur minimale autorisée pour le nom. Valeur par défaut : 1.",
    "the function will remove duplicate emails from the output list. If set to": "La fonction supprimera les e-mails en double de la liste de sortie. Si défini sur",
    "as it considers such strings to be empty.": "car il considère que de telles chaînes sont vides.",
    "Netherlands": "Pays-Bas",
    "or not provided, it will keep the duplicate emails in the output list.": "ou non fourni, il conservera les e-mails en double dans la liste de sortie.",
    "[optional] - The maximum length of the username. Default is Infinity.": "[facultatif] - La longueur maximale du nom d’utilisateur. La valeur par défaut est Infinity.",
    "Germany: 2 uppercase letters followed by 8 digits (e.g., 'AB12345678')": "Allemagne : 2 lettres majuscules suivies de 8 chiffres (par exemple, « AB12345678 »)",
    "'regular' - Password greater than or equal to 6 and less than 8 characters, containing at least one number and one letter": "'regular' - Mot de passe supérieur ou égal à 6 et moins de 8 caractères, contenant au moins un chiffre et une lettre",
    "'veryStrong' - Password with 8 or more characters, containing at least one uppercase letter, one number, one special character and one lowercase letter": "'veryStrong' - Mot de passe de 8 caractères ou plus, contenant au moins une lettre majuscule, un chiffre, un caractère spécial et une lettre minuscule",
    "Default value: false.": "Valeur par défaut : false.",
    "The input textarea string to be validated.": "Chaîne textarea d’entrée à valider.",
    "function checks if the input string is a valid MD5 hash. It returns": "vérifie si la chaîne d’entrée est un hachage MD5 valide. Il revient",
    "if it is not.": "si ce n’est pas le cas.",
    "Notes": "Notes",
    "Return Value": "Valeur de retour",
    "false": "faux",
    "The examples provided demonstrate how to use the function with different parameters and show the expected return values.": "Les exemples fournis montrent comment utiliser la fonction avec différents paramètres et montrent les valeurs de retour attendues.",
    "Canada: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Canada : 1 lettre majuscule suivie de 7 chiffres (p. ex., « A1234567 »)",
    "function is used to validate US phone numbers. It supports various formats, including \"XXX-XXX-XXXX\", \"(XXX) XXX-XXXX\", and \"1 (XXX) XXX-XXXX\". It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the phone number is valid, and \"errorMsg\" will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "est utilisée pour valider les numéros de téléphone américains. Il prend en charge différents formats, notamment « XXX-XXX-XXXX », « (XXX) XXX-XXXX » et « 1 (XXX) XXX-XXXX ». Il renvoie un objet avec deux propriétés : « isValid » (booléen) et « errorMsg » (chaîne). La propriété « isValid » sera true si le numéro de téléphone est valide, et « errorMsg » contiendra le message d’erreur si le numéro de téléphone n’est pas valide, ou il sera null si le numéro de téléphone est valide.",
    "The function expects the credit card number to be passed as a string. It uses the first digits of the card number to identify the card flag and returns the corresponding flag name as a string. If the card flag cannot be identified or the input is not a string, it returns 'Unknown'.": "La fonction s’attend à ce que le numéro de carte de crédit soit transmis sous forme de chaîne. Il utilise les premiers chiffres du numéro de carte pour identifier l’indicateur de carte et renvoie le nom de l’indicateur correspondant sous forme de chaîne. Si l’indicateur de carte ne peut pas être identifié ou si l’entrée n’est pas une chaîne, il renvoie « Inconnu ».",
    "function with the image path as an argument. The function will return": "avec le chemin d’accès à l’image comme argument. La fonction renverra",
    "Whether the password requires at least one letter. Default value: false.": "Si le mot de passe nécessite au moins une lettre. Valeur par défaut : false.",
    "function checks if the input string or number represents a valid decimal number. It returns": "vérifie si la chaîne ou le nombre d’entrée représente un nombre décimal valide. Il revient",
    "'regular' - Password between 9 and 12 characters": "'regular' - Mot de passe entre 9 et 12 caractères",
    "if the value matches the postal code format for any of the supported countries, and": "si la valeur correspond au format du code postal de l’un des pays pris en charge, et",
    "The function can be imported using ES6 syntax from the \"validateBRPhoneNumber\" package:": "La fonction peut être importée en utilisant la syntaxe ES6 à partir du package « validateBRPhoneNumber » :",
    "How to use the isValidTxt function": "Comment utiliser la fonction isValidTxt",
    "set to": "se mettre à",
    "if the MAC address is valid and follows the supported formats, and": "si l’adresse MAC est valide et respecte les formats pris en charge, et",
    "'weak' - Password that repeats the same character more than 3 times in a row and is less than 10 characters long": "'weak' - Mot de passe qui répète le même caractère plus de 3 fois de suite et qui comporte moins de 10 caractères",
    "This function is a text area validation utility that checks the validity of a given textarea string based on certain criteria.": "Cette fonction est un utilitaire de validation de zone de texte qui vérifie la validité d’une chaîne de zone de texte donnée en fonction de certains critères.",
    "The minimum length of the surname. Default is 1.": "La longueur minimale du nom de famille. La valeur par défaut est 1.",
    "if the input value matches any of the supported formats, and": "si la valeur d’entrée correspond à l’un des formats pris en charge, et",
    "Passing options to the": "Passer des options à la",
    "The name to be validated.": "Le nom à valider.",
    "function checks if the input string is a valid Brazilian ZIP Code (CEP). It returns": "vérifie si la chaîne d’entrée est un code postal brésilien (CEP) valide. Il revient",
    "The function takes one parameter, which must be a string representing the password to be evaluated.": "La fonction prend un paramètre, qui doit être une chaîne représentant le mot de passe à évaluer.",
    "function is used to validate passwords. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the password meets the specified criteria, and \"errorMsg\" will contain the error message if the password is invalid, or it will be null if the password is valid.": "est utilisée pour valider les mots de passe. Il renvoie un objet avec deux propriétés : « isValid » (booléen) et « errorMsg » (chaîne). La propriété « isValid » sera vraie si le mot de passe répond aux critères spécifiés, et « errorMsg » contiendra le message d’erreur si le mot de passe n’est pas valide, ou il sera nul si le mot de passe est valide.",
    "France: 2 uppercase letters followed by 7 digits (e.g., 'AB1234567')": "France : 2 lettres majuscules suivies de 7 chiffres (par exemple, « AB1234567 »)",
    "Example": "Exemple",
    "[optional]": "[facultatif]",
    "the function will use a default list of valid domains. If set to": "La fonction utilisera une liste par défaut de domaines valides. Si défini sur",
    "Default list of valid domains": "Liste par défaut des domaines valides",
    "The input string representing the MD5 hash to validate. The MD5 hash should be a 32-character string consisting of hexadecimal digits (0-9, A-F, a-f).": "Chaîne d’entrée représentant le hachage MD5 à valider. Le hachage MD5 doit être une chaîne de 32 caractères composée de chiffres hexadécimaux (0-9, A-F, a-f).",
    "if the email address is valid and follows the supported format, and": "si l’adresse e-mail est valide et respecte le format pris en charge, et",
    "properties, indicating whether the CPF is valid and, in case of an error, the corresponding error message.": ", indiquant si le CPF est valide et, en cas d’erreur, le message d’erreur correspondant.",
    "function checks if the input string is empty or contains only whitespace characters. It returns": "vérifie si la chaîne d’entrée est vide ou ne contient que des espaces. Il revient",
    "The maximum length allowed for the password. Default value: Infinity.": "Longueur maximale autorisée pour le mot de passe. Valeur par défaut : Infini.",
    "Index 1: \"Can not be empty\"": "Index 1 : « Ne peut pas être vide »",
    "Canada": "Canada",
    "(optional boolean) - If set to": "(booléen facultatif) - Si défini sur",
    "The input string representing the date": "La chaîne d’entrée représentant la date",
    "[optional] The maximum length allowed for the name. Default value: 20.": "[facultatif] Longueur maximale autorisée pour le nom. Valeur par défaut : 20.",
    "The credit card number for which to identify the flag based on the first digits.": "Numéro de carte de crédit pour lequel identifier l’indicateur en fonction des premiers chiffres.",
    "The phone number to be validated.": "Le numéro de téléphone à valider.",
    "The maximum allowed length for the textarea.": "Longueur maximale autorisée pour la zone de texte.",
    "if the value is a valid decimal number and follows one of the supported formats, and": "si la valeur est un nombre décimal valide et suit l’un des formats pris en charge, et",
    "South Africa": "Afrique du Sud",
    "The minimum length allowed for the password. Default value: 1.": "Longueur minimale autorisée pour le mot de passe. Valeur par défaut : 1.",
    "Examples": "Exemples",
    "Germany": "Allemagne",
    "How to use the isValidImage function": "Comment utiliser la fonction isValidImage",
    "Function Signature": "Signature de fonction",
    "An array of error messages to customize the response. If not provided, the function will use default error messages.": "Un tableau de messages d’erreur pour personnaliser la réponse. Si elle n’est pas fournie, la fonction utilisera des messages d’erreur par défaut.",
    "The value to be checked if it represents a valid number.": "Valeur à vérifier si elle représente un nombre valide.",
    "The function takes one parameter, which must be a string representing the time to be checked.": "La fonction prend un paramètre, qui doit être une chaîne représentant l’heure à vérifier.",
    "function checks if the input string represents a valid credit card number using the Luhn algorithm. It returns": "vérifie si la chaîne d’entrée représente un numéro de carte de crédit valide à l’aide de l’algorithme de Luhn. Il revient",
    "if the string is a valid Base64, and": "si la chaîne est un Base64 valide, et",
    "The username to be validated.": "Nom d’utilisateur à valider.",
    "'weak' - Password between 5 and 8 characters, consisting only of numbers": "'weak' - Mot de passe entre 5 et 8 caractères, composé uniquement de chiffres",
    "China: 1 uppercase letter followed by 8 digits (e.g., 'A12345678')": "Chine : 1 lettre majuscule suivie de 8 chiffres (par exemple, « A12345678 »)",
    "Whether the password requires at least one uppercase letter. Default value: false.": "Si le mot de passe nécessite au moins une lettre majuscule. Valeur par défaut : false.",
    "Function Documentation": "Documentation de la fonction",
    "The function expects the input value to be passed as a string. If the input is not a string, the function throws a TypeError. It removes any leading and trailing whitespace from the input string using the.": "La fonction s’attend à ce que la valeur d’entrée soit transmise sous forme de chaîne. Si l’entrée n’est pas une chaîne, la fonction lève une TypeError. Il supprime tous les espaces de début et de fin de la chaîne d’entrée à l’aide de l’option .",
    "The function uses regular expressions to check the input postal code against supported 'countries' postal code formats. It returns": "La fonction utilise des expressions régulières pour vérifier le code postal saisi par rapport aux formats de code postal « pays » pris en charge. Il revient",
    "'strong' - Password with 8 or more characters, containing at least one uppercase letter, one number and one lowercase letter": "'strong' - Mot de passe de 8 caractères ou plus, contenant au moins une lettre majuscule, un chiffre et une lettre minuscule",
    "function is used to validate a Brazilian CNPJ (National Registry of Legal Entities) number. It returns an object containing the": "est utilisée pour valider un numéro CNPJ (National Registry of Legal Entities) brésilien. Il renvoie un objet contenant le paramètre",
    "The value to be checked if it represents a valid port number.": "Valeur à vérifier si elle représente un numéro de port valide.",
    "United Kingdom": "Royaume-Uni",
    "isEmail just does simple validations like checking if the string has the formatting of an email like several validators out there,": "isEmail fait juste des validations simples comme vérifier si la chaîne a le formatage d’un e-mail comme plusieurs validateurs,",
    "Switzerland": "Suisse",
    "if the value is a valid number, and": "si la valeur est un nombre valide, et",
    "Spain": "Espagne",
    "The input string representing the email address to validate.": "Chaîne d’entrée représentant l’adresse e-mail à valider.",
    "The function checks the length of the password and applies certain criteria to classify the password strength. The returned strength type is based on the following criteria:": "La fonction vérifie la longueur du mot de passe et applique certains critères pour classer la force du mot de passe. Le type de résistance renvoyé est basé sur les critères suivants :",
    "What is the difference between": "Quelle est la différence entre",
    "The input string representing the MAC address to validate. The MAC address can be in the following formats: \"001A2B3C4D5E\", \"00:1A:2B:3C:4D:5E\", or \"00-1A-2B-3C-4D-5E\".": "Chaîne d’entrée représentant l’adresse MAC à valider. L’adresse MAC peut être dans les formats suivants : « 001A2B3C4D5E », « 00:1A :2B :3C :4D :5E » ou « 00-1A-2B-3C-4D-5E ».",
    "function checks if the input value represents a valid time in the format \"hh:mm\" or \"hh:mm AM/PM\" or \"hh:mm:ss\" or \"hh:mm:ss AM/PM\". It returns": "vérifie si la valeur d’entrée représente une heure valide au format « hh :mm » ou « hh :mm AM/PM » ou « hh :mm :ss » ou « hh :mm :ss AM/PM ». Il revient",
    "Index 0: \"This textarea is too big\"": "Index 0 : « Cette zone de texte est trop grande »",
    "The function uses a regular expression to check if the input time string matches any of the supported time formats. It returns": "La fonction utilise une expression régulière pour vérifier si la chaîne de temps d’entrée correspond à l’un des formats d’heure pris en charge. Il revient",
    "[optional] - This parameter determines whether to check for specific valid email domains or not. If set to": "[facultatif] - Ce paramètre détermine s’il faut vérifier des domaines de messagerie valides spécifiques ou non. Si défini sur",
    "it will clean after default domains. If set to an array of strings, it will clean after the specified custom domains.": "il nettoiera après les domaines par défaut. S’il est défini sur un tableau de chaînes, il nettoiera après les domaines personnalisés spécifiés.",
    "The time to be checked for validity. It must be in one of the supported formats: \"hh:mm\", \"hh:mm AM/PM\", \"hh:mm:ss\", or \"hh:mm:ss AM/PM\".": "L’heure à vérifier pour la validité. Il doit être dans l’un des formats pris en charge : « hh :mm », « hh :mm AM/PM », « hh :mm :ss » ou « hh :mm :ss AM/PM ».",
    "Supported Countries": "Pays pris en charge",
    "no domain check will be performed. Alternatively, you can pass an array of custom valid domains to perform the check against a specific list.": "Aucune vérification de domaine ne sera effectuée. Vous pouvez également transmettre un tableau de domaines valides personnalisés pour effectuer la vérification par rapport à une liste spécifique.",
    "it returns an array with all the email addresses found. Otherwise, it returns only the first email address found as a string.": "il renvoie un tableau avec toutes les adresses e-mail trouvées. Sinon, il renvoie uniquement la première adresse e-mail trouvée sous forme de chaîne.",
    "The function takes one parameter that can be either a string or a number: ": "La fonction prend un paramètre qui peut être une chaîne de caractères ou un nombre : ",
    "The default error messages are as follows:": "Les messages d’erreur par défaut sont les suivants :",
    "How to use the isValidPdf function": "Comment utiliser la fonction isValidPdf",
    "function is used to validate usernames. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the username meets the specified criteria, and \"errorMsg\" will contain the error message if the username is invalid, or it will be null if the username is valid.": "est utilisée pour valider les noms d’utilisateur. Il renvoie un objet avec deux propriétés : « isValid » (booléen) et « errorMsg » (chaîne). La propriété « isValid » sera vraie si le nom d’utilisateur répond aux critères spécifiés, et « errorMsg » contiendra le message d’erreur si le nom d’utilisateur n’est pas valide, ou il sera nul si le nom d’utilisateur est valide.",
    "if the string is composed of ASCII characters, and": "si la chaîne est composée de caractères ASCII, et",
    "In this example it only allocates 4 bytes for performance reasons, but you can pass the entire file.": "Dans cet exemple, il n’alloue que 4 octets pour des raisons de performances, mais vous pouvez transmettre le fichier entier.",
    "The Brazilian phone number to be validated.": "Le numéro de téléphone brésilien à valider.",
    "'weak' - Password with less than 6 characters, consisting of numbers and letters": "'weak' - Mot de passe de moins de 6 caractères, composé de chiffres et de lettres",
    "Japan": "Japon",
    "function checks if the input string is a valid Base64 string. It returns": "vérifie si la chaîne d’entrée est une chaîne Base64 valide. Il revient",
    "A flag to determine if the textarea is required.": "Indicateur permettant de déterminer si la zone de texte est requise.",
    "'strong' - Password between 13 and 16 characters": "'strong' - Mot de passe entre 13 et 16 caractères",
    "(optional boolean | string[]) - Either a boolean value indicating whether to clean after default domains or an array of custom domains to clean after. Default is": "(facultatif boolean | string[]) - Soit une valeur booléenne indiquant s’il faut nettoyer après les domaines par défaut, soit un tableau de domaines personnalisés à nettoyer après. La valeur par défaut est",
    "true": "vrai",
    "The function takes one parameter, which must be a string representing the postal code to be checked.": "La fonction prend un paramètre, qui doit être une chaîne représentant le code postal à vérifier.",
    "function checks if the input value represents a valid port number. It returns": "vérifie si la valeur d’entrée représente un numéro de port valide. Il revient",
    "function is used to validate a Brazilian CPF (Individual Taxpayer Identification) number. It returns an object containing the": "est utilisée pour valider un numéro CPF (Individual Taxpayer Identification) brésilien. Il renvoie un objet contenant le paramètre",
    "The function expects the input MD5 hash to be passed as a string. If the input is not a string, the function throws a TypeError. It removes leading and trailing whitespace from the input string and checks if the resulting string has a valid length (exactly 32 characters). Then, it uses a regular expression to verify if the cleaned MD5 hash consists only of hexadecimal digits. Additionally, the function checks if the MD5 hash is not a known weak hash, such as \"d41d8cd98f00b204e9800998ecf8427e\". If any of the checks fail, the function returns false; otherwise, it returns true, indicating that the input string is a valid MD5 hash.": "La fonction s’attend à ce que le hachage MD5 d’entrée soit transmis sous forme de chaîne. Si l’entrée n’est pas une chaîne, la fonction lève une TypeError. Il supprime les espaces de début et de fin de la chaîne d’entrée et vérifie si la chaîne résultante a une longueur valide (exactement 32 caractères). Ensuite, il utilise une expression régulière pour vérifier si le hachage MD5 nettoyé se compose uniquement de chiffres hexadécimaux. En outre, la fonction vérifie si le hachage MD5 n’est pas un hachage faible connu, tel que « d41d8cd98f00b204e9800998ecf8427e ». Si l’une des vérifications échoue, la fonction renvoie false ; sinon, il renvoie true, indiquant que la chaîne d’entrée est un hachage MD5 valide.",
    "if the value matches any of these formats, and": "si la valeur correspond à l’un de ces formats, et",
    "The function takes one parameter:": "La fonction prend un paramètre :",
    "The function expects the input MAC address to be passed as a string. If the input is not a string, the function throws a TypeError. It removes all non-alphanumeric characters from the input string using a regular expression and checks if the resulting string has a valid length (exactly 12 characters). Then, it uses another regular expression to verify if the cleaned MAC address matches the supported pattern. The supported pattern is a 12-character string consisting of hexadecimal digits (0-9, A-F, a-f), with optional separators (\":\", \"-\") between pairs of hexadecimal digits.": "La fonction s’attend à ce que l’adresse MAC d’entrée soit transmise sous forme de chaîne. Si l’entrée n’est pas une chaîne, la fonction lève une TypeError. Il supprime tous les caractères non alphanumériques de la chaîne d’entrée à l’aide d’une expression régulière et vérifie si la chaîne résultante a une longueur valide (exactement 12 caractères). Ensuite, il utilise une autre expression régulière pour vérifier si l’adresse MAC nettoyée correspond au modèle pris en charge. Le modèle pris en charge est une chaîne de 12 caractères composée de chiffres hexadécimaux (0-9, A-F, a-f), avec des séparateurs facultatifs (« : », « -« ) entre des paires de chiffres hexadécimaux.",
    "function to convert the value to a floating-point number. If the conversion results in a valid number and the value is finite (not infinity or NaN), the function returns true, indicating that the input value is a valid number. Otherwise, it returns false.": "pour convertir la valeur en nombre à virgule flottante. Si la conversion aboutit à un nombre valide et que la valeur est finie (et non infinie ou NaN), la fonction renvoie true, indiquant que la valeur d’entrée est un nombre valide. Sinon, il renvoie false.",
    "United States of America": "États-Unis d’Amérique",
    "Function is used to validate names. It returns an object with two properties: 'isValid' (boolean) and 'errorMsg' (string). The 'errorMsg' property will contain the error message if the name is invalid, or it will be null if the name is valid.": "La fonction est utilisée pour valider les noms. Il renvoie un objet avec deux propriétés : 'isValid' (booléen) et 'errorMsg' (chaîne). La propriété 'errorMsg' contiendra le message d’erreur si le nom n’est pas valide, ou il sera null si le nom est valide.",
    "The function expects the input email to be passed as a string. If the input is not a string, it will throw an error. If the email passed is an invalid email, it will return.": "La fonction s’attend à ce que l’e-mail d’entrée soit transmis sous forme de chaîne. Si l’entrée n’est pas une chaîne, elle génère une erreur. Si l’e-mail transmis est un e-mail non valide, il sera renvoyé.",
    "The function checks if the input value is not null, undefined, or a boolean type. If any of these conditions are met, the function returns false since these values cannot represent valid numbers. For all other types, the function uses the.": "La fonction vérifie si la valeur d’entrée n’est pas nulle, indéfinie ou de type booléen. Si l’une de ces conditions est remplie, la fonction renvoie false car ces valeurs ne peuvent pas représenter des nombres valides. Pour tous les autres types, la fonction utilise le.",
    "function is used to check whether an txt file is valid or not. It accepts a Buffer as an argument.": "est utilisée pour vérifier si un fichier TXT est valide ou non. Il accepte un tampon comme argument.",
    "The password to be evaluated for strength.": "Le mot de passe à évaluer pour sa force.",
    "Indicates if the textarea is valid based on the given criteria.": "Indique si la zone de texte est valide en fonction des critères donnés.",
    "if the CEP is valid, and": "si le CEP est valide, et",
    "function is used to check whether an audio file is valid or not. It accepts a Buffer as an argument.": "est utilisée pour vérifier si un fichier audio est valide ou non. Il accepte un tampon comme argument.",
    "and": "et",
    "does not, it does complex validations and better than that, you can customize the validations passing the information in the parameters.": "ne le fait pas, il fait des validations complexes et mieux que cela, vous pouvez personnaliser les validations en transmettant les informations dans les paramètres.",
    "If the function is called with an invalid value for the": "Si la fonction est appelée avec une valeur non valide pour le",
    "function is used to check whether an video file is valid or not. It accepts a Buffer as an argument.": "est utilisée pour vérifier si un fichier vidéo est valide ou non. Il accepte un tampon comme argument.",
    "France": "France",
    "parameter is set to": "est défini sur",
    "There are two ways to import the function:": "Il existe deux façons d’importer la fonction :",
    "An array of custom error messages for different validation conditions. The array should contain three elements corresponding to different error scenarios. If not provided, default error messages will be used. Default Error Messages:": "Tableau de messages d’erreur personnalisés pour différentes conditions de validation. Le tableau doit contenir trois éléments correspondant à différents scénarios d’erreur. S’ils ne sont pas fournis, les messages d’erreur par défaut seront utilisés. Messages d’erreur par défaut :",
    "Italy: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Italie : 1 lettre majuscule suivie de 7 chiffres (par exemple, « A1234567 »)",
    "The function can be imported using ES6 syntax from the \"password-strength-tester\" package:": "La fonction peut être importée en utilisant la syntaxe ES6 à partir du package « password-strength-tester » :",
    "Types that are validated": "Types validés",
    "A list of custom error messages. If not provided, it uses a default list of error messages.": "Une liste de messages d’erreur personnalisés. S’il n’est pas fourni, il utilise une liste par défaut de messages d’erreur.",
    "The CNPJ number to be validate.": "Le numéro CNPJ à valider.",
    "Example Usage with Nestjs and Multer": "Exemple d’utilisation avec Nestjs et Multer",
    "properties, indicating whether the CNPJ is valid and, in case of an error, the corresponding error message.": ", indiquant si le CNPJ est valide et, en cas d’erreur, le message d’erreur correspondant.",
    "The function supports postal codes for the following countries:": "La fonction prend en charge les codes postaux des pays suivants :",
    "function is used to check whether an pdf file is valid or not. It accepts a Buffer as an argument.": "est utilisée pour vérifier si un fichier PDF est valide ou non. Il accepte un tampon comme argument."
  },
  "Header": {
    "header_docs": "Documentation",
    "header_already_here": "Vous êtes déjà ici ( :",
    "header_title": "Validateur multiforme",
    "header_buy_coffee": "m’acheter un café ?",
    "header_github": "Mon github",
    "header_home": "Domicile",
    "header_go_home": "Rentre chez toi",
    "header_info": "Info"
  },
  "Footer": {
    "Services": "Services",
    "Terms": "Petits caractères",
    "Privacy Policy": "Politique de confidentialité",
    "CopyRightMsg": "Validateur © multiforme 2023 - Gabriel Logan",
    "Home": "Domicile",
    "About": "Environ"
  },
  "SidebarWrapperJs": {
    "Documentation": "Documentation",
    "Home": "Domicile"
  },
  "DocumentationPython": {
    "Back to home": "Retour à la page d’accueil",
    "Installation": "Installation",
    "Install the package using pip: ": "Installez le paquet à l’aide de pip : ",
    "Functions signature": "Signature des fonctions",
    "All params with default values are optional.": "Tous les paramètres avec des valeurs par défaut sont facultatifs.",
    "Methods": "Méthode"
  },
  "NotFound": {
    "Msg": "Cette page est introuvable.",
    "Status": "404"
  }
}