{
  "HomeLayout": {
    "Support me on Buy me a coffee": "Unterstützen Sie mich bei Kaufen Sie mir einen Kaffee!",
    "Description": "Mehrsprachige Bibliothek für die Validierung, verschiedene Formularfelder wie: E-Mail, Telefon, Passwort, cpf, cnpj, Kreditkarte, magische Zahlen für die Validierung von Bildmimetypen und vieles mehr.",
    "Technology": "Technologie",
    "Opengraph description": "Mehrsprachige Bibliothek zur Validierung, verschiedene Formularfelder wie: E-Mail, Bild, cpf, cnpj, Kreditkarte, magische Zahlen und vieles mehr.",
    "Classification": "Validierungs-Bibliothek",
    "Title": "Multiform-Validator",
    "Opengraph title": "Multiform Validator - Ihre mehrsprachige Validierungsbibliothek"
  },
  "DocumentationJs": {
    "By - Gabriel Logan": "Von - Gabriel Logan",
    "Installation": "Installation",
    "This package contains various modules for validating different types of data. Below are the available validation modules:": "Dieses Paket enthält verschiedene Module zur Validierung verschiedener Datentypen. Nachfolgend sind die verfügbaren Validierungsmodule aufgeführt:",
    "INFO: ": "INFO: ",
    "Welcome Introduction Text": "Willkommen auf der Hauptseite von Multiform Validator! Hier finden Sie eine ausführliche Dokumentation zu verschiedenen Funktionen von Multiform Validator, einer nützlichen JavaScript-Bibliothek zur Datenvalidierung. Jede Funktion ist so konzipiert, dass sie bei der Validierung verschiedener Datentypen hilft und Ihren Code robuster und sicherer macht. Multiform Validator besteht aus einer Reihe von spezialisierten Funktionen, mit denen Sie verschiedene Datentypen wie E-Mails, Passwörter, Vornamen, Nachnamen, Passnummern, Telefonnummern und mehr validieren können. Jede Funktion verfügt über konfigurierbare Parameter und bietet anpassbare Fehlermeldungen, die den Anforderungen Ihres Projekts entsprechen. Auf jeder Dokumentationsseite finden Sie eine umfassende Beschreibung der Funktion, einschließlich ihres Zwecks, akzeptierter Parameter und Anwendungsbeispiele. Darüber hinaus haben Sie Zugriff auf Details zu Standardfehlermeldungen und wie Sie diese an Ihre Anwendung anpassen können. Durch die Verwendung von Multiform Validator können Sie sicherstellen, dass Benutzereingaben in Ihren Formularen korrekt und konform mit den festgelegten Regeln sind. Diese Validierung ist wichtig, um Probleme wie ungültige Einträge, beschädigte Daten oder Sicherheitslücken zu vermeiden. Wir arbeiten kontinuierlich daran, Multiform Validator mit neuen Funktionen und Verbesserungen zu erweitern und zu erweitern, um es zu einem noch leistungsfähigeren und flexibleren Werkzeug für Ihre Validierungsanforderungen zu machen. Wir hoffen, dass sich diese Dokumentationen als hilfreich erweisen und die Verwendung von Multiform Validator in Ihren Projekten vereinfachen. Erkunden Sie die verschiedenen verfügbaren Funktionen und zögern Sie nicht, uns zu kontaktieren, wenn Sie Fragen oder Anregungen haben. Vielen Dank, dass Sie sich für Multiform Validator als Datenvalidierungstool entschieden haben, und wir wünschen Ihnen viel Erfolg bei Ihren Projekten! Multiform-Validator-Team",
    "if you prefer, you can use importing as:": "Wenn Sie möchten, können Sie importieren als:",
    "Official documentation": "Offizielle Dokumentation",
    "Example of use with CDN": "Beispiel für die Verwendung mit CDN",
    "Data Validator": "Daten-Validator",
    "FirstInfoText": "Alle Funktionen, die den Namen \"validate\" haben, geben ein Objekt mit zwei Eigenschaften zurück, isValid: true | false und errorMsg: 'Zeichenfolge mit Fehlern'",
    "Feel free to find bugs Text Msg": "Fühlen Sie sich frei, Fehler zu finden und sie mir zu melden. Ihr Feedback wird sehr geschätzt. Umarmungen von Gabriel Logan!",
    "Back to home page": "Zurück zur Startseite",
    "If you want to help me, you can buy me a coffee (:": "Wenn du mir helfen willst, kannst du mir einen Kaffee kaufen (:",
    "SecondInfoText": "Die verbleibenden können true|false|string|array zurückgeben, sehen Sie sich das Dokument für jeden an",
    "Available Validation Modules": "Verfügbare Validierungsmodule",
    "Feel free to explore msg": "Fühlen Sie sich frei, die verschiedenen Funktionen zu erkunden und mit verschiedenen Eingaben zu experimentieren, um ihr Verhalten zu verstehen. Wenn Sie auf Probleme stoßen oder Vorschläge haben, zögern Sie nicht, sich an mich zu wenden. Ihr Feedback ist wertvoll und hilft, das Paket zu verbessern. Viel Spaß beim Programmieren!",
    "This npm package provides JavaScript functions to validate various forms fields.": "Dieses npm-Paket bietet JavaScript-Funktionen zur Validierung verschiedener Formularfelder."
  },
  "DocumentationLayout": {
    "Documentation": "Dokumentation",
    "Documentation for the Multiform Validator library.": "Dokumentation für die Multiform Validator-Bibliothek."
  },
  "Terms": {
    "Terms and Conditions": "Allgemeine Geschäftsbedingungen",
    "Unauthorized use of this website is strictly prohibited.": "Die unbefugte Nutzung dieser Website ist strengstens untersagt.",
    "Terms and Conditions of Multiform Validator library": "Allgemeine Geschäftsbedingungen der Multiform Validator-Bibliothek",
    "Welcome to Gabriel Logan Web Services. By using this website, you agree to the following terms and conditions:": "Willkommen bei Gabriel Logan Web Services. Durch die Nutzung dieser Website erklären Sie sich mit den folgenden Bedingungen einverstanden:",
    "We do not collect any personal data through this website, and your privacy is important to us.": "Wir sammeln keine personenbezogenen Daten über diese Website, und Ihre Privatsphäre ist uns wichtig.",
    "Your use of this website and any disputes arising are subject to the laws of [Your Country/Region].": "Ihre Nutzung dieser Website und alle daraus resultierenden Streitigkeiten unterliegen den Gesetzen von [Ihrem Land/Ihrer Region].",
    "The content provided on this website is for general information purposes only, and we make no warranties or representations regarding its accuracy or completeness.": "Die auf dieser Website bereitgestellten Inhalte dienen nur allgemeinen Informationszwecken, und wir geben keine Garantien oder Zusicherungen hinsichtlich ihrer Richtigkeit oder Vollständigkeit.",
    "We use the \"multiform-validator\" library, licensed under the MIT License, to enhance form field validation. However, we are not responsible for its usage or any consequences resulting from third-party use of the library.": "Wir verwenden die unter der MIT-Lizenz lizenzierte Bibliothek \"multiform-validator\", um die Validierung von Formularfeldern zu verbessern. Wir sind jedoch nicht verantwortlich für deren Nutzung oder Folgen, die sich aus der Nutzung der Bibliothek durch Dritte ergeben.",
    "Thank you for visiting our website and using our services. If you have any questions or concerns, please don’t hesitate to contact us.": "Vielen Dank für Ihren Besuch auf unserer Website und die Nutzung unserer Dienste. Wenn Sie Fragen oder Bedenken haben, zögern Sie bitte nicht, uns zu kontaktieren."
  },
  "PrivacyPolices": {
    "privacy_questions": "Wenn Sie Fragen oder Bedenken zu unseren Datenschutzrichtlinien oder der Verwendung der \"Multiform-Validator\"-Bibliothek haben, zögern Sie bitte nicht, uns zu kontaktieren. Wir sind hier, um alle Anfragen zu beantworten und dafür zu sorgen, dass Sie beruhigt sind.",
    "privacy_intro": "Bei Gabriel Logan Web Services nehmen wir Ihre Privatsphäre ernst. Wir möchten Ihnen versichern, dass wir auf unserer Website keine Daten sammeln und keine Daten über die Bibliothek \"Multiform-Validator\" verwenden. Ihre Daten bleiben absolut vertraulich und Ihre Privatsphäre ist für uns von größter Bedeutung.",
    "Privacy Policy": "Datenschutzrichtlinie",
    "validator_local": "Die Bibliothek \"Multiform-Validator\" wurde entwickelt, um Formularfelder in Ihren Webanwendungen zu validieren, ohne auf externe Server zuzugreifen oder Daten an diese zu übertragen. Die gesamte Validierung erfolgt lokal in Ihrem Browser, um sicherzustellen, dass Ihre sensiblen Informationen Ihr Gerät nie verlassen.",
    "privacy_thanks": "Vielen Dank, dass Sie sich für Gabriel Logan Web Services entschieden haben. Wir freuen uns darauf, Ihnen außergewöhnliche Lösungen anzubieten und gleichzeitig Ihre Privatsphäre bei jedem Schritt zu schützen.",
    "privacy_title": "Datenschutzrichtlinien - Ihre Daten sind bei uns sicher",
    "validator_secure": "Wir wissen, wie wichtig Datensicherheit ist, und deshalb haben wir die Bibliothek \"Multiform-Validator\" sorgfältig entwickelt, um 100% sicher zu sein. Ihre Daten bleiben unter Ihrer Kontrolle und wir haben keinen Zugriff auf Informationen, die von der Bibliothek verarbeitet werden.",
    "privacy_no_personal_data": "Wenn Sie unsere Website besuchen, können Sie sicher sein, dass keine personenbezogenen Daten wie Name, E-Mail-Adresse oder Kontaktinformationen erhoben oder gespeichert werden. Wir glauben daran, Ihnen ein sicheres und anonymes Surferlebnis zu bieten.",
    "privacy_trust": "Ihr Vertrauen ist für uns wertvoll, und wir möchten, dass Sie sich bei der Nutzung unserer Dienste und der Bibliothek \"Multiform-Validator\" sicher fühlen. Unser Engagement für Ihre Privatsphäre ist unerschütterlich, und wir werden der Sicherheit und dem Schutz Ihrer Daten in allen Aspekten unserer Arbeit weiterhin Priorität einräumen."
  },
  "Info": {
    "info_intro": "Wir stellen den Multiform-Validator vor, eine leistungsstarke Multi-Bibliothek, die von Gabriel Logan entwickelt wurde. Diese vielseitige Bibliothek wurde entwickelt, um zahlreiche Formularfelder zu validieren, darunter E-Mail-Adressen, Telefonnummern, Passwörter, CPF (brasilianische Steuerregisternummern), Kreditkartennummern und mehr.",
    "info_conclusion": "Wenn Sie also nach einer umfassenden Lösung für die Formularfeldvalidierung suchen, sind Sie bei multiform-validator genau richtig. Nutzen Sie die Leistungsfähigkeit dieser Bibliothek und seien Sie versichert, dass Ihr Datenerfassungsprozess optimiert, genau und sicher ist.",
    "info_title": "multiform-validator - Multi-Bibliothek für die Validierung von Formularfeldern",
    "info_performance": "Gabriel Logan ist stolz darauf, die Multiform-Validator-Bibliothek mit Schwerpunkt auf Leistung, Effizienz und Zuverlässigkeit zu entwickeln. Die Bibliothek ist für verschiedene Browser optimiert und gewährleistet eine nahtlose Kompatibilität für Ihr vielfältiges Publikum.",
    "info_prebuilt_rules": "Die Multiform-Validator-Bibliothek enthält einen umfangreichen Satz vorgefertigter Validierungsregeln und anpassbarer Optionen. Sie können es einfach in Ihre Webanwendungen integrieren und die Vorteile der clientseitigen Validierung nutzen, wodurch die Anzahl ungültiger Formularübermittlungen reduziert und die allgemeine Benutzererfahrung verbessert wird.",
    "info_flexibility": "Was Multiform-Validator auszeichnet, ist seine Flexibilität und Benutzerfreundlichkeit. Sie können mühelos Validierungsregeln auf verschiedene Formularfelder anwenden, indem Sie einfach ein paar Zeilen JavaScript-Code hinzufügen. Darüber hinaus bietet die Bibliothek informative Fehlermeldungen, die Benutzer anleiten, wie sie ihre Eingaben korrigieren können, wodurch Frustration und Abbruchraten von Formularen reduziert werden.",
    "Info_Page": "Informationsseite",
    "info_backend": "Sie können den Multiform-Validator auch verwenden, um Validierungen in Ihrem Backend durchzuführen, er funktioniert für jede Art von Formularvalidierung oder Funktionen, die Javascript oder Python verwenden, also zögern Sie nicht, ihn zu verwenden",
    "info_ensure": "Mit dem Multiform-Validator können Sie sicherstellen, dass die über Ihre Formulare übermittelten Daten korrekt und sicher sind. Egal, ob Sie ein Registrierungsformular, einen Checkout-Prozess oder ein Dateneingabesystem erstellen, diese Bibliothek bietet Ihnen alles, was Sie brauchen."
  },
  "Manifest": {
    "Description": "Mehrsprachige Bibliothek für die Validierung, verschiedene Formularfelder wie: E-Mail, Telefon, Passwort, cpf, cnpj, Kreditkarte, magische Zahlen für die Validierung von Bildmimetypen und vieles mehr.",
    "ShortName": "Multiform-Validator",
    "Name": "Multiform Validator - Ihre mehrsprachige Validierungsbibliothek"
  },
  "DocumentationPage": {
    "doc_java_title": "Java",
    "doc_py_text": "Hier finden Sie die Dokumentation für die Python-Sprache.",
    "doc_title": "Seite \"Dokumentationen\"",
    "doc_subtitle": "Hier sind alle Sprachen, die wir unterstützen",
    "doc_java_text": "Hier finden Sie die Dokumentation für die Java-Sprache.",
    "doc_py_title": "Python",
    "doc_js_title": "JavaScript (Englisch)",
    "doc_intro": "Willkommen auf der Dokumentationsseite. Hier finden Sie alle Sprachen, die wir unterstützen, und die Dokumentation für jede von ihnen.",
    "doc_js_text": "Hier finden Sie die Dokumentation für die JavaScript-Sprache.",
    "doc_java_coming": "In der kommenden ..."
  },
  "About": {
    "about_backend": "Aber meine Fähigkeiten hören hier nicht auf. Ich bin ebenso kompetent in der Backend-Entwicklung und verfüge über Kenntnisse in Sprachen wie Python, Java und JavaScript (Node.js). Das Erstellen robuster und sicherer Webanwendungen ist meine Stärke, da ich die Feinheiten der serverseitigen Logik verstehe. Meine Lösungen sind auf Effizienz, Zuverlässigkeit und Skalierbarkeit ausgerichtet und stellen sicher, dass meine Anwendungen auch in Spitzenzeiten eine reibungslose Benutzererfahrung bieten.",
    "about_frontend": "Als Frontend-Entwickler habe ich ein scharfes Auge für User Experience und Interface-Design. Ich liebe es, kreative Konzepte mit React und Nextjs mit Typoskript in visuell fesselnde und interaktive Webanwendungen umzuwandeln. Von der nahtlosen Navigation bis hin zu flüssigen Animationen achte ich auf jedes Detail, um sicherzustellen, dass meine Frontend-Projekte Eleganz und Funktionalität ausstrahlen.",
    "About_Page": "Über die Seite",
    "about_achievement": "Eine meiner stolzesten Errungenschaften ist die Erstellung einer bahnbrechenden Webseite, die die Formularvalidierung vereinfacht und beschleunigt. Diese geniale Lösung wurde entwickelt, um Menschen und Unternehmen dabei zu helfen, ihren Formularvalidierungsprozess zu rationalisieren. Durch die Nutzung meines umfangreichen Wissens in der Webentwicklung und die Integration modernster Technologien bietet meine Seite eine blitzschnelle und SUPER effiziente Möglichkeit, Formulare zu validieren. Seine benutzerfreundliche Oberfläche und seine intuitiven Funktionen machen es zu einem unverzichtbaren Werkzeug für Profis, die ihre Produktivität und Genauigkeit bei der Datenerfassung verbessern möchten.",
    "about_title": "Hallo, ich bin Gabriel Logan",
    "about_inspiration": "Wenn ich nicht in Code vertieft bin, suche ich vielleicht Inspiration in der Welt um mich herum. Egal, ob ich die Natur erkunde, in Kunst und Kultur eintauche oder mich an zum Nachdenken anregenden Diskussionen beteilige, ich schöpfe aus einer Vielzahl von Erfahrungen, die meine Herangehensweise an die Programmierung und meine Interaktionen mit Kollegen und Kunden prägen.",
    "About_Page_Description": "Lernen Sie Gabriel Logan kennen, den Schöpfer der Multiform-Validator-Bibliothek, und erfahren Sie mehr über seine Leidenschaft für Webentwicklung, innovative Lösungen und sein Engagement für die Benutzererfahrung.",
    "about_creative": "Abgesehen von meinen technischen Fähigkeiten blühe ich als kreativer Problemlöser auf. Ich liebe es, Herausforderungen mit einer innovativen Denkweise anzugehen und bin immer auf der Suche nach Möglichkeiten, die Benutzererfahrung zu verbessern. Meine Fähigkeit, über den Tellerrand hinauszuschauen und erfinderische Lösungen zu liefern, zeichnet mich als echte Führungspersönlichkeit auf dem Gebiet der Webentwicklung aus.",
    "about_conclusion": "Zusammenfassend bin ich Gabriel Logan, ein leidenschaftlicher Programmierer, der Front-End- und Back-End-Fähigkeiten nahtlos miteinander verwebt, um außergewöhnliche Weberlebnisse zu schaffen. Meine innovative Denkweise, meine Liebe zum Detail und mein Engagement für Effizienz haben mich dazu veranlasst, eine bahnbrechende Seite zu entwickeln, von der ich glaube, dass sie einen erheblichen Einfluss auf die Welt der Formularvalidierung haben wird. Während sich die digitale Landschaft weiterentwickelt, stehe ich an vorderster Front, bereit, neue Herausforderungen anzunehmen und durch meine außergewöhnliche Arbeit in der Webentwicklung etwas zu bewirken.",
    "about_intro": "Ich betrachte mich als vielseitigen Programmierer mit einer Leidenschaft für Frontend- und Backend-Entwicklung. Das Schaffen außergewöhnlicher Weberlebnisse treibt mich an, und ich bin sehr stolz auf die Arbeit, die ich produziere."
  },
  "HomePage": {
    "HelpMsg": "Sie können dem Programmierer auch helfen, indem Sie unter dem unten stehenden Link einen Kaffee kaufen, danke im Voraus (:",
    "SeeThePypiPage": "Siehe die pypi-Seite",
    "Intro": "Mit meiner Bibliothek können Sie viele Codezeilen in sehr wenige Zeilen umwandeln und als Ergebnis haben Sie einen saubereren, stärkeren und sichereren Code, Sie haben mehrere Tools und Funktionen, die mehrere Formularvalidierungen durchführen",
    "Hello": "Hallo",
    "Documentation": "Dokumentation",
    "FollowThe": "Folgen Sie dem",
    "Welcome": "Willkommen auf der Website des Multiform-Validators",
    "SeeTheGithubSourceCode": "Siehe die Github-Quelle",
    "ForMoreInfo": "Weitere Informationen",
    "SeeTheNpmPage": "Siehe die npm-Seite"
  },
  "DocumentationJsFunctions": {
    "Alternatively, you can import the function using CommonJS syntax with": "Alternativ können Sie die Funktion mit der CommonJS-Syntax mit",
    "if the input value matches any of the supported postal code formats, and": "wenn der Eingabewert mit einem der unterstützten Postleitzahlenformate übereinstimmt, und",
    "The function takes two parameters:": "Die Funktion benötigt zwei Parameter:",
    "containing the default error message 'Unknown error'.": "mit der Standardfehlermeldung \"Unbekannter Fehler\".",
    "If the conversion is successful (resulting in a valid integer), the function checks if the integer is within the valid port range (1 to 65535). If the value is within this range and it is an integer, the function returns true, indicating that the input value represents a valid port number. Otherwise, it returns false.": "Wenn die Konvertierung erfolgreich ist (was zu einer gültigen Ganzzahl führt), prüft die Funktion, ob die Ganzzahl innerhalb des gültigen Portbereichs (1 bis 65535) liegt. Wenn der Wert innerhalb dieses Bereichs liegt und es sich um eine ganze Zahl handelt, gibt die Funktion true zurück, was angibt, dass der Eingabewert eine gültige Portnummer darstellt. Andernfalls wird false zurückgegeben.",
    "The function can be imported using ES6 syntax from the \"multiform-validator\" package:": "Die Funktion kann mit ES6-Syntax aus dem Paket \"multiform-validator\" importiert werden:",
    "Brazil: 9 digits (e.g., '123456789')": "Brasilien: 9 Ziffern (z. B. \"123456789\")",
    "The US phone number to be validated.": "Die zu validierende US-Telefonnummer.",
    "if the input string is a valid MD5 hash and follows the supported format, and": "wenn die Eingabezeichenfolge ein gültiger MD5-Hash ist und dem unterstützten Format folgt, und",
    "parameter (non-array), or if an error occurs during the validation process, the function will return an object with": "(Nicht-Array) oder wenn während des Validierungsprozesses ein Fehler auftritt, gibt die Funktion ein Objekt mit",
    "Note:": "Anmerkung:",
    "function checks if the input string is a valid MAC address. It returns": "prüft, ob die Eingabezeichenfolge eine gültige MAC-Adresse ist. Es kehrt zurück",
    "[optional] - The maximum length allowed for the email address. If not provided, the default value is 400.": "[optional] - Die maximal zulässige Länge für die E-Mail-Adresse. Wenn nicht angegeben, ist der Standardwert 400.",
    "Parameters": "Parameter",
    "The password to be validated.": "Das zu validierende Passwort.",
    "This function just checks the syntax of the email to see if it's valid or not, if you need a stronger validation, use: ": "Diese Funktion überprüft nur die Syntax der E-Mail, um festzustellen, ob sie gültig ist oder nicht, wenn Sie eine stärkere Validierung benötigen, verwenden Sie: ",
    "function is used to validate Brazilian phone numbers. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"errorMsg\" property will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "-Funktion wird verwendet, um brasilianische Telefonnummern zu validieren. Es gibt ein Objekt mit zwei Eigenschaften zurück: \"isValid\" (boolesch) und \"errorMsg\" (Zeichenfolge). Die Eigenschaft \"errorMsg\" enthält die Fehlermeldung, wenn die Telefonnummer ungültig ist, oder sie ist null, wenn die Telefonnummer gültig ist.",
    "if the input string is empty or consists of only whitespace characters, and": "wenn die Eingabezeichenfolge leer ist oder nur aus Leerzeichen besteht, und",
    "The CPF number to be validated.": "Die zu validierende CPF-Nummer.",
    "The function first checks if the input value is either a string or a number. If the value is a string, it is converted to an integer using": "Die Funktion prüft zunächst, ob der Eingabewert entweder eine Zeichenfolge oder eine Zahl ist. Wenn es sich bei dem Wert um einen String handelt, wird er mit",
    "Supported Passport Formats": "Unterstützte Passformate",
    "Default Error Messages": "Standard-Fehlermeldungen",
    "optional array": "optionales Array",
    "Whether the password requires at least one number. Default value: false.": "Ob das Passwort mindestens eine Zahl erfordert. Standardwert: false.",
    "The function is a text area validation utility that checks the validity of a given textarea string based on certain criteria.": "Die Funktion ist ein Dienstprogramm zur Validierung von Textbereichen, das die Gültigkeit einer bestimmten Textbereichszeichenfolge anhand bestimmter Kriterien überprüft.",
    "The input string to check if it is a valid Brazilian ZIP Code (CEP).": "Die Eingabezeichenfolge, um zu überprüfen, ob es sich um eine gültige brasilianische Postleitzahl (CEP) handelt.",
    "The input text from which emails will be extracted.": "Der Eingabetext, aus dem E-Mails extrahiert werden.",
    "function is used to validate passport numbers. It returns an object with two properties: 'isValid' (boolean) and 'country' (string). The 'isValid' property will be true if the passport number matches the supported formats, and 'country' property will indicate the country associated with the passport number. If the passport number does not match any supported format, 'isValid' will be false, and 'country' will be null.": "wird verwendet, um Passnummern zu validieren. Es gibt ein Objekt mit zwei Eigenschaften zurück: 'isValid' (boolesch) und 'country' (Zeichenfolge). Die Eigenschaft \"isValid\" ist true, wenn die Passnummer mit den unterstützten Formaten übereinstimmt, und die Eigenschaft \"country\" gibt das Land an, das mit der Passnummer verknüpft ist. Wenn die Passnummer mit keinem unterstützten Format übereinstimmt, ist \"isValid\" false und \"country\" null.",
    "How to use the isValidVideo function": "So verwenden Sie die isValidVideo-Funktion",
    "function is used to validate surnames. It returns an object with two properties: 'isValid' (boolean) and 'errorMsg' (string). The 'isValid' property will be true if the surname meets the specified criteria, and 'errorMsg' will contain the error message if the surname is invalid, or it will be null if the surname is valid.": "wird verwendet, um Nachnamen zu validieren. Es gibt ein Objekt mit zwei Eigenschaften zurück: 'isValid' (boolesch) und 'errorMsg' (Zeichenfolge). Die Eigenschaft 'isValid' ist true, wenn der Nachname die angegebenen Kriterien erfüllt, und 'errorMsg' enthält die Fehlermeldung, wenn der Nachname ungültig ist, oder sie ist null, wenn der Nachname gültig ist.",
    "The surname to be validated.": "Der zu validierende Nachname.",
    "Contains the corresponding error message, if any, based on the validation result.": "Enthält die entsprechende Fehlermeldung, falls vorhanden, basierend auf dem Validierungsergebnis.",
    "You can also pass an options object as a second argument to exclude a specific type.": "Sie können auch ein options-Objekt als zweites Argument übergeben, um einen bestimmten Typ auszuschließen.",
    "Australia: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Australien: 1 Großbuchstabe gefolgt von 7 Ziffern (z. B. \"A1234567\")",
    "United States: 9 digits (e.g., '123456789')": "Vereinigte Staaten: 9 Ziffern (z. B. \"123456789\")",
    "function is used to validate email addresses. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"errorMsg\" property will contain the error message if the email address is invalid, or it will be null if the email address is valid.": "wird verwendet, um E-Mail-Adressen zu validieren. Es gibt ein Objekt mit zwei Eigenschaften zurück: \"isValid\" (boolesch) und \"errorMsg\" (Zeichenfolge). Die Eigenschaft \"errorMsg\" enthält die Fehlermeldung, wenn die E-Mail-Adresse ungültig ist, oder sie ist null, wenn die E-Mail-Adresse gültig ist.",
    "The": "Das",
    "The function expects the input value to be passed as a string. It checks each character of the string, and if any character has a character code greater than 127 (non-ASCII), the function returns": "Die Funktion erwartet, dass der Eingabewert als Zeichenfolge übergeben wird. Sie prüft jedes Zeichen der Zeichenfolge, und wenn ein Zeichen einen Zeichencode größer als 127 (Nicht-ASCII) hat, gibt die Funktion",
    "The input string to check if it is a valid Base64 string.": "Die Eingabezeichenfolge, um zu überprüfen, ob es sich um eine gültige Base64-Zeichenfolge handelt.",
    "The maximum length of the surname. Default is 25.": "Die maximale Länge des Nachnamens. Der Standardwert ist 25.",
    "[optional] - The minimum length of the username. Default is 1.": "[optional] - Die Mindestlänge des Benutzernamens. Der Standardwert ist 1.",
    "If the input is not a string or an empty string, it throws an error.": "Wenn die Eingabe keine Zeichenfolge oder eine leere Zeichenfolge ist, wird ein Fehler ausgelöst.",
    "The function expects the input value to be passed as a string. It checks if the string is a valid Base64 string using a regular expression. If the input is not a string or an empty string, it throws an error.": "Die Funktion erwartet, dass der Eingabewert als Zeichenfolge übergeben wird. Es prüft anhand eines regulären Ausdrucks, ob es sich bei der Zeichenfolge um eine gültige Base64-Zeichenfolge handelt. Wenn die Eingabe keine Zeichenfolge oder eine leere Zeichenfolge ist, wird ein Fehler ausgelöst.",
    "'veryWeak' - Password with less than 6 characters, consisting only of numbers": "'veryWeak' - Passwort mit weniger als 6 Zeichen, das nur aus Zahlen besteht",
    "if the credit card number is valid, and": "ob die Kreditkartennummer gültig ist und",
    "The function expects the input value to be passed as a string representing a credit card number. It removes any non-digit characters and applies the Luhn algorithm to validate the credit card number. If the input is not a string, the function throws an error.": "Die Funktion erwartet, dass der Eingabewert als Zeichenfolge übergeben wird, die eine Kreditkartennummer darstellt. Es entfernt alle nicht-numerischen Zeichen und wendet den Luhn-Algorithmus an, um die Kreditkartennummer zu validieren. Wenn die Eingabe keine Zeichenfolge ist, löst die Funktion einen Fehler aus.",
    "function from 'multiform-validator'. Then, define the path to the image you want to check. Call the": "Funktion von 'multiform-validator'. Definieren Sie dann den Pfad zu dem Bild, das Sie überprüfen möchten. Rufen Sie die",
    "function checks if the input string is a valid date.": "prüft, ob die Eingabezeichenfolge ein gültiges Datum ist.",
    "The input string to check if it is empty or contains only whitespace characters.": "Die Eingabezeichenfolge, um zu überprüfen, ob sie leer ist oder nur Leerzeichen enthält.",
    "function checks if the input string is a valid email address. It returns": "prüft, ob es sich bei der Eingabezeichenfolge um eine gültige E-Mail-Adresse handelt. Es kehrt zurück",
    "Whether the password requires at least one special character": "Ob das Passwort mindestens ein Sonderzeichen erfordert",
    "The passport number to be validated.": "Die zu validierende Passnummer.",
    "The function returns an object with two properties:": "Die Funktion gibt ein Objekt mit zwei Eigenschaften zurück:",
    "The function expects the input to be passed as a string.": "Die Funktion erwartet, dass die Eingabe als Zeichenfolge übergeben wird.",
    "if the value is a valid port number (within the range 1 to 65535), and": "wenn es sich bei dem Wert um eine gültige Portnummer handelt (im Bereich von 1 bis 65535), und",
    "The email address to be validated.": "Die zu validierende E-Mail-Adresse.",
    "'regular' - Password greater than 10 and has characters that are repeated more than 5 times in sequence": "'regular' - Passwort größer als 10 und Zeichen, die mehr als 5 Mal hintereinander wiederholt werden",
    "function evaluates the strength of a given password and returns the type of password strength as a string. The possible strength types are: \"veryWeak\", \"weak\", \"regular\", \"strong\", or \"veryStrong\", based on specific criteria.": "wertet die Stärke eines bestimmten Passworts aus und gibt den Typ der Passwortstärke als Zeichenfolge zurück. Die möglichen Stärketypen sind: \"sehr schwach\", \"schwach\", \"normal\", \"stark\" oder \"sehr stark\", basierend auf bestimmten Kriterien.",
    "which means it won't clean the email addresses after default domains ['.br', '.io', '.pt', '.us', '.org', '.com'];. If set to": "Das bedeutet, dass die E-Mail-Adressen nach den Standarddomänen ['.br', '.io', '.pt', '.us', '.org', '.com']; nicht bereinigt werden. Wenn auf",
    "Using": "Benutzend",
    "postalCode": "Postleitzahl",
    "The postal code to be checked for validity.": "Die Postleitzahl, die auf Gültigkeit überprüft werden soll.",
    "or not provided, it will return only the first email address found as a string.": "oder nicht angegeben wird, wird nur die erste gefundene E-Mail-Adresse als Zeichenfolge zurückgegeben.",
    "Function is used to validate phone numbers. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the phone number meets the specified criteria, and \"errorMsg\" will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "Die Funktion wird verwendet, um Telefonnummern zu validieren. Es gibt ein Objekt mit zwei Eigenschaften zurück: \"isValid\" (boolesch) und \"errorMsg\" (Zeichenfolge). Die Eigenschaft \"isValid\" ist true, wenn die Telefonnummer die angegebenen Kriterien erfüllt, und \"errorMsg\" enthält die Fehlermeldung, wenn die Telefonnummer ungültig ist, oder sie ist null, wenn die Telefonnummer gültig ist.",
    "otherwise.": "sonst.",
    "[optional] - An object with the following optional properties:": "[optional] - Ein Objekt mit den folgenden optionalen Eigenschaften:",
    "If no email address is found in the input text, the function will return the string 'No email found'.": "Wenn im Eingabetext keine E-Mail-Adresse gefunden wird, gibt die Funktion die Zeichenfolge \"Keine E-Mail gefunden\" zurück.",
    "function extracts email addresses from a given text. If the optional": "extrahiert E-Mail-Adressen aus einem bestimmten Text. Wenn das optionale",
    "Brazil": "Brazilien",
    "The input value to check if it represents a valid decimal number.": "Der Eingabewert, um zu überprüfen, ob es sich um eine gültige Dezimalzahl handelt.",
    "Usage Examples": "Anwendungsbeispiele",
    "Index 2: \"Unknown error\"": "Index 2: \"Unbekannter Fehler\"",
    "The function expects the input value to be passed as a string.": "Die Funktion erwartet, dass der Eingabewert als Zeichenfolge übergeben wird.",
    "the function will return an array with all the email addresses found. If set to": "Die Funktion gibt ein Array mit allen gefundenen E-Mail-Adressen zurück. Wenn auf",
    "The input string to check for ASCII characters.": "Die Eingabezeichenfolge, die auf ASCII-Zeichen überprüft werden soll.",
    "function checks if the input value represents a valid postal code for supported countries. It returns": "prüft, ob der Eingabewert eine gültige Postleitzahl für unterstützte Länder darstellt. Es kehrt zurück",
    "The input string representing the credit card number to validate.": "Die Eingabezeichenfolge, die die zu validierende Kreditkartennummer darstellt.",
    "method and checks if the resulting string is empty (i.e., has a length of 0). If the input string consists of only whitespace characters, the function also returns.": "-Methode und prüft, ob die resultierende Zeichenfolge leer ist (d. h. eine Länge von 0 hat). Wenn die Eingabezeichenfolge nur aus Leerzeichen besteht, gibt die Funktion ebenfalls zurück.",
    "function is used to check whether an image file is valid or not. It accepts a Buffer as an argument.": "wird verwendet, um zu prüfen, ob eine Bilddatei gültig ist oder nicht. Es akzeptiert einen Buffer als Argument.",
    "The function expects the input value to be passed as a string or a number representing a decimal number. If the input is not a string or number, or an empty string, the function throws an error. It uses a regular expression to validate decimal numbers, supports both dot (.) and comma (,) as decimal separators, and checks for multiple decimal separators. Additionally, it performs checks for the negative sign to ensure it is only at the beginning of the value.": "Die Funktion erwartet, dass der Eingabewert als Zeichenfolge oder Zahl übergeben wird, die eine Dezimalzahl darstellt. Wenn die Eingabe keine Zeichenfolge oder Zahl oder eine leere Zeichenfolge ist, löst die Funktion einen Fehler aus. Es verwendet einen regulären Ausdruck zum Überprüfen von Dezimalzahlen, unterstützt sowohl Punkt (.) als auch Komma (,) als Dezimaltrennzeichen und prüft auf mehrere Dezimaltrennzeichen. Darüber hinaus prüft es das negative Vorzeichen, um sicherzustellen, dass es nur am Anfang des Werts steht.",
    "Italy": "Italien",
    "function checks if the input string contains only ASCII characters. It returns": "prüft, ob die Eingabezeichenfolge nur ASCII-Zeichen enthält. Es kehrt zurück",
    "[optional] - The country code to check if the email ends with it. If not provided, no country code check will be performed.": "[optional] - Die Landesvorwahl, um zu überprüfen, ob die E-Mail damit endet. Wenn nicht angegeben, wird keine Ländercodeprüfung durchgeführt.",
    "India: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Indien: 1 Großbuchstabe gefolgt von 7 Ziffern (z. B. \"A1234567\")",
    "function checks if the input value is a valid number. It returns": "prüft, ob der Eingabewert eine gültige Zahl ist. Es kehrt zurück",
    "[optional] - An array of error messages to customize the response. If not provided, the function will use default error messages.": "[optional] - Ein Array von Fehlermeldungen zum Anpassen der Antwort. Wenn nicht angegeben, verwendet die Funktion Standardfehlermeldungen.",
    "'veryStrong' - Password longer than 16 characters": "'veryStrong' - Passwort länger als 16 Zeichen",
    "function is used to identify the credit card flag based on the first digits of the card number. It returns the name of the card flag as a string.": "wird verwendet, um das Kreditkartenflag anhand der ersten Ziffern der Kartennummer zu identifizieren. Er gibt den Namen des Kartenflags als Zeichenfolge zurück.",
    "United Kingdom: 2 uppercase letters followed by 6 digits (e.g., 'AB123456')": "Vereinigtes Königreich: 2 Großbuchstaben gefolgt von 6 Ziffern (z. B. \"AB123456\")",
    "How to use the isValidAudio function": "So verwenden Sie die isValidAudio-Funktion",
    "First, import the": "Importieren Sie zunächst die",
    "if the image is valid and": "ob das Bild gültig ist und",
    "[optional] The minimum length allowed for the name. Default value: 1.": "[optional] Die zulässige Mindestlänge für den Namen. Standardwert: 1.",
    "the function will remove duplicate emails from the output list. If set to": "Die Funktion entfernt doppelte E-Mails aus der Ausgabeliste. Wenn auf",
    "as it considers such strings to be empty.": "da es solche Saiten als leer betrachtet.",
    "Netherlands": "Niederlande",
    "or not provided, it will keep the duplicate emails in the output list.": "oder nicht bereitgestellt werden, werden die doppelten E-Mails in der Ausgabeliste beibehalten.",
    "[optional] - The maximum length of the username. Default is Infinity.": "[optional] - Die maximale Länge des Benutzernamens. Der Standardwert ist Infinity.",
    "Germany: 2 uppercase letters followed by 8 digits (e.g., 'AB12345678')": "Deutschland: 2 Großbuchstaben gefolgt von 8 Ziffern (z. B. \"AB12345678\")",
    "'regular' - Password greater than or equal to 6 and less than 8 characters, containing at least one number and one letter": "'regular' - Passwort größer oder gleich 6 und weniger als 8 Zeichen, das mindestens eine Zahl und einen Buchstaben enthält",
    "'veryStrong' - Password with 8 or more characters, containing at least one uppercase letter, one number, one special character and one lowercase letter": "'veryStrong' - Passwort mit 8 oder mehr Zeichen, das mindestens einen Großbuchstaben, eine Zahl, ein Sonderzeichen und einen Kleinbuchstaben enthält",
    "Default value: false.": "Standardwert: false.",
    "The input textarea string to be validated.": "Die einzugebende Textbereichszeichenfolge, die überprüft werden soll.",
    "function checks if the input string is a valid MD5 hash. It returns": "prüft, ob die Eingabezeichenfolge ein gültiger MD5-Hash ist. Es kehrt zurück",
    "if it is not.": "wenn nicht.",
    "Notes": "Notizen",
    "Return Value": "Rückgabewert",
    "false": "FALSCH",
    "The examples provided demonstrate how to use the function with different parameters and show the expected return values.": "Die bereitgestellten Beispiele zeigen, wie die Funktion mit verschiedenen Parametern verwendet wird, und zeigen die erwarteten Rückgabewerte.",
    "Canada: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Kanada: 1 Großbuchstabe gefolgt von 7 Ziffern (z. B. \"A1234567\")",
    "function is used to validate US phone numbers. It supports various formats, including \"XXX-XXX-XXXX\", \"(XXX) XXX-XXXX\", and \"1 (XXX) XXX-XXXX\". It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the phone number is valid, and \"errorMsg\" will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "wird verwendet, um US-Telefonnummern zu validieren. Es unterstützt verschiedene Formate, darunter \"XXX-XXX-XXXX\", \"(XXX) XXX-XXXX\" und \"1 (XXX) XXX-XXXX\". Es gibt ein Objekt mit zwei Eigenschaften zurück: \"isValid\" (boolesch) und \"errorMsg\" (Zeichenfolge). Die Eigenschaft \"isValid\" ist true, wenn die Telefonnummer gültig ist, und \"errorMsg\" enthält die Fehlermeldung, wenn die Telefonnummer ungültig ist, oder sie ist null, wenn die Telefonnummer gültig ist.",
    "The function expects the credit card number to be passed as a string. It uses the first digits of the card number to identify the card flag and returns the corresponding flag name as a string. If the card flag cannot be identified or the input is not a string, it returns 'Unknown'.": "Die Funktion erwartet, dass die Kreditkartennummer als Zeichenfolge übergeben wird. Es verwendet die ersten Ziffern der Kartennummer, um das Kartenflag zu identifizieren, und gibt den entsprechenden Flaggennamen als Zeichenfolge zurück. Wenn das Kartenflag nicht identifiziert werden kann oder die Eingabe keine Zeichenfolge ist, wird \"Unbekannt\" zurückgegeben.",
    "function with the image path as an argument. The function will return": "mit dem Bildpfad als Argument. Die Funktion wird zurückgegeben",
    "Whether the password requires at least one letter. Default value: false.": "Ob das Passwort mindestens einen Buchstaben erfordert. Standardwert: false.",
    "function checks if the input string or number represents a valid decimal number. It returns": "prüft, ob die Eingabezeichenfolge oder -zahl eine gültige Dezimalzahl darstellt. Es kehrt zurück",
    "'regular' - Password between 9 and 12 characters": "'regular' - Passwort zwischen 9 und 12 Zeichen",
    "if the value matches the postal code format for any of the supported countries, and": "ob der Wert mit dem Postleitzahlenformat für eines der unterstützten Länder übereinstimmt, und",
    "The function can be imported using ES6 syntax from the \"validateBRPhoneNumber\" package:": "Die Funktion kann mit ES6-Syntax aus dem Paket \"validateBRPhoneNumber\" importiert werden:",
    "How to use the isValidTxt function": "So verwenden Sie die isValidTxt-Funktion",
    "set to": "auf",
    "if the MAC address is valid and follows the supported formats, and": "ob die MAC-Adresse gültig ist und den unterstützten Formaten entspricht, und",
    "'weak' - Password that repeats the same character more than 3 times in a row and is less than 10 characters long": "'weak' - Passwort, das dasselbe Zeichen mehr als 3 Mal hintereinander wiederholt und weniger als 10 Zeichen lang ist",
    "This function is a text area validation utility that checks the validity of a given textarea string based on certain criteria.": "Diese Funktion ist ein Dienstprogramm zur Validierung von Textbereichen, das die Gültigkeit einer bestimmten Textbereichszeichenfolge anhand bestimmter Kriterien überprüft.",
    "The minimum length of the surname. Default is 1.": "Die Mindestlänge des Nachnamens. Der Standardwert ist 1.",
    "if the input value matches any of the supported formats, and": "wenn der Eingabewert mit einem der unterstützten Formate übereinstimmt, und",
    "Passing options to the": "Übergeben von Optionen an die",
    "The name to be validated.": "Der Name, der überprüft werden soll.",
    "function checks if the input string is a valid Brazilian ZIP Code (CEP). It returns": "prüft, ob es sich bei der Eingabezeichenfolge um eine gültige brasilianische Postleitzahl (CEP) handelt. Es kehrt zurück",
    "The function takes one parameter, which must be a string representing the password to be evaluated.": "Die Funktion benötigt einen Parameter, der eine Zeichenfolge sein muss, die das auszuwertende Kennwort darstellt.",
    "function is used to validate passwords. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the password meets the specified criteria, and \"errorMsg\" will contain the error message if the password is invalid, or it will be null if the password is valid.": "wird verwendet, um Passwörter zu validieren. Es gibt ein Objekt mit zwei Eigenschaften zurück: \"isValid\" (boolesch) und \"errorMsg\" (Zeichenfolge). Die Eigenschaft \"isValid\" ist true, wenn das Kennwort die angegebenen Kriterien erfüllt, und \"errorMsg\" enthält die Fehlermeldung, wenn das Kennwort ungültig ist, oder sie ist null, wenn das Kennwort gültig ist.",
    "France: 2 uppercase letters followed by 7 digits (e.g., 'AB1234567')": "Frankreich: 2 Großbuchstaben gefolgt von 7 Ziffern (z. B. \"AB1234567\")",
    "Example": "Beispiel",
    "[optional]": "[optional]",
    "the function will use a default list of valid domains. If set to": "Die Funktion verwendet eine Standardliste gültiger Domänen. Wenn auf",
    "Default list of valid domains": "Standardliste gültiger Domänen",
    "The input string representing the MD5 hash to validate. The MD5 hash should be a 32-character string consisting of hexadecimal digits (0-9, A-F, a-f).": "Die Eingabezeichenfolge, die den zu validierenden MD5-Hash darstellt. Der MD5-Hash sollte eine 32-stellige Zeichenfolge sein, die aus hexadezimalen Ziffern (0-9, A-F, a-f) besteht.",
    "if the email address is valid and follows the supported format, and": "ob die E-Mail-Adresse gültig ist und dem unterstützten Format entspricht, und",
    "properties, indicating whether the CPF is valid and, in case of an error, the corresponding error message.": "Eigenschaften, die angeben, ob der CPF gültig ist, und im Fehlerfall die entsprechende Fehlermeldung.",
    "function checks if the input string is empty or contains only whitespace characters. It returns": "prüft, ob die Eingabezeichenfolge leer ist oder nur Leerzeichen enthält. Es kehrt zurück",
    "The maximum length allowed for the password. Default value: Infinity.": "Die maximal zulässige Länge für das Passwort. Standardwert: Unendlich.",
    "Index 1: \"Can not be empty\"": "Index 1: \"Kann nicht leer sein\"",
    "Canada": "Kanada",
    "(optional boolean) - If set to": "(optionaler boolescher Wert) - Wenn auf",
    "The input string representing the date": "Die Eingabezeichenfolge, die das Datum darstellt",
    "[optional] The maximum length allowed for the name. Default value: 20.": "[optional] Die maximal zulässige Länge für den Namen. Standardwert: 20.",
    "The credit card number for which to identify the flag based on the first digits.": "Die Kreditkartennummer, für die das Flag anhand der ersten Ziffern identifiziert werden soll.",
    "The phone number to be validated.": "Die zu validierende Telefonnummer.",
    "The maximum allowed length for the textarea.": "Die maximal zulässige Länge für das Textfeld.",
    "if the value is a valid decimal number and follows one of the supported formats, and": "wenn der Wert eine gültige Dezimalzahl ist und einem der unterstützten Formate folgt, und",
    "South Africa": "Südafrika",
    "The minimum length allowed for the password. Default value: 1.": "Die zulässige Mindestlänge für das Passwort. Standardwert: 1.",
    "Examples": "Beispiele",
    "Germany": "Deutschland",
    "How to use the isValidImage function": "So verwenden Sie die isValidImage-Funktion",
    "Function Signature": "Funktionssignatur",
    "An array of error messages to customize the response. If not provided, the function will use default error messages.": "Ein Array von Fehlermeldungen zum Anpassen der Antwort. Wenn nicht angegeben, verwendet die Funktion Standardfehlermeldungen.",
    "The value to be checked if it represents a valid number.": "Der Wert, der überprüft werden soll, wenn er eine gültige Zahl darstellt.",
    "The function takes one parameter, which must be a string representing the time to be checked.": "Die Funktion nimmt einen Parameter an, der eine Zeichenfolge sein muss, die die zu überprüfende Zeit darstellt.",
    "function checks if the input string represents a valid credit card number using the Luhn algorithm. It returns": "prüft mit dem Luhn-Algorithmus, ob die Eingabezeichenfolge eine gültige Kreditkartennummer darstellt. Es kehrt zurück",
    "if the string is a valid Base64, and": "wenn die Zeichenfolge ein gültiges Base64 ist, und",
    "The username to be validated.": "Der zu validierende Benutzername.",
    "'weak' - Password between 5 and 8 characters, consisting only of numbers": "'weak' - Passwort zwischen 5 und 8 Zeichen, das nur aus Zahlen besteht",
    "China: 1 uppercase letter followed by 8 digits (e.g., 'A12345678')": "China: 1 Großbuchstabe gefolgt von 8 Ziffern (z. B. \"A12345678\")",
    "Whether the password requires at least one uppercase letter. Default value: false.": "Gibt an, ob das Kennwort mindestens einen Großbuchstaben erfordert. Standardwert: false.",
    "Function Documentation": "Funktionsdokumentation",
    "The function expects the input value to be passed as a string. If the input is not a string, the function throws a TypeError. It removes any leading and trailing whitespace from the input string using the.": "Die Funktion erwartet, dass der Eingabewert als Zeichenfolge übergeben wird. Wenn die Eingabe keine Zeichenfolge ist, löst die Funktion einen TypeError aus. Es entfernt alle führenden und nachfolgenden Leerzeichen aus der Eingabezeichenfolge mit dem.",
    "The function uses regular expressions to check the input postal code against supported 'countries' postal code formats. It returns": "Die Funktion verwendet reguläre Ausdrücke, um die eingegebene Postleitzahl anhand der unterstützten Postleitzahlenformate \"Länder\" zu überprüfen. Es kehrt zurück",
    "'strong' - Password with 8 or more characters, containing at least one uppercase letter, one number and one lowercase letter": "'strong' - Passwort mit 8 oder mehr Zeichen, das mindestens einen Großbuchstaben, eine Zahl und einen Kleinbuchstaben enthält",
    "function is used to validate a Brazilian CNPJ (National Registry of Legal Entities) number. It returns an object containing the": "-Funktion wird verwendet, um eine brasilianische CNPJ-Nummer (Nationales Register juristischer Personen) zu validieren. Es gibt ein Objekt zurück, das die",
    "The value to be checked if it represents a valid port number.": "Der Wert, der überprüft werden soll, wenn er eine gültige Portnummer darstellt.",
    "United Kingdom": "Vereinigtes Königreich",
    "isEmail just does simple validations like checking if the string has the formatting of an email like several validators out there,": "isEmail führt nur einfache Validierungen durch, z. B. die Überprüfung, ob die Zeichenfolge die Formatierung einer E-Mail hat, wie mehrere Validatoren da draußen.",
    "Switzerland": "Schweiz",
    "if the value is a valid number, and": "wenn der Wert eine gültige Zahl ist, und",
    "Spain": "Spanien",
    "The input string representing the email address to validate.": "Die Eingabezeichenfolge, die die zu validierende E-Mail-Adresse darstellt.",
    "The function checks the length of the password and applies certain criteria to classify the password strength. The returned strength type is based on the following criteria:": "Die Funktion prüft die Länge des Passworts und wendet bestimmte Kriterien an, um die Passwortstärke zu klassifizieren. Der zurückgegebene Stärketyp basiert auf den folgenden Kriterien:",
    "What is the difference between": "Was ist der Unterschied zwischen",
    "The input string representing the MAC address to validate. The MAC address can be in the following formats: \"001A2B3C4D5E\", \"00:1A:2B:3C:4D:5E\", or \"00-1A-2B-3C-4D-5E\".": "Die Eingabezeichenfolge, die die zu validierende MAC-Adresse darstellt. Die MAC-Adresse kann in den folgenden Formaten vorliegen: \"001A2B3C4D5E\", \"00:1A:2B:3C:4D:5E\" oder \"00-1A-2B-3C-4D-5E\".",
    "function checks if the input value represents a valid time in the format \"hh:mm\" or \"hh:mm AM/PM\" or \"hh:mm:ss\" or \"hh:mm:ss AM/PM\". It returns": "prüft, ob der Eingabewert eine gültige Zeit im Format \"hh:mm\" oder \"hh:mm AM/PM\" oder \"hh:mm:ss\" oder \"hh:mm:ss AM/PM\" darstellt. Es kehrt zurück",
    "Index 0: \"This textarea is too big\"": "Index 0: \"Dieser Textbereich ist zu groß\"",
    "The function uses a regular expression to check if the input time string matches any of the supported time formats. It returns": "Die Funktion verwendet einen regulären Ausdruck, um zu überprüfen, ob die eingegebene Zeitzeichenfolge mit einem der unterstützten Zeitformate übereinstimmt. Es kehrt zurück",
    "[optional] - This parameter determines whether to check for specific valid email domains or not. If set to": "[optional] - Dieser Parameter bestimmt, ob nach bestimmten gültigen E-Mail-Domänen gesucht werden soll oder nicht. Wenn auf",
    "it will clean after default domains. If set to an array of strings, it will clean after the specified custom domains.": "Es wird nach Standarddomänen bereinigt. Wenn es auf ein Array von Zeichenfolgen festgelegt ist, wird es nach den angegebenen benutzerdefinierten Domänen bereinigt.",
    "The time to be checked for validity. It must be in one of the supported formats: \"hh:mm\", \"hh:mm AM/PM\", \"hh:mm:ss\", or \"hh:mm:ss AM/PM\".": "Die Zeit, die auf Gültigkeit überprüft werden soll. Es muss in einem der unterstützten Formate vorliegen: \"hh:mm\", \"hh:mm AM/PM\", \"hh:mm:ss\" oder \"hh:mm:ss AM/PM\".",
    "Supported Countries": "Unterstützte Länder",
    "no domain check will be performed. Alternatively, you can pass an array of custom valid domains to perform the check against a specific list.": "Es wird keine Domain-Prüfung durchgeführt. Alternativ können Sie ein Array benutzerdefinierter gültiger Domänen übergeben, um die Prüfung anhand einer bestimmten Liste durchzuführen.",
    "it returns an array with all the email addresses found. Otherwise, it returns only the first email address found as a string.": "Es gibt ein Array mit allen gefundenen E-Mail-Adressen zurück. Andernfalls wird nur die erste gefundene E-Mail-Adresse als Zeichenfolge zurückgegeben.",
    "The function takes one parameter that can be either a string or a number: ": "Die Funktion akzeptiert einen Parameter, der entweder eine Zeichenfolge oder eine Zahl sein kann: ",
    "The default error messages are as follows:": "Die Standardfehlermeldungen lauten wie folgt:",
    "How to use the isValidPdf function": "So verwenden Sie die isValidPdf-Funktion",
    "function is used to validate usernames. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the username meets the specified criteria, and \"errorMsg\" will contain the error message if the username is invalid, or it will be null if the username is valid.": "wird verwendet, um Benutzernamen zu validieren. Es gibt ein Objekt mit zwei Eigenschaften zurück: \"isValid\" (boolesch) und \"errorMsg\" (Zeichenfolge). Die Eigenschaft \"isValid\" ist true, wenn der Benutzername die angegebenen Kriterien erfüllt, und \"errorMsg\" enthält die Fehlermeldung, wenn der Benutzername ungültig ist, oder sie ist null, wenn der Benutzername gültig ist.",
    "if the string is composed of ASCII characters, and": "wenn die Zeichenfolge aus ASCII-Zeichen besteht, und",
    "In this example it only allocates 4 bytes for performance reasons, but you can pass the entire file.": "In diesem Beispiel werden aus Performance-Gründen nur 4 Bytes zugewiesen, aber Sie können die gesamte Datei übergeben.",
    "The Brazilian phone number to be validated.": "Die zu validierende brasilianische Telefonnummer.",
    "'weak' - Password with less than 6 characters, consisting of numbers and letters": "'weak' - Passwort mit weniger als 6 Zeichen, bestehend aus Zahlen und Buchstaben",
    "Japan": "Japan",
    "function checks if the input string is a valid Base64 string. It returns": "prüft, ob die Eingabezeichenfolge eine gültige Base64-Zeichenfolge ist. Es kehrt zurück",
    "A flag to determine if the textarea is required.": "Ein Flag, um zu bestimmen, ob der Textbereich benötigt wird.",
    "'strong' - Password between 13 and 16 characters": "'strong' - Passwort zwischen 13 und 16 Zeichen",
    "(optional boolean | string[]) - Either a boolean value indicating whether to clean after default domains or an array of custom domains to clean after. Default is": "(optional boolean | string[]) - Entweder ein boolescher Wert, der angibt, ob nach Standarddomänen bereinigt werden soll, oder ein Array von benutzerdefinierten Domänen, nach denen bereinigt werden soll. Der Standardwert ist",
    "true": "STIMMT",
    "The function takes one parameter, which must be a string representing the postal code to be checked.": "Die Funktion akzeptiert einen Parameter, der eine Zeichenfolge sein muss, die die zu überprüfende Postleitzahl darstellt.",
    "function checks if the input value represents a valid port number. It returns": "prüft, ob der Eingabewert eine gültige Portnummer darstellt. Es kehrt zurück",
    "function is used to validate a Brazilian CPF (Individual Taxpayer Identification) number. It returns an object containing the": "wird verwendet, um eine brasilianische CPF-Nummer (Individual Taxpayer Identification) zu validieren. Es gibt ein Objekt zurück, das die",
    "The function expects the input MD5 hash to be passed as a string. If the input is not a string, the function throws a TypeError. It removes leading and trailing whitespace from the input string and checks if the resulting string has a valid length (exactly 32 characters). Then, it uses a regular expression to verify if the cleaned MD5 hash consists only of hexadecimal digits. Additionally, the function checks if the MD5 hash is not a known weak hash, such as \"d41d8cd98f00b204e9800998ecf8427e\". If any of the checks fail, the function returns false; otherwise, it returns true, indicating that the input string is a valid MD5 hash.": "Die Funktion erwartet, dass der MD5-Eingabe-Hash als Zeichenfolge übergeben wird. Wenn die Eingabe keine Zeichenfolge ist, löst die Funktion einen TypeError aus. Es entfernt führende und nachfolgende Leerzeichen aus der Eingabezeichenfolge und prüft, ob die resultierende Zeichenfolge eine gültige Länge (genau 32 Zeichen) hat. Anschließend wird anhand eines regulären Ausdrucks überprüft, ob der bereinigte MD5-Hash nur aus hexadezimalen Ziffern besteht. Darüber hinaus prüft die Funktion, ob der MD5-Hash kein bekannter schwacher Hash ist, z. B. \"d41d8cd98f00b204e9800998ecf8427e\". Wenn eine der Prüfungen fehlschlägt, gibt die Funktion false zurück. Andernfalls wird true zurückgegeben, was angibt, dass die Eingabezeichenfolge ein gültiger MD5-Hash ist.",
    "if the value matches any of these formats, and": "wenn der Wert mit einem dieser Formate übereinstimmt, und",
    "The function takes one parameter:": "Die Funktion benötigt einen Parameter:",
    "The function expects the input MAC address to be passed as a string. If the input is not a string, the function throws a TypeError. It removes all non-alphanumeric characters from the input string using a regular expression and checks if the resulting string has a valid length (exactly 12 characters). Then, it uses another regular expression to verify if the cleaned MAC address matches the supported pattern. The supported pattern is a 12-character string consisting of hexadecimal digits (0-9, A-F, a-f), with optional separators (\":\", \"-\") between pairs of hexadecimal digits.": "Die Funktion erwartet, dass die MAC-Eingangsadresse als Zeichenfolge übergeben wird. Wenn die Eingabe keine Zeichenfolge ist, löst die Funktion einen TypeError aus. Es entfernt alle nicht-alphanumerischen Zeichen aus der Eingabezeichenfolge mithilfe eines regulären Ausdrucks und prüft, ob die resultierende Zeichenfolge eine gültige Länge (genau 12 Zeichen) hat. Anschließend wird ein weiterer regulärer Ausdruck verwendet, um zu überprüfen, ob die bereinigte MAC-Adresse mit dem unterstützten Muster übereinstimmt. Das unterstützte Muster ist eine 12-stellige Zeichenfolge, die aus hexadezimalen Ziffern (0-9, A-F, a-f) mit optionalen Trennzeichen (\":\", \"-\") zwischen Paaren von Hexadezimalziffern besteht.",
    "function to convert the value to a floating-point number. If the conversion results in a valid number and the value is finite (not infinity or NaN), the function returns true, indicating that the input value is a valid number. Otherwise, it returns false.": ", um den Wert in eine Gleitkommazahl umzuwandeln. Wenn die Konvertierung zu einer gültigen Zahl führt und der Wert endlich ist (nicht unendlich oder NaN), gibt die Funktion true zurück, was darauf hinweist, dass der Eingabewert eine gültige Zahl ist. Andernfalls wird false zurückgegeben.",
    "United States of America": "Vereinigte Staaten von Amerika",
    "Function is used to validate names. It returns an object with two properties: 'isValid' (boolean) and 'errorMsg' (string). The 'errorMsg' property will contain the error message if the name is invalid, or it will be null if the name is valid.": "Die Funktion wird verwendet, um Namen zu validieren. Es gibt ein Objekt mit zwei Eigenschaften zurück: 'isValid' (boolesch) und 'errorMsg' (Zeichenfolge). Die Eigenschaft \"errorMsg\" enthält die Fehlermeldung, wenn der Name ungültig ist, oder sie ist null, wenn der Name gültig ist.",
    "The function expects the input email to be passed as a string. If the input is not a string, it will throw an error. If the email passed is an invalid email, it will return.": "Die Funktion erwartet, dass die Eingabe-E-Mail als Zeichenfolge übergeben wird. Wenn die Eingabe keine Zeichenfolge ist, wird ein Fehler ausgelöst. Wenn die übergebene E-Mail eine ungültige E-Mail ist, wird sie zurückgegeben.",
    "The function checks if the input value is not null, undefined, or a boolean type. If any of these conditions are met, the function returns false since these values cannot represent valid numbers. For all other types, the function uses the.": "Die Funktion prüft, ob der Eingabewert nicht null, undefiniert oder ein boolescher Typ ist. Wenn eine dieser Bedingungen erfüllt ist, gibt die Funktion false zurück, da diese Werte keine gültigen Zahlen darstellen können. Für alle anderen Typen verwendet die Funktion die.",
    "function is used to check whether an txt file is valid or not. It accepts a Buffer as an argument.": "wird verwendet, um zu prüfen, ob eine txt-Datei gültig ist oder nicht. Es akzeptiert einen Buffer als Argument.",
    "The password to be evaluated for strength.": "Das Passwort, das auf Stärke bewertet werden soll.",
    "Indicates if the textarea is valid based on the given criteria.": "Gibt an, ob das Textfeld basierend auf den angegebenen Kriterien gültig ist.",
    "if the CEP is valid, and": "ob der CEP gültig ist und",
    "function is used to check whether an audio file is valid or not. It accepts a Buffer as an argument.": "wird verwendet, um zu überprüfen, ob eine Audiodatei gültig ist oder nicht. Es akzeptiert einen Buffer als Argument.",
    "and": "und",
    "does not, it does complex validations and better than that, you can customize the validations passing the information in the parameters.": "Dies ist nicht der Fall, es führt komplexe Validierungen durch und besser noch, Sie können die Validierungen anpassen, die die Informationen in den Parametern übergeben.",
    "If the function is called with an invalid value for the": "Wenn die Funktion mit einem ungültigen Wert für die",
    "function is used to check whether an video file is valid or not. It accepts a Buffer as an argument.": "wird verwendet, um zu überprüfen, ob eine Videodatei gültig ist oder nicht. Es akzeptiert einen Buffer als Argument.",
    "France": "Frankreich",
    "parameter is set to": "ist auf",
    "There are two ways to import the function:": "Es gibt zwei Möglichkeiten, die Funktion zu importieren:",
    "An array of custom error messages for different validation conditions. The array should contain three elements corresponding to different error scenarios. If not provided, default error messages will be used. Default Error Messages:": "Ein Array von benutzerdefinierten Fehlermeldungen für verschiedene Validierungsbedingungen. Das Array sollte drei Elemente enthalten, die unterschiedlichen Fehlerszenarien entsprechen. Wenn nicht angegeben, werden Standardfehlermeldungen verwendet. Standard-Fehlermeldungen:",
    "Italy: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Italien: 1 Großbuchstabe gefolgt von 7 Ziffern (z. B. \"A1234567\")",
    "The function can be imported using ES6 syntax from the \"password-strength-tester\" package:": "Die Funktion kann mit ES6-Syntax aus dem Paket \"password-strength-tester\" importiert werden:",
    "Types that are validated": "Typen, die validiert werden",
    "A list of custom error messages. If not provided, it uses a default list of error messages.": "Eine Liste der benutzerdefinierten Fehlermeldungen. Wenn nicht angegeben, wird eine Standardliste von Fehlermeldungen verwendet.",
    "The CNPJ number to be validate.": "Die zu validierende CNPJ-Nummer.",
    "Example Usage with Nestjs and Multer": "Anwendungsbeispiel mit Nestjs und Multer",
    "properties, indicating whether the CNPJ is valid and, in case of an error, the corresponding error message.": "Eigenschaften, die angeben, ob das CNPJ gültig ist, und im Fehlerfall die entsprechende Fehlermeldung.",
    "The function supports postal codes for the following countries:": "Die Funktion unterstützt Postleitzahlen für die folgenden Länder:",
    "function is used to check whether an pdf file is valid or not. It accepts a Buffer as an argument.": "wird verwendet, um zu prüfen, ob eine PDF-Datei gültig ist oder nicht. Es akzeptiert einen Buffer als Argument."
  },
  "Header": {
    "header_docs": "Dokumentation",
    "header_already_here": "Sie befinden sich bereits hier (:",
    "header_title": "Multiform-Validator",
    "header_buy_coffee": "mir einen Kaffee kaufen ?",
    "header_github": "Mein Github",
    "header_home": "Heim",
    "header_go_home": "Geh nach Hause",
    "header_info": "Info"
  },
  "Footer": {
    "Services": "Dienste",
    "Terms": "Bedingungen",
    "Privacy Policy": "Datenschutzrichtlinie",
    "CopyRightMsg": "Multiform-Validator © 2023 - Gabriel Logan",
    "Home": "Heim",
    "About": "Über"
  },
  "SidebarWrapperJs": {
    "Documentation": "Dokumentation",
    "Home": "Heim"
  },
  "DocumentationPython": {
    "Back to home": "Zurück zur Startseite",
    "Installation": "Installation",
    "Install the package using pip: ": "Installieren Sie das Paket mit pip: ",
    "Functions signature": "Funktionssignatur",
    "All params with default values are optional.": "Alle Parameter mit Standardwerten sind optional.",
    "Methods": "Methodik"
  },
  "NotFound": {
    "Msg": "Diese Seite konnte nicht gefunden werden.",
    "Status": "404"
  }
}