{
  "HomeLayout": {
    "Support me on Buy me a coffee": "Steun me op Koop me een koffie!",
    "Description": "Meertalige bibliotheek gemaakt voor validatie, verschillende formuliervelden, zoals: e-mail, telefoon, wachtwoord, cpf, cnpj, creditcard, magische getallen voor validatie van beeldmimetype en nog veel meer.",
    "Technology": "Technologie",
    "Opengraph description": "Meertalige bibliotheek gemaakt voor validatie, verschillende formuliervelden, zoals: e-mail, afbeelding, cpf, cnpj, creditcard, magische nummers en nog veel meer.",
    "Classification": "Validatie Bibliotheek",
    "Title": "Veelvormige validator",
    "Opengraph title": "Multiform Validator - Uw meertalige validatiebibliotheek"
  },
  "DocumentationJs": {
    "By - Gabriel Logan": "Door - Gabriel Logan",
    "Installation": "Installatie",
    "This package contains various modules for validating different types of data. Below are the available validation modules:": "Dit pakket bevat verschillende modules voor het valideren van verschillende soorten data. Hieronder staan de beschikbare validatiemodules:",
    "INFO: ": "INFO: ",
    "Welcome Introduction Text": "Welkom op de hoofdpagina van Multiform Validator! Hier vindt u gedetailleerde documentatie voor verschillende functies van Multiform Validator, een handige JavaScript-bibliotheek voor gegevensvalidatie. Elke functie is ontworpen om te helpen bij het valideren van verschillende soorten gegevens, waardoor uw code robuuster en veiliger wordt. Multiform Validator bestaat uit een reeks gespecialiseerde functies waarmee u verschillende gegevenstypen kunt valideren, zoals e-mails, wachtwoorden, namen, achternamen, paspoortnummers, telefoonnummers en meer. Elke functie heeft configureerbare parameters en biedt aanpasbare foutmeldingen om aan de behoeften van uw project te voldoen. Op elke documentatiepagina vindt u een uitgebreide beschrijving van de functie, inclusief het doel, geaccepteerde parameters en gebruiksvoorbeelden. Bovendien hebt u toegang tot details over standaardfoutmeldingen en hoe u deze kunt aanpassen aan uw toepassing. Door Multiform Validator te gebruiken, kunt u ervoor zorgen dat de invoer van gebruikers in uw formulieren correct is en voldoet aan de vastgestelde regels. Deze validatie is essentieel om problemen zoals ongeldige invoer, beschadigde gegevens of beveiligingsproblemen te voorkomen. We werken voortdurend aan het verbeteren en uitbreiden van Multiform Validator met nieuwe functies en verbeteringen om het een nog krachtiger en flexibeler hulpmiddel te maken voor uw validatiebehoeften. We hopen dat deze documentatie nuttig zal blijken te zijn en het gebruik van Multiform Validator in uw projecten zal vereenvoudigen. Voel je vrij om de verschillende beschikbare functies te verkennen en aarzel niet om contact met ons op te nemen als je vragen of suggesties hebt. Bedankt voor het kiezen van Multiform Validator als uw tool voor gegevensvalidatie en we wensen u veel succes met uw projecten! Multiform Validator Team",
    "if you prefer, you can use importing as:": "Als u wilt, kunt u importeren gebruiken als:",
    "Official documentation": "Officiële documentatie",
    "Example of use with CDN": "Voorbeeld van gebruik met CDN",
    "Data Validator": "Gegevens Validator",
    "FirstInfoText": "Alle functies met de naam \"validate\" retourneren een object met twee eigenschappen, isValid: true | false and errorMsg: 'Tekenreeks met fouten'",
    "Feel free to find bugs Text Msg": "Voel je vrij om bugs te vinden en ze aan mij te melden. Uw feedback wordt zeer op prijs gesteld. Knuffels van Gabriel Logan!",
    "Back to home page": "Terug naar de homepage",
    "If you want to help me, you can buy me a coffee (:": "Als je me wilt helpen, kun je een koffie voor me kopen (:",
    "SecondInfoText": "De overige kunnen true|false|string|array retourneren, kijk naar het document voor elke array",
    "Available Validation Modules": "Beschikbare validatiemodules",
    "Feel free to explore msg": "Voel je vrij om de verschillende functies te verkennen en te experimenteren met verschillende inputs om hun gedrag te begrijpen. Als je problemen ondervindt of suggesties hebt, aarzel dan niet om contact met me op te nemen. Uw feedback is waardevol en helpt het pakket te verbeteren. Veel plezier met coderen!",
    "This npm package provides JavaScript functions to validate various forms fields.": "Dit npm-pakket biedt JavaScript-functies om verschillende formuliervelden te valideren."
  },
  "DocumentationLayout": {
    "Documentation": "Documentatie",
    "Documentation for the Multiform Validator library.": "Documentatie voor de Multiform Validator-bibliotheek."
  },
  "Terms": {
    "Terms and Conditions": "Algemene voorwaarden",
    "Unauthorized use of this website is strictly prohibited.": "Ongeoorloofd gebruik van deze website is ten strengste verboden.",
    "Terms and Conditions of Multiform Validator library": "Algemene voorwaarden van de Multiform Validator-bibliotheek",
    "Welcome to Gabriel Logan Web Services. By using this website, you agree to the following terms and conditions:": "Welkom bij Gabriel Logan Web Services. Door gebruik te maken van deze website gaat u akkoord met de volgende voorwaarden:",
    "We do not collect any personal data through this website, and your privacy is important to us.": "Wij verzamelen geen persoonsgegevens via deze website en uw privacy is belangrijk voor ons.",
    "Your use of this website and any disputes arising are subject to the laws of [Your Country/Region].": "Uw gebruik van deze website en eventuele geschillen die daaruit voortvloeien, zijn onderworpen aan de wetten van [Uw land/regio].",
    "The content provided on this website is for general information purposes only, and we make no warranties or representations regarding its accuracy or completeness.": "De inhoud van deze website is uitsluitend bedoeld voor algemene informatiedoeleinden en wij geven geen garanties of verklaringen met betrekking tot de juistheid of volledigheid ervan.",
    "We use the \"multiform-validator\" library, licensed under the MIT License, to enhance form field validation. However, we are not responsible for its usage or any consequences resulting from third-party use of the library.": "We gebruiken de \"multiform-validator\"-bibliotheek, gelicentieerd onder de MIT-licentie, om de validatie van formuliervelden te verbeteren. Wij zijn echter niet verantwoordelijk voor het gebruik ervan of eventuele gevolgen die voortvloeien uit het gebruik van de bibliotheek door derden.",
    "Thank you for visiting our website and using our services. If you have any questions or concerns, please don’t hesitate to contact us.": "Bedankt voor uw bezoek aan onze website en het gebruik van onze diensten. Als u vragen of opmerkingen heeft, aarzel dan niet om contact met ons op te nemen."
  },
  "PrivacyPolices": {
    "privacy_questions": "Als u vragen of opmerkingen heeft over ons privacybeleid of het gebruik van de \"multiform-validator\"-bibliotheek, aarzel dan niet om contact met ons op te nemen. We zijn hier om eventuele vragen te beantwoorden en uw gemoedsrust te garanderen.",
    "privacy_intro": "Bij Gabriel Logan Web Services nemen we uw privacy serieus. We willen u verzekeren dat we geen gegevens verzamelen op onze website en dat we geen gegevens gebruiken via de \"multiform-validator\"-bibliotheek. Uw informatie blijft volledig vertrouwelijk en uw privacy staat bij ons voorop.",
    "Privacy Policy": "Privacybeleid",
    "validator_local": "De \"multiform-validator\"-bibliotheek is ontworpen om formuliervelden op uw webapplicaties te valideren zonder toegang te krijgen tot of gegevens naar externe servers te verzenden. Alle validatie vindt lokaal in uw browser plaats, zodat uw gevoelige informatie uw apparaat nooit verlaat.",
    "privacy_thanks": "Bedankt voor het kiezen van Gabriel Logan Web Services. We kijken ernaar uit om u uitzonderlijke oplossingen te bieden en tegelijkertijd uw privacy bij elke stap te beschermen.",
    "privacy_title": "Privacybeleid - Uw gegevens zijn veilig bij ons",
    "validator_secure": "We begrijpen het belang van gegevensbeveiliging en daarom hebben we de \"multiform-validator\"-bibliotheek zorgvuldig ontwikkeld om 100% veilig te zijn. Uw gegevens blijven onder uw controle en wij hebben geen toegang tot de informatie die door de bibliotheek wordt verwerkt.",
    "privacy_no_personal_data": "Wanneer u onze website bezoekt, kunt u er zeker van zijn dat er geen persoonlijke gegevens, zoals uw naam, e-mailadres of contactgegevens, worden verzameld of opgeslagen. Wij geloven in het bieden van een veilige en anonieme browse-ervaring.",
    "privacy_trust": "Uw vertrouwen is waardevol voor ons en we willen dat u met vertrouwen gebruik kunt maken van onze diensten en de \"multiform-validator\"-bibliotheek. Onze toewijding aan uw privacy is onwrikbaar en we zullen prioriteit blijven geven aan de beveiliging en bescherming van uw gegevens in alle aspecten van ons werk."
  },
  "Info": {
    "info_intro": "Maak kennis met multiform-validator, een krachtige Multi Library ontwikkeld door Gabriel Logan. Deze veelzijdige bibliotheek is ontworpen om tal van formuliervelden te valideren, waaronder e-mailadressen, telefoonnummers, wachtwoorden, CPF (Braziliaanse individuele belastingregistratienummers), creditcardnummers en meer.",
    "info_conclusion": "Dus als u op zoek bent naar een uitgebreide oplossing voor formulierveldvalidatie, hoeft u niet verder te zoeken dan multiform-validator. Omarm de kracht van deze bibliotheek en u kunt er zeker van zijn dat uw gegevensverzamelingsproces gestroomlijnd, nauwkeurig en veilig zal zijn.",
    "info_title": "multiform-validator - Multibibliotheek voor validatie van formuliervelden",
    "info_performance": "Gabriel Logan is trots op de ontwikkeling van de multiform-validator-bibliotheek met een focus op prestaties, efficiëntie en betrouwbaarheid. De bibliotheek is geoptimaliseerd voor verschillende browsers, waardoor naadloze compatibiliteit voor uw diverse publiek wordt gegarandeerd.",
    "info_prebuilt_rules": "De multiform-validatorbibliotheek wordt geleverd met een uitgebreide set vooraf gebouwde validatieregels en aanpasbare opties. U kunt het eenvoudig integreren in uw webapplicaties en profiteren van de voordelen van validatie aan de clientzijde, waardoor het aantal ongeldige formulierinzendingen wordt verminderd en de algehele gebruikerservaring wordt verbeterd.",
    "info_flexibility": "Wat multiform-validator onderscheidt, is de flexibiliteit en het gebruiksgemak. U kunt moeiteloos validatieregels toepassen op verschillende formuliervelden door simpelweg een paar regels JavaScript-code toe te voegen. Bovendien biedt de bibliotheek informatieve foutmeldingen, die gebruikers begeleiden bij het corrigeren van hun invoer, waardoor frustratie en het aantal verlatingen van formulieren worden verminderd.",
    "Info_Page": "Informatie Pagina",
    "info_backend": "U kunt de multiform-validator ook gebruiken om validaties in uw backend uit te voeren, het werkt voor elk type formuliervalidatie of functies die javascript, python gebruiken, dus voel je vrij om het te gebruiken",
    "info_ensure": "Met multiform-validator kunt u ervoor zorgen dat de gegevens die via uw formulieren worden ingediend, nauwkeurig en veilig zijn. Of u nu een registratieformulier, een afrekenproces of een ander gegevensinvoersysteem bouwt, deze bibliotheek heeft het voor u."
  },
  "Manifest": {
    "Description": "Meertalige bibliotheek gemaakt voor validatie, verschillende formuliervelden, zoals: e-mail, telefoon, wachtwoord, cpf, cnpj, creditcard, magische getallen voor validatie van beeldmimetype en nog veel meer.",
    "ShortName": "Veelvormige validator",
    "Name": "Multiform Validator - Uw meertalige validatiebibliotheek"
  },
  "DocumentationPage": {
    "doc_java_title": "Java",
    "doc_py_text": "Hier vind je de documentatie voor de Python taal.",
    "doc_title": "Documentatiepagina",
    "doc_subtitle": "Hier vindt u alle talen die we ondersteunen",
    "doc_java_text": "Hier vindt u de documentatie voor de Java-taal.",
    "doc_py_title": "Python",
    "doc_js_title": "JavaScript",
    "doc_intro": "Welkom op de documentatiepagina. Hier vindt u alle talen die wij ondersteunen en de documentatie voor elk van hen.",
    "doc_js_text": "Hier vindt u de documentatie voor de JavaScript-taal.",
    "doc_java_coming": "In de komende ..."
  },
  "About": {
    "about_backend": "Maar daar houden mijn vaardigheden niet op. Ik ben net zo bedreven in back-end ontwikkeling, met expertise in talen als Python, Java en JavaScript (Node.js). Het bouwen van robuuste en veilige webapplicaties is mijn sterke punt, omdat ik de fijne kneepjes van server-side logica begrijp. Mijn oplossingen zijn gericht op efficiëntie, betrouwbaarheid en schaalbaarheid, zodat mijn applicaties zelfs tijdens piekmomenten een soepele gebruikerservaring bieden.",
    "about_frontend": "Als front-end developer heb ik een scherp oog voor user experience en interface design. Ik hou ervan om creatieve concepten om te zetten in visueel boeiende en interactieve webapplicaties met behulp van React en Nextjs met typescript. Van naadloze navigatie tot vloeiende animaties, ik besteed aandacht aan elk detail om ervoor te zorgen dat mijn front-end projecten elegantie en functionaliteit uitstralen.",
    "About_Page": "Over de pagina",
    "about_achievement": "Een van mijn meest trotse prestaties is de creatie van een baanbrekende webpagina die de validatie van formulieren vereenvoudigt en versnelt. Deze ingenieuze oplossing is ontworpen om mensen en bedrijven te helpen hun formuliervalidatieproces te stroomlijnen. Door gebruik te maken van mijn uitgebreide kennis van webontwikkeling en het integreren van geavanceerde technologieën, biedt mijn pagina een razendsnelle en SUPER efficiënte manier om formulieren te valideren. De gebruiksvriendelijke interface en intuïtieve functionaliteiten maken het een onmisbaar hulpmiddel voor professionals die hun productiviteit en nauwkeurigheid bij het verzamelen van gegevens willen verbeteren.",
    "about_title": "Hallo, ik ben Gabriel Logan",
    "about_inspiration": "Als ik niet bezig ben met code, kan het zijn dat ik inspiratie zoek in de wereld om me heen. Of ik nu het buitenleven verken, mezelf onderdompel in kunst en cultuur, of tot nadenken stemmende discussies aanga, ik put uit een breed scala aan ervaringen die mijn benadering van programmeren en mijn interacties met collega's en klanten vormgeven.",
    "About_Page_Description": "Maak kennis met Gabriel Logan, de maker van de multiform-validator-bibliotheek, en leer meer over zijn passie voor webontwikkeling, innovatieve oplossingen en toewijding aan gebruikerservaring.",
    "about_creative": "Naast mijn technische vaardigheden gedij ik goed als creatieve probleemoplosser. Ik hou ervan om uitdagingen aan te gaan met een innovatieve mindset en ben altijd op zoek naar manieren om de gebruikerservaring te verbeteren. Mijn vermogen om buiten de gebaande paden te denken en inventieve oplossingen te leveren, onderscheidt mij als een echte leider op het gebied van webontwikkeling.",
    "about_conclusion": "Kortom, ik ben Gabriel Logan, een gepassioneerde programmeur die front-end en back-end vaardigheden naadloos verweeft om uitzonderlijke webervaringen te creëren. Mijn innovatieve mentaliteit, aandacht voor detail en toewijding aan efficiëntie hebben me ertoe gebracht een baanbrekende pagina te ontwikkelen waarvan ik denk dat deze een aanzienlijke impact zal hebben op de wereld van formuliervalidatie. Terwijl het digitale landschap zich blijft ontwikkelen, sta ik voorop, klaar om nieuwe uitdagingen aan te gaan en een verschil te maken door mijn uitzonderlijke werk in webontwikkeling.",
    "about_intro": "Ik beschouw mezelf als een veelzijdige programmeur met een passie voor zowel front-end als back-end development. Het creëren van uitzonderlijke webervaringen is wat mij drijft, en ik ben enorm trots op het werk dat ik produceer."
  },
  "HomePage": {
    "HelpMsg": "Je kunt de programmeur ook helpen door een kopje koffie te kopen via de onderstaande link, bij voorbaat dank (:",
    "SeeThePypiPage": "Zie de pypi pagina",
    "Intro": "Met behulp van mijn bibliotheek kun je veel regels code omzetten in heel weinig regels en als resultaat heb je een schonere, sterkere en veiligere code, je hebt verschillende tools en functies die verschillende formuliervalidaties uitvoeren",
    "Hello": "Hallo",
    "Documentation": "Documentatie",
    "FollowThe": "Volg de",
    "Welcome": "Welkom op de website van de multiform-validator",
    "SeeTheGithubSourceCode": "De github-bron bekijken",
    "ForMoreInfo": "Voor meer informatie",
    "SeeTheNpmPage": "Zie de npm pagina"
  },
  "DocumentationJsFunctions": {
    "Alternatively, you can import the function using CommonJS syntax with": "U kunt de functie ook importeren met behulp van de CommonJS-syntaxis met",
    "if the input value matches any of the supported postal code formats, and": "als de invoerwaarde overeenkomt met een van de ondersteunde postcodenotaties, en",
    "The function takes two parameters:": "De functie heeft twee parameters:",
    "containing the default error message 'Unknown error'.": "met de standaard foutmelding 'Onbekende fout'.",
    "If the conversion is successful (resulting in a valid integer), the function checks if the integer is within the valid port range (1 to 65535). If the value is within this range and it is an integer, the function returns true, indicating that the input value represents a valid port number. Otherwise, it returns false.": "Als de conversie succesvol is (resulterend in een geldig geheel getal), controleert de functie of het gehele getal binnen het geldige poortbereik ligt (1 tot 65535). Als de waarde binnen dit bereik ligt en het een geheel getal is, retourneert de functie true, wat aangeeft dat de invoerwaarde een geldig poortnummer vertegenwoordigt. Anders retourneert het false.",
    "The function can be imported using ES6 syntax from the \"multiform-validator\" package:": "De functie kan worden geïmporteerd met behulp van ES6-syntaxis uit het \"multiform-validator\"-pakket:",
    "Brazil: 9 digits (e.g., '123456789')": "Brazilië: 9 cijfers (bijv. '123456789')",
    "The US phone number to be validated.": "Het Amerikaanse telefoonnummer dat moet worden gevalideerd.",
    "if the input string is a valid MD5 hash and follows the supported format, and": "als de invoertekenreeks een geldige MD5-hash is en de ondersteunde indeling volgt, en",
    "parameter (non-array), or if an error occurs during the validation process, the function will return an object with": "parameter (non-array), of als er een fout optreedt tijdens het validatieproces, retourneert de functie een object met",
    "Note:": "Notitie:",
    "function checks if the input string is a valid MAC address. It returns": "functie controleert of de invoertekenreeks een geldig MAC-adres is. Het keert terug",
    "[optional] - The maximum length allowed for the email address. If not provided, the default value is 400.": "[optioneel]: de maximaal toegestane lengte voor het e-mailadres. Als dit niet het geval is, is de standaardwaarde 400.",
    "Parameters": "Parameters",
    "The password to be validated.": "Het wachtwoord dat moet worden gevalideerd.",
    "This function just checks the syntax of the email to see if it's valid or not, if you need a stronger validation, use: ": "Deze functie controleert alleen de syntaxis van de e-mail om te zien of deze geldig is of niet, als je een sterkere validatie nodig hebt, gebruik dan: ",
    "function is used to validate Brazilian phone numbers. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"errorMsg\" property will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "functie wordt gebruikt om Braziliaanse telefoonnummers te valideren. Het retourneert een object met twee eigenschappen: \"isValid\" (boolean) en \"errorMsg\" (tekenreeks). De eigenschap \"errorMsg\" bevat de foutmelding als het telefoonnummer ongeldig is, of het is null als het telefoonnummer geldig is.",
    "if the input string is empty or consists of only whitespace characters, and": "als de invoertekenreeks leeg is of alleen uit spaties bestaat, en",
    "The CPF number to be validated.": "Het CPF-nummer dat moet worden gevalideerd.",
    "The function first checks if the input value is either a string or a number. If the value is a string, it is converted to an integer using": "De functie controleert eerst of de invoerwaarde een tekenreeks of een getal is. Als de waarde een tekenreeks is, wordt deze geconverteerd naar een geheel getal met behulp van",
    "Supported Passport Formats": "Ondersteunde paspoortindelingen",
    "Default Error Messages": "Standaard foutmeldingen",
    "optional array": "Optionele array",
    "Whether the password requires at least one number. Default value: false.": "Of het wachtwoord ten minste één cijfer vereist. Standaardwaarde: false.",
    "The function is a text area validation utility that checks the validity of a given textarea string based on certain criteria.": "De functie is een hulpprogramma voor het valideren van tekstgebieden dat de geldigheid van een bepaalde tekenreeks controleert op basis van bepaalde criteria.",
    "The input string to check if it is a valid Brazilian ZIP Code (CEP).": "De invoertekenreeks om te controleren of het een geldige Braziliaanse postcode (CEP) is.",
    "The input text from which emails will be extracted.": "De invoertekst waaruit e-mails worden geëxtraheerd.",
    "function is used to validate passport numbers. It returns an object with two properties: 'isValid' (boolean) and 'country' (string). The 'isValid' property will be true if the passport number matches the supported formats, and 'country' property will indicate the country associated with the passport number. If the passport number does not match any supported format, 'isValid' will be false, and 'country' will be null.": "functie wordt gebruikt om paspoortnummers te valideren. Het retourneert een object met twee eigenschappen: 'isValid' (boolean) en 'country' (string). De eigenschap 'isValid' is waar als het paspoortnummer overeenkomt met de ondersteunde indelingen, en de eigenschap 'land' geeft het land aan dat aan het paspoortnummer is gekoppeld. Als het paspoortnummer niet overeenkomt met een ondersteund formaat, is 'isValid' onwaar en is 'land' null.",
    "How to use the isValidVideo function": "Hoe de isValidVideo-functie te gebruiken",
    "function is used to validate surnames. It returns an object with two properties: 'isValid' (boolean) and 'errorMsg' (string). The 'isValid' property will be true if the surname meets the specified criteria, and 'errorMsg' will contain the error message if the surname is invalid, or it will be null if the surname is valid.": "functie wordt gebruikt om achternamen te valideren. Het retourneert een object met twee eigenschappen: 'isValid' (boolean) en 'errorMsg' (string). De eigenschap 'isValid' is waar als de achternaam voldoet aan de opgegeven criteria, en 'errorMsg' bevat de foutmelding als de achternaam ongeldig is, of het is null als de achternaam geldig is.",
    "The surname to be validated.": "De te valideren achternaam.",
    "Contains the corresponding error message, if any, based on the validation result.": "Bevat de bijbehorende foutmelding, indien aanwezig, op basis van het validatieresultaat.",
    "You can also pass an options object as a second argument to exclude a specific type.": "U kunt ook een optieobject doorgeven als tweede argument om een specifiek type uit te sluiten.",
    "Australia: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Australië: 1 hoofdletter gevolgd door 7 cijfers (bijv. 'A1234567')",
    "United States: 9 digits (e.g., '123456789')": "Verenigde Staten: 9 cijfers (bijv. '123456789')",
    "function is used to validate email addresses. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"errorMsg\" property will contain the error message if the email address is invalid, or it will be null if the email address is valid.": "functie wordt gebruikt om e-mailadressen te valideren. Het retourneert een object met twee eigenschappen: \"isValid\" (boolean) en \"errorMsg\" (tekenreeks). De eigenschap \"errorMsg\" bevat de foutmelding als het e-mailadres ongeldig is, of het is null als het e-mailadres geldig is.",
    "The": "De",
    "The function expects the input value to be passed as a string. It checks each character of the string, and if any character has a character code greater than 127 (non-ASCII), the function returns": "De functie verwacht dat de invoerwaarde als een tekenreeks wordt doorgegeven. Het controleert elk teken van de tekenreeks, en als een teken een tekencode heeft die groter is dan 127 (niet-ASCII), retourneert de functie",
    "The input string to check if it is a valid Base64 string.": "De invoertekenreeks om te controleren of het een geldige Base64-tekenreeks is.",
    "The maximum length of the surname. Default is 25.": "De maximale lengte van de achternaam. De standaardwaarde is 25.",
    "[optional] - The minimum length of the username. Default is 1.": "[optioneel] - De minimale lengte van de gebruikersnaam. De standaardwaarde is 1.",
    "If the input is not a string or an empty string, it throws an error.": "Als de invoer geen tekenreeks of een lege tekenreeks is, wordt er een fout weergegeven.",
    "The function expects the input value to be passed as a string. It checks if the string is a valid Base64 string using a regular expression. If the input is not a string or an empty string, it throws an error.": "De functie verwacht dat de invoerwaarde als een tekenreeks wordt doorgegeven. Er wordt gecontroleerd of de tekenreeks een geldige Base64-tekenreeks is met behulp van een reguliere expressie. Als de invoer geen tekenreeks of een lege tekenreeks is, wordt er een fout weergegeven.",
    "'veryWeak' - Password with less than 6 characters, consisting only of numbers": "'veryWeak' - Wachtwoord met minder dan 6 tekens, alleen bestaande uit cijfers",
    "if the credit card number is valid, and": "als het creditcardnummer geldig is, en",
    "The function expects the input value to be passed as a string representing a credit card number. It removes any non-digit characters and applies the Luhn algorithm to validate the credit card number. If the input is not a string, the function throws an error.": "De functie verwacht dat de invoerwaarde wordt doorgegeven als een tekenreeks die een creditcardnummer voorstelt. Het verwijdert alle niet-cijfertekens en past het Luhn-algoritme toe om het creditcardnummer te valideren. Als de invoer geen string is, genereert de functie een fout.",
    "function from 'multiform-validator'. Then, define the path to the image you want to check. Call the": "functie van 'multiform-validator'. Definieer vervolgens het pad naar de afbeelding die u wilt controleren. Bel de",
    "function checks if the input string is a valid date.": "Functie controleert of de invoertekenreeks een geldige datum is.",
    "The input string to check if it is empty or contains only whitespace characters.": "De invoertekenreeks om te controleren of deze leeg is of alleen spaties bevat.",
    "function checks if the input string is a valid email address. It returns": "Functie controleert of de invoertekenreeks een geldig e-mailadres is. Het keert terug",
    "Whether the password requires at least one special character": "Of het wachtwoord ten minste één speciaal teken vereist",
    "The passport number to be validated.": "Het te valideren paspoortnummer.",
    "The function returns an object with two properties:": "De functie retourneert een object met twee eigenschappen:",
    "The function expects the input to be passed as a string.": "De functie verwacht dat de invoer als een string wordt doorgegeven.",
    "if the value is a valid port number (within the range 1 to 65535), and": "als de waarde een geldig poortnummer is (binnen het bereik van 1 tot 65535), en",
    "The email address to be validated.": "Het te valideren e-mailadres.",
    "'regular' - Password greater than 10 and has characters that are repeated more than 5 times in sequence": "'normaal' - Wachtwoord groter dan 10 en bevat tekens die meer dan 5 keer achter elkaar worden herhaald",
    "function evaluates the strength of a given password and returns the type of password strength as a string. The possible strength types are: \"veryWeak\", \"weak\", \"regular\", \"strong\", or \"veryStrong\", based on specific criteria.": "functie evalueert de sterkte van een bepaald wachtwoord en retourneert het type wachtwoordsterkte als een tekenreeks. De mogelijke sterktetypes zijn: \"zeerZwak\", \"zwak\", \"normaal\", \"sterk\" of \"zeerSterk\", op basis van specifieke criteria.",
    "which means it won't clean the email addresses after default domains ['.br', '.io', '.pt', '.us', '.org', '.com'];. If set to": "wat betekent dat de e-mailadressen na standaarddomeinen ['.br', '.io', '.pt', '.us', '.org', '.com'];. Indien ingesteld op",
    "Using": "Gebruik",
    "postalCode": "postcode",
    "The postal code to be checked for validity.": "De postcode die op geldigheid moet worden gecontroleerd.",
    "or not provided, it will return only the first email address found as a string.": "of niet is opgegeven, retourneert het alleen het eerste e-mailadres dat als tekenreeks is gevonden.",
    "Function is used to validate phone numbers. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the phone number meets the specified criteria, and \"errorMsg\" will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "Functie wordt gebruikt om telefoonnummers te valideren. Het retourneert een object met twee eigenschappen: \"isValid\" (boolean) en \"errorMsg\" (tekenreeks). De eigenschap 'isValid' is waar als het telefoonnummer voldoet aan de opgegeven criteria, en 'errorMsg' bevat het foutbericht als het telefoonnummer ongeldig is, of het is null als het telefoonnummer geldig is.",
    "otherwise.": "anders.",
    "[optional] - An object with the following optional properties:": "[optioneel]: een object met de volgende optionele eigenschappen:",
    "If no email address is found in the input text, the function will return the string 'No email found'.": "Als er geen e-mailadres wordt gevonden in de invoertekst, retourneert de functie de string 'Geen e-mail gevonden'.",
    "function extracts email addresses from a given text. If the optional": "functie extraheert e-mailadressen uit een bepaalde tekst. Als de optionele",
    "Brazil": "Brazilië",
    "The input value to check if it represents a valid decimal number.": "De invoerwaarde om te controleren of deze een geldig decimaal getal vertegenwoordigt.",
    "Usage Examples": "Voorbeelden van gebruik",
    "Index 2: \"Unknown error\"": "Index 2: \"Onbekende fout\"",
    "The function expects the input value to be passed as a string.": "De functie verwacht dat de invoerwaarde als een tekenreeks wordt doorgegeven.",
    "the function will return an array with all the email addresses found. If set to": "De functie retourneert een array met alle gevonden e-mailadressen. Indien ingesteld op",
    "The input string to check for ASCII characters.": "De invoertekenreeks om te controleren op ASCII-tekens.",
    "function checks if the input value represents a valid postal code for supported countries. It returns": "Functie controleert of de invoerwaarde een geldige postcode vertegenwoordigt voor ondersteunde landen. Het keert terug",
    "The input string representing the credit card number to validate.": "De invoertekenreeks die het creditcardnummer vertegenwoordigt dat moet worden gevalideerd.",
    "method and checks if the resulting string is empty (i.e., has a length of 0). If the input string consists of only whitespace characters, the function also returns.": "methode en controleert of de resulterende tekenreeks leeg is (d.w.z. een lengte van 0 heeft). Als de invoertekenreeks alleen uit spaties bestaat, retourneert de functie ook.",
    "function is used to check whether an image file is valid or not. It accepts a Buffer as an argument.": "functie wordt gebruikt om te controleren of een afbeeldingsbestand geldig is of niet. Het accepteert een buffer als argument.",
    "The function expects the input value to be passed as a string or a number representing a decimal number. If the input is not a string or number, or an empty string, the function throws an error. It uses a regular expression to validate decimal numbers, supports both dot (.) and comma (,) as decimal separators, and checks for multiple decimal separators. Additionally, it performs checks for the negative sign to ensure it is only at the beginning of the value.": "De functie verwacht dat de invoerwaarde wordt doorgegeven als een tekenreeks of een getal dat een decimaal getal vertegenwoordigt. Als de invoer geen tekenreeks of getal is, of een lege tekenreeks, genereert de functie een fout. Het gebruikt een reguliere expressie om decimale getallen te valideren, ondersteunt zowel punt (.) als komma (,) als decimale scheidingstekens en controleert op meerdere decimale scheidingstekens. Bovendien voert het controles uit op het minteken om er zeker van te zijn dat het alleen aan het begin van de waarde staat.",
    "Italy": "Italië",
    "function checks if the input string contains only ASCII characters. It returns": "functie controleert of de invoertekenreeks alleen ASCII-tekens bevat. Het keert terug",
    "[optional] - The country code to check if the email ends with it. If not provided, no country code check will be performed.": "[optioneel] - De landcode om te controleren of de e-mail ermee eindigt. Als dit niet het geval is, wordt er geen landcodecontrole uitgevoerd.",
    "India: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "India: 1 hoofdletter gevolgd door 7 cijfers (bijv. 'A1234567')",
    "function checks if the input value is a valid number. It returns": "Functie controleert of de invoerwaarde een geldig getal is. Het keert terug",
    "[optional] - An array of error messages to customize the response. If not provided, the function will use default error messages.": "[optioneel] - Een reeks foutmeldingen om het antwoord aan te passen. Indien niet opgegeven, gebruikt de functie standaard foutmeldingen.",
    "'veryStrong' - Password longer than 16 characters": "'veryStrong' - Wachtwoord langer dan 16 tekens",
    "function is used to identify the credit card flag based on the first digits of the card number. It returns the name of the card flag as a string.": "functie wordt gebruikt om de creditcardvlag te identificeren op basis van de eerste cijfers van het kaartnummer. Het retourneert de naam van de kaartvlag als een tekenreeks.",
    "United Kingdom: 2 uppercase letters followed by 6 digits (e.g., 'AB123456')": "Verenigd Koninkrijk: 2 hoofdletters gevolgd door 6 cijfers (bijv. 'AB123456')",
    "How to use the isValidAudio function": "Hoe de isValidAudio-functie te gebruiken",
    "First, import the": "Importeer eerst de",
    "if the image is valid and": "als de afbeelding geldig is en",
    "[optional] The minimum length allowed for the name. Default value: 1.": "[optioneel] De minimaal toegestane lengte voor de naam. Standaardwaarde: 1.",
    "the function will remove duplicate emails from the output list. If set to": "De functie verwijdert dubbele e-mails uit de uitvoerlijst. Indien ingesteld op",
    "as it considers such strings to be empty.": "omdat het dergelijke strings als leeg beschouwt.",
    "Netherlands": "Nederland",
    "or not provided, it will keep the duplicate emails in the output list.": "of niet verstrekt, houdt het de dubbele e-mails in de uitvoerlijst.",
    "[optional] - The maximum length of the username. Default is Infinity.": "[optioneel] - De maximale lengte van de gebruikersnaam. De standaardinstelling is Infinity.",
    "Germany: 2 uppercase letters followed by 8 digits (e.g., 'AB12345678')": "Duitsland: 2 hoofdletters gevolgd door 8 cijfers (bijv. 'AB12345678')",
    "'regular' - Password greater than or equal to 6 and less than 8 characters, containing at least one number and one letter": "'normaal' - Wachtwoord groter dan of gelijk aan 6 en minder dan 8 tekens, dat ten minste één cijfer en één letter bevat",
    "'veryStrong' - Password with 8 or more characters, containing at least one uppercase letter, one number, one special character and one lowercase letter": "'veryStrong' - Wachtwoord met 8 of meer tekens, dat ten minste één hoofdletter, één cijfer, één speciaal teken en één kleine letter bevat",
    "Default value: false.": "Standaardwaarde: false.",
    "The input textarea string to be validated.": "De ingevoerde tekenreeks in het tekstgebied die moet worden gevalideerd.",
    "function checks if the input string is a valid MD5 hash. It returns": "functie controleert of de invoertekenreeks een geldige MD5-hash is. Het keert terug",
    "if it is not.": "als dat niet het geval is.",
    "Notes": "Notities",
    "Return Value": "Retourwaarde",
    "false": "vals",
    "The examples provided demonstrate how to use the function with different parameters and show the expected return values.": "De gegeven voorbeelden laten zien hoe de functie met verschillende parameters kan worden gebruikt en tonen de verwachte retourwaarden.",
    "Canada: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Canada: 1 hoofdletter gevolgd door 7 cijfers (bijv. 'A1234567')",
    "function is used to validate US phone numbers. It supports various formats, including \"XXX-XXX-XXXX\", \"(XXX) XXX-XXXX\", and \"1 (XXX) XXX-XXXX\". It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the phone number is valid, and \"errorMsg\" will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "functie wordt gebruikt om Amerikaanse telefoonnummers te valideren. Het ondersteunt verschillende formaten, waaronder \"XXX-XXX-XXXX\", \"(XXX) XXX-XXXX\" en \"1 (XXX) XXX-XXXX\". Het retourneert een object met twee eigenschappen: \"isValid\" (boolean) en \"errorMsg\" (tekenreeks). De eigenschap 'isValid' is waar als het telefoonnummer geldig is, en 'errorMsg' bevat het foutbericht als het telefoonnummer ongeldig is, of het is null als het telefoonnummer geldig is.",
    "The function expects the credit card number to be passed as a string. It uses the first digits of the card number to identify the card flag and returns the corresponding flag name as a string. If the card flag cannot be identified or the input is not a string, it returns 'Unknown'.": "De functie verwacht dat het creditcardnummer als een tekenreeks wordt doorgegeven. Het gebruikt de eerste cijfers van het kaartnummer om de kaartvlag te identificeren en retourneert de bijbehorende vlagnaam als een tekenreeks. Als de kaartvlag niet kan worden geïdentificeerd of als de invoer geen tekenreeks is, wordt 'Onbekend' geretourneerd.",
    "function with the image path as an argument. The function will return": "functie met het afbeeldingspad als argument. De functie keert terug",
    "Whether the password requires at least one letter. Default value: false.": "Of het wachtwoord ten minste één letter vereist. Standaardwaarde: false.",
    "function checks if the input string or number represents a valid decimal number. It returns": "Functie controleert of de ingevoerde tekenreeks of het ingevoerde getal een geldig decimaal getal vertegenwoordigt. Het keert terug",
    "'regular' - Password between 9 and 12 characters": "'regular' - Wachtwoord tussen 9 en 12 tekens",
    "if the value matches the postal code format for any of the supported countries, and": "als de waarde overeenkomt met de postcodenotatie voor een van de ondersteunde landen, en",
    "The function can be imported using ES6 syntax from the \"validateBRPhoneNumber\" package:": "De functie kan worden geïmporteerd met behulp van ES6-syntaxis uit het pakket \"validateBRPhoneNumber\":",
    "How to use the isValidTxt function": "Hoe de isValidTxt-functie te gebruiken",
    "set to": "ingesteld op",
    "if the MAC address is valid and follows the supported formats, and": "als het MAC-adres geldig is en voldoet aan de ondersteunde formaten, en",
    "'weak' - Password that repeats the same character more than 3 times in a row and is less than 10 characters long": "'weak' - Wachtwoord dat hetzelfde teken meer dan 3 keer achter elkaar herhaalt en minder dan 10 tekens lang is",
    "This function is a text area validation utility that checks the validity of a given textarea string based on certain criteria.": "Deze functie is een hulpprogramma voor het valideren van tekstgebieden dat de geldigheid van een bepaalde tekenreeks voor tekstgebieden controleert op basis van bepaalde criteria.",
    "The minimum length of the surname. Default is 1.": "De minimale lengte van de achternaam. De standaardwaarde is 1.",
    "if the input value matches any of the supported formats, and": "als de invoerwaarde overeenkomt met een van de ondersteunde indelingen, en",
    "Passing options to the": "Opties doorgeven aan de",
    "The name to be validated.": "De naam die moet worden gevalideerd.",
    "function checks if the input string is a valid Brazilian ZIP Code (CEP). It returns": "functie controleert of de invoertekenreeks een geldige Braziliaanse postcode (CEP) is. Het keert terug",
    "The function takes one parameter, which must be a string representing the password to be evaluated.": "De functie heeft één parameter, die een tekenreeks moet zijn die het te evalueren wachtwoord voorstelt.",
    "function is used to validate passwords. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the password meets the specified criteria, and \"errorMsg\" will contain the error message if the password is invalid, or it will be null if the password is valid.": "functie wordt gebruikt om wachtwoorden te valideren. Het retourneert een object met twee eigenschappen: \"isValid\" (boolean) en \"errorMsg\" (tekenreeks). De eigenschap \"isValid\" is waar als het wachtwoord voldoet aan de opgegeven criteria, en \"errorMsg\" bevat de foutmelding als het wachtwoord ongeldig is, of het is null als het wachtwoord geldig is.",
    "France: 2 uppercase letters followed by 7 digits (e.g., 'AB1234567')": "Frankrijk: 2 hoofdletters gevolgd door 7 cijfers (bijv. 'AB1234567')",
    "Example": "Voorbeeld",
    "[optional]": "[optioneel]",
    "the function will use a default list of valid domains. If set to": "De functie gebruikt een standaardlijst met geldige domeinen. Indien ingesteld op",
    "Default list of valid domains": "Standaardlijst met geldige domeinen",
    "The input string representing the MD5 hash to validate. The MD5 hash should be a 32-character string consisting of hexadecimal digits (0-9, A-F, a-f).": "De invoertekenreeks die de MD5-hash vertegenwoordigt die moet worden gevalideerd. De MD5-hash moet een tekenreeks van 32 tekens zijn die bestaat uit hexadecimale cijfers (0-9, AF, AF, AF).",
    "if the email address is valid and follows the supported format, and": "als het e-mailadres geldig is en de ondersteunde indeling volgt, en",
    "properties, indicating whether the CPF is valid and, in case of an error, the corresponding error message.": "eigenschappen, die aangeven of de CPF geldig is en, in geval van een fout, de bijbehorende foutmelding.",
    "function checks if the input string is empty or contains only whitespace characters. It returns": "Functie controleert of de invoertekenreeks leeg is of alleen spaties bevat. Het keert terug",
    "The maximum length allowed for the password. Default value: Infinity.": "De maximaal toegestane lengte van het wachtwoord. Standaardwaarde: Oneindig.",
    "Index 1: \"Can not be empty\"": "Index 1: \"Kan niet leeg zijn\"",
    "Canada": "Canada",
    "(optional boolean) - If set to": "(optioneel booleaans) - Indien ingesteld op",
    "The input string representing the date": "De invoertekenreeks die de datum vertegenwoordigt",
    "[optional] The maximum length allowed for the name. Default value: 20.": "[optioneel] De maximaal toegestane lengte voor de naam. Standaardwaarde: 20.",
    "The credit card number for which to identify the flag based on the first digits.": "Het creditcardnummer waarvoor de vlag kan worden geïdentificeerd op basis van de eerste cijfers.",
    "The phone number to be validated.": "Het telefoonnummer dat moet worden gevalideerd.",
    "The maximum allowed length for the textarea.": "De maximaal toegestane lengte van het tekstgebied.",
    "if the value is a valid decimal number and follows one of the supported formats, and": "als de waarde een geldig decimaal getal is en een van de ondersteunde notaties volgt, en",
    "South Africa": "Zuid-Afrika",
    "The minimum length allowed for the password. Default value: 1.": "De minimaal toegestane lengte voor het wachtwoord. Standaardwaarde: 1.",
    "Examples": "Voorbeelden",
    "Germany": "Duitsland",
    "How to use the isValidImage function": "De functie isValidImage gebruiken",
    "Function Signature": "Functie Handtekening",
    "An array of error messages to customize the response. If not provided, the function will use default error messages.": "Een reeks foutmeldingen om het antwoord aan te passen. Indien niet opgegeven, gebruikt de functie standaard foutmeldingen.",
    "The value to be checked if it represents a valid number.": "De waarde die moet worden gecontroleerd als deze een geldig getal vertegenwoordigt.",
    "The function takes one parameter, which must be a string representing the time to be checked.": "De functie heeft één parameter, die een tekenreeks moet zijn die de te controleren tijd voorstelt.",
    "function checks if the input string represents a valid credit card number using the Luhn algorithm. It returns": "functie controleert of de invoertekenreeks een geldig creditcardnummer vertegenwoordigt met behulp van het Luhn-algoritme. Het keert terug",
    "if the string is a valid Base64, and": "als de tekenreeks een geldige Base64 is, en",
    "The username to be validated.": "De gebruikersnaam die moet worden gevalideerd.",
    "'weak' - Password between 5 and 8 characters, consisting only of numbers": "'weak' - Wachtwoord tussen 5 en 8 tekens, alleen bestaande uit cijfers",
    "China: 1 uppercase letter followed by 8 digits (e.g., 'A12345678')": "China: 1 hoofdletter gevolgd door 8 cijfers (bijv. 'A12345678')",
    "Whether the password requires at least one uppercase letter. Default value: false.": "Of het wachtwoord ten minste één hoofdletter vereist. Standaardwaarde: false.",
    "Function Documentation": "Functie Documentatie",
    "The function expects the input value to be passed as a string. If the input is not a string, the function throws a TypeError. It removes any leading and trailing whitespace from the input string using the.": "De functie verwacht dat de invoerwaarde als een tekenreeks wordt doorgegeven. Als de invoer geen tekenreeks is, genereert de functie een TypeError. Het verwijdert alle voorloop- en volgspaties uit de invoertekenreeks met behulp van de.",
    "The function uses regular expressions to check the input postal code against supported 'countries' postal code formats. It returns": "De functie maakt gebruik van reguliere expressies om de ingevoerde postcode te controleren aan de hand van ondersteunde postcodenotaties van 'landen'. Het keert terug",
    "'strong' - Password with 8 or more characters, containing at least one uppercase letter, one number and one lowercase letter": "'sterk' - Wachtwoord van 8 of meer tekens, dat ten minste één hoofdletter, één cijfer en één kleine letter bevat",
    "function is used to validate a Brazilian CNPJ (National Registry of Legal Entities) number. It returns an object containing the": "functie wordt gebruikt om een Braziliaans CNPJ-nummer (National Registry of Legal Entities) te valideren. Het retourneert een object met de",
    "The value to be checked if it represents a valid port number.": "De waarde die moet worden gecontroleerd als deze een geldig poortnummer vertegenwoordigt.",
    "United Kingdom": "Verenigd Koninkrijk",
    "isEmail just does simple validations like checking if the string has the formatting of an email like several validators out there,": "isEmail voert alleen eenvoudige validaties uit, zoals controleren of de string de opmaak van een e-mail heeft, zoals verschillende validators die er zijn,",
    "Switzerland": "Zwitserland",
    "if the value is a valid number, and": "als de waarde een geldig getal is, en",
    "Spain": "Spanje",
    "The input string representing the email address to validate.": "De invoertekenreeks die het te valideren e-mailadres vertegenwoordigt.",
    "The function checks the length of the password and applies certain criteria to classify the password strength. The returned strength type is based on the following criteria:": "De functie controleert de lengte van het wachtwoord en past bepaalde criteria toe om de wachtwoordsterkte te classificeren. Het geretourneerde sterktetype is gebaseerd op de volgende criteria:",
    "What is the difference between": "Wat is het verschil tussen",
    "The input string representing the MAC address to validate. The MAC address can be in the following formats: \"001A2B3C4D5E\", \"00:1A:2B:3C:4D:5E\", or \"00-1A-2B-3C-4D-5E\".": "De invoertekenreeks die het MAC-adres vertegenwoordigt dat moet worden gevalideerd. Het MAC-adres kan de volgende notaties hebben: \"001A2B3C4D5E\", \"00:1A:2B:3C:4D:5E\" of \"00-1A-2B-3C-4D-5E\".",
    "function checks if the input value represents a valid time in the format \"hh:mm\" or \"hh:mm AM/PM\" or \"hh:mm:ss\" or \"hh:mm:ss AM/PM\". It returns": "functie controleert of de invoerwaarde een geldige tijd vertegenwoordigt in het formaat \"uu:mm\" of \"uu:mm AM/PM\" of \"uu:mm:ss\" of \"uu:mm:ss AM/PM\". Het keert terug",
    "Index 0: \"This textarea is too big\"": "Index 0: \"Dit tekstveld is te groot\"",
    "The function uses a regular expression to check if the input time string matches any of the supported time formats. It returns": "De functie maakt gebruik van een reguliere expressie om te controleren of de ingevoerde tijdreeks overeenkomt met een van de ondersteunde tijdnotaties. Het keert terug",
    "[optional] - This parameter determines whether to check for specific valid email domains or not. If set to": "[optioneel] - Deze parameter bepaalt of er moet worden gecontroleerd op specifieke geldige e-maildomeinen of niet. Indien ingesteld op",
    "it will clean after default domains. If set to an array of strings, it will clean after the specified custom domains.": "Het zal worden opgeschoond na standaarddomeinen. Als het is ingesteld op een array van tekenreeksen, wordt het opgeschoond na de opgegeven aangepaste domeinen.",
    "The time to be checked for validity. It must be in one of the supported formats: \"hh:mm\", \"hh:mm AM/PM\", \"hh:mm:ss\", or \"hh:mm:ss AM/PM\".": "Het tijdstip waarop de geldigheid moet worden gecontroleerd. Het moet een van de ondersteunde formaten hebben: \"uu:mm\", \"uu:mm AM/PM\", \"uu:mm:ss\" of \"uu:mm:ss AM/PM\".",
    "Supported Countries": "Ondersteunde landen",
    "no domain check will be performed. Alternatively, you can pass an array of custom valid domains to perform the check against a specific list.": "Er wordt geen domeincontrole uitgevoerd. U kunt ook een array van aangepaste geldige domeinen doorgeven om de controle uit te voeren op basis van een specifieke lijst.",
    "it returns an array with all the email addresses found. Otherwise, it returns only the first email address found as a string.": "Het retourneert een array met alle gevonden e-mailadressen. Anders wordt alleen het eerste e-mailadres geretourneerd dat als tekenreeks is gevonden.",
    "The function takes one parameter that can be either a string or a number: ": "De functie heeft één parameter die zowel een string als een getal kan zijn: ",
    "The default error messages are as follows:": "De standaard foutmeldingen zijn als volgt:",
    "How to use the isValidPdf function": "De functie isValidPdf gebruiken",
    "function is used to validate usernames. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the username meets the specified criteria, and \"errorMsg\" will contain the error message if the username is invalid, or it will be null if the username is valid.": "functie wordt gebruikt om gebruikersnamen te valideren. Het retourneert een object met twee eigenschappen: \"isValid\" (boolean) en \"errorMsg\" (tekenreeks). De eigenschap \"isValid\" is waar als de gebruikersnaam voldoet aan de opgegeven criteria, en \"errorMsg\" bevat het foutbericht als de gebruikersnaam ongeldig is, of het is null als de gebruikersnaam geldig is.",
    "if the string is composed of ASCII characters, and": "als de tekenreeks bestaat uit ASCII-tekens, en",
    "In this example it only allocates 4 bytes for performance reasons, but you can pass the entire file.": "In dit voorbeeld wordt slechts 4 bytes toegewezen om prestatieredenen, maar u kunt het hele bestand doorgeven.",
    "The Brazilian phone number to be validated.": "Het Braziliaanse telefoonnummer dat moet worden gevalideerd.",
    "'weak' - Password with less than 6 characters, consisting of numbers and letters": "'weak' - Wachtwoord met minder dan 6 tekens, bestaande uit cijfers en letters",
    "Japan": "Japan",
    "function checks if the input string is a valid Base64 string. It returns": "functie controleert of de invoertekenreeks een geldige Base64-tekenreeks is. Het keert terug",
    "A flag to determine if the textarea is required.": "Een markering om te bepalen of het tekstgebied vereist is.",
    "'strong' - Password between 13 and 16 characters": "'strong' - Wachtwoord tussen 13 en 16 tekens",
    "(optional boolean | string[]) - Either a boolean value indicating whether to clean after default domains or an array of custom domains to clean after. Default is": "(optioneel boolean | string[]) - Ofwel een booleaanse waarde die aangeeft of standaarddomeinen moeten worden opgeschoond of een array met aangepaste domeinen die moeten worden opgeschoond. Standaard is",
    "true": "waar",
    "The function takes one parameter, which must be a string representing the postal code to be checked.": "De functie heeft één parameter, die een tekenreeks moet zijn die de te controleren postcode voorstelt.",
    "function checks if the input value represents a valid port number. It returns": "Functie controleert of de invoerwaarde een geldig poortnummer vertegenwoordigt. Het keert terug",
    "function is used to validate a Brazilian CPF (Individual Taxpayer Identification) number. It returns an object containing the": "functie wordt gebruikt om een Braziliaans CPF-nummer (Individual Taxpayer Identification) te valideren. Het retourneert een object met de",
    "The function expects the input MD5 hash to be passed as a string. If the input is not a string, the function throws a TypeError. It removes leading and trailing whitespace from the input string and checks if the resulting string has a valid length (exactly 32 characters). Then, it uses a regular expression to verify if the cleaned MD5 hash consists only of hexadecimal digits. Additionally, the function checks if the MD5 hash is not a known weak hash, such as \"d41d8cd98f00b204e9800998ecf8427e\". If any of the checks fail, the function returns false; otherwise, it returns true, indicating that the input string is a valid MD5 hash.": "De functie verwacht dat de invoer MD5-hash als een string wordt doorgegeven. Als de invoer geen tekenreeks is, genereert de functie een TypeError. Het verwijdert voorloop- en volgspaties uit de invoertekenreeks en controleert of de resulterende tekenreeks een geldige lengte heeft (precies 32 tekens). Vervolgens wordt een reguliere expressie gebruikt om te controleren of de opgeschoonde MD5-hash alleen uit hexadecimale cijfers bestaat. Daarnaast controleert de functie of de MD5-hash geen bekende zwakke hash is, zoals \"d41d8cd98f00b204e9800998ecf8427e\". Als een van de controles mislukt, retourneert de functie false; anders retourneert het true, wat aangeeft dat de invoertekenreeks een geldige MD5-hash is.",
    "if the value matches any of these formats, and": "als de waarde overeenkomt met een van deze indelingen, en",
    "The function takes one parameter:": "De functie heeft één parameter:",
    "The function expects the input MAC address to be passed as a string. If the input is not a string, the function throws a TypeError. It removes all non-alphanumeric characters from the input string using a regular expression and checks if the resulting string has a valid length (exactly 12 characters). Then, it uses another regular expression to verify if the cleaned MAC address matches the supported pattern. The supported pattern is a 12-character string consisting of hexadecimal digits (0-9, A-F, a-f), with optional separators (\":\", \"-\") between pairs of hexadecimal digits.": "De functie verwacht dat het ingevoerde MAC-adres als een tekenreeks wordt doorgegeven. Als de invoer geen tekenreeks is, genereert de functie een TypeError. Het verwijdert alle niet-alfanumerieke tekens uit de invoertekenreeks met behulp van een reguliere expressie en controleert of de resulterende tekenreeks een geldige lengte heeft (precies 12 tekens). Vervolgens wordt een andere reguliere expressie gebruikt om te controleren of het opgeschoonde MAC-adres overeenkomt met het ondersteunde patroon. Het ondersteunde patroon is een tekenreeks van 12 tekens die bestaat uit hexadecimale cijfers (0-9, AF, AF, AF), met optionele scheidingstekens (\":\", \"-\") tussen paren hexadecimale cijfers.",
    "function to convert the value to a floating-point number. If the conversion results in a valid number and the value is finite (not infinity or NaN), the function returns true, indicating that the input value is a valid number. Otherwise, it returns false.": "functie om de waarde om te zetten in een drijvendekommagetal. Als de conversie resulteert in een geldig getal en de waarde eindig is (niet oneindig of NaN), retourneert de functie waar, wat aangeeft dat de invoerwaarde een geldig getal is. Anders retourneert het false.",
    "United States of America": "Verenigde Staten van Amerika",
    "Function is used to validate names. It returns an object with two properties: 'isValid' (boolean) and 'errorMsg' (string). The 'errorMsg' property will contain the error message if the name is invalid, or it will be null if the name is valid.": "Functie wordt gebruikt om namen te valideren. Het retourneert een object met twee eigenschappen: 'isValid' (boolean) en 'errorMsg' (string). De eigenschap 'errorMsg' bevat de foutmelding als de naam ongeldig is, of deze is null als de naam geldig is.",
    "The function expects the input email to be passed as a string. If the input is not a string, it will throw an error. If the email passed is an invalid email, it will return.": "De functie verwacht dat de ingevoerde e-mail als een tekenreeks wordt doorgegeven. Als de invoer geen tekenreeks is, zal deze een fout veroorzaken. Als de doorgegeven e-mail een ongeldig e-mailadres is, wordt het geretourneerd.",
    "The function checks if the input value is not null, undefined, or a boolean type. If any of these conditions are met, the function returns false since these values cannot represent valid numbers. For all other types, the function uses the.": "De functie controleert of de invoerwaarde niet null, ongedefinieerd of booleaans is. Als aan een van deze voorwaarden wordt voldaan, retourneert de functie false omdat deze waarden geen geldige getallen kunnen vertegenwoordigen. Voor alle andere typen gebruikt de functie de.",
    "function is used to check whether an txt file is valid or not. It accepts a Buffer as an argument.": "functie wordt gebruikt om te controleren of een txt-bestand geldig is of niet. Het accepteert een buffer als argument.",
    "The password to be evaluated for strength.": "Het wachtwoord dat moet worden beoordeeld op sterkte.",
    "Indicates if the textarea is valid based on the given criteria.": "Geeft aan of het tekstgebied geldig is op basis van de opgegeven criteria.",
    "if the CEP is valid, and": "indien het CEP geldig is, en",
    "function is used to check whether an audio file is valid or not. It accepts a Buffer as an argument.": "functie wordt gebruikt om te controleren of een audiobestand geldig is of niet. Het accepteert een buffer als argument.",
    "and": "en",
    "does not, it does complex validations and better than that, you can customize the validations passing the information in the parameters.": "doet dat niet, het doet complexe validaties en beter dan dat, u kunt de validaties aanpassen die de informatie in de parameters doorgeven.",
    "If the function is called with an invalid value for the": "Als de functie wordt aangeroepen met een ongeldige waarde voor de",
    "function is used to check whether an video file is valid or not. It accepts a Buffer as an argument.": "functie wordt gebruikt om te controleren of een videobestand geldig is of niet. Het accepteert een buffer als argument.",
    "France": "Frankrijk",
    "parameter is set to": "parameter is ingesteld op",
    "There are two ways to import the function:": "Er zijn twee manieren om de functie te importeren:",
    "An array of custom error messages for different validation conditions. The array should contain three elements corresponding to different error scenarios. If not provided, default error messages will be used. Default Error Messages:": "Een reeks aangepaste foutmeldingen voor verschillende validatievoorwaarden. De matrix moet drie elementen bevatten die overeenkomen met verschillende foutscenario's. Als dit niet het geval is, worden standaardfoutmeldingen gebruikt. Standaard foutmeldingen:",
    "Italy: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Italië: 1 hoofdletter gevolgd door 7 cijfers (bijv. 'A1234567')",
    "The function can be imported using ES6 syntax from the \"password-strength-tester\" package:": "De functie kan worden geïmporteerd met behulp van ES6-syntaxis uit het pakket \"password-strength-tester\":",
    "Types that are validated": "Typen die gevalideerd zijn",
    "A list of custom error messages. If not provided, it uses a default list of error messages.": "Een lijst met aangepaste foutmeldingen. Als dit niet het geval is, wordt een standaardlijst met foutmeldingen gebruikt.",
    "The CNPJ number to be validate.": "Het CNPJ-nummer dat moet worden gevalideerd.",
    "Example Usage with Nestjs and Multer": "Voorbeeld van gebruik met Nestjs en Multer",
    "properties, indicating whether the CNPJ is valid and, in case of an error, the corresponding error message.": "eigenschappen, die aangeven of de CNPJ geldig is en, in geval van een fout, de bijbehorende foutmelding.",
    "The function supports postal codes for the following countries:": "De functie ondersteunt postcodes voor de volgende landen:",
    "function is used to check whether an pdf file is valid or not. It accepts a Buffer as an argument.": "functie wordt gebruikt om te controleren of een PDF-bestand geldig is of niet. Het accepteert een buffer als argument."
  },
  "Header": {
    "header_docs": "Documentatie",
    "header_already_here": "U bent hier al (:",
    "header_title": "Veelvormige validator",
    "header_buy_coffee": "een koffie voor me kopen?",
    "header_github": "Mijn github",
    "header_home": "Thuis",
    "header_go_home": "Ga naar huis",
    "header_info": "Info"
  },
  "Footer": {
    "Services": "Diensten",
    "Terms": "Voorwaarde",
    "Privacy Policy": "Privacybeleid",
    "CopyRightMsg": "Meervoudige validator © 2023 - Gabriel Logan",
    "Home": "Thuis",
    "About": "Over"
  },
  "SidebarWrapperJs": {
    "Documentation": "Documentatie",
    "Home": "Thuis"
  },
  "DocumentationPython": {
    "Back to home": "Terug naar home",
    "Installation": "Installatie",
    "Install the package using pip: ": "Installeer het pakket met behulp van pip: ",
    "Functions signature": "Functies signatuur",
    "All params with default values are optional.": "Alle parameters met standaardwaarden zijn optioneel.",
    "Methods": "Methoden"
  },
  "NotFound": {
    "Msg": "Deze pagina kon niet worden gevonden.",
    "Status": "404"
  }
}