{
    "HomeLayout": {
        "Support me on Buy me a coffee": "Apóyame en ¡Cómprame un café!",
        "Description": "Biblioteca multilingüe hecha para validación, varios campos de formulario, tales como: correo electrónico, teléfono, contraseña, cpf, cnpj, tarjeta de crédito, números mágicos para la validación de mimetype de imágenes y mucho más.",
        "Technology": "Tecnología",
        "Opengraph description": "Biblioteca multilingüe hecha para validación, varios campos de formulario, tales como: correo electrónico, imagen, cpf, cnpj, tarjeta de crédito, números mágicos y mucho más.",
        "Classification": "Biblioteca de validación",
        "Title": "Validador multiforma",
        "Opengraph title": "Validador multiforme: su biblioteca de validación multilingüe"
    },
    "DocumentationJs": {
        "By - Gabriel Logan": "Por - Gabriel Logan",
        "Installation": "Instalación",
        "This package contains various modules for validating different types of data. Below are the available validation modules:": "Este paquete contiene varios módulos para validar diferentes tipos de datos. A continuación se muestran los módulos de validación disponibles:",
        "INFO: ": "INFORMACIÓN: ",
        "Welcome Introduction Text": "¡Bienvenido a la página principal de Multiform Validator! Aquí encontrará documentación detallada para varias funciones proporcionadas por Multiform Validator, una útil biblioteca de JavaScript para la validación de datos. Cada función está diseñada para ayudar a validar diferentes tipos de datos, lo que hace que el código sea más robusto y seguro. Multiform Validator consta de una serie de funciones especializadas que le permiten validar varios tipos de datos, como correos electrónicos, contraseñas, nombres, apellidos, números de pasaporte, números de teléfono y más. Cada función tiene parámetros configurables y proporciona mensajes de error personalizables para adaptarse a las necesidades de su proyecto. En cada página de documentación, encontrará una descripción completa de la función, incluido su propósito, parámetros aceptados y ejemplos de uso. Además, tendrá acceso a detalles sobre los mensajes de error predeterminados y cómo personalizarlos para que se ajusten a su aplicación. Al utilizar Multiform Validator, puede asegurarse de que la entrada del usuario en sus formularios sea correcta y cumpla con las reglas establecidas. Esta validación es esencial para evitar problemas como entradas no válidas, datos dañados o vulnerabilidades de seguridad. Trabajamos continuamente para mejorar y expandir Multiform Validator con nuevas funciones y mejoras para convertirlo en una herramienta aún más potente y flexible para sus necesidades de validación. Esperamos que estas documentaciones resulten útiles y simplifiquen el uso de Multiform Validator en sus proyectos. No dude en explorar las distintas funciones disponibles y no dude en ponerse en contacto con nosotros si tiene alguna pregunta o sugerencia. ¡Gracias por elegir Multiform Validator como su herramienta de validación de datos, y le deseamos éxito en sus proyectos! Equipo de validadores multiformes",
        "if you prefer, you can use importing as:": "Si lo prefieres, puedes utilizar la importación como:",
        "Official documentation": "Documentación oficial",
        "Example of use with CDN": "Ejemplo de uso con CDN",
        "Data Validator": "Validador de datos",
        "FirstInfoText": "Todas las funciones que tienen el nombre \"validate\" devuelven un objeto con dos propiedades, isValid: true | false y errorMsg: 'Cadena con errores'",
        "Feel free to find bugs Text Msg": "Siéntase libre de encontrar errores y reportarme. Sus comentarios son muy apreciados. ¡Un abrazo de Gabriel Logan!",
        "Back to home page": "Volver a la página de inicio",
        "If you want to help me, you can buy me a coffee (:": "Si quieres ayudarme, puedes invitarme a un café (:",
        "SecondInfoText": "Los restantes pueden devolver true|false|string|array, mira el documento de cada uno",
        "Available Validation Modules": "Módulos de validación disponibles",
        "Feel free to explore msg": "Siéntase libre de explorar las diversas funciones y experimentar con diferentes entradas para comprender su comportamiento. Si tiene algún problema o sugerencia, no dude en comunicarse conmigo. Sus comentarios son valiosos y ayudan a mejorar el paquete. ¡Feliz codificación!",
        "This npm package provides JavaScript functions to validate various forms fields.": "Este paquete npm proporciona funciones de JavaScript para validar varios campos de formularios."
    },
    "DocumentationLayout": {
        "Documentation": "Documentación",
        "Documentation for the Multiform Validator library.": "Documentación de la biblioteca Multiform Validator."
    },
    "Terms": {
        "Terms and Conditions": "Términos y condiciones",
        "Unauthorized use of this website is strictly prohibited.": "El uso no autorizado de este sitio web está estrictamente prohibido.",
        "Terms and Conditions of Multiform Validator library": "Términos y condiciones de la biblioteca Multiform Validator",
        "Welcome to Gabriel Logan Web Services. By using this website, you agree to the following terms and conditions:": "Bienvenido a Gabriel Logan Web Services. Al utilizar este sitio web, usted acepta los siguientes términos y condiciones:",
        "We do not collect any personal data through this website, and your privacy is important to us.": "No recopilamos ningún dato personal a través de este sitio web, y su privacidad es importante para nosotros.",
        "Your use of this website and any disputes arising are subject to the laws of [Your Country/Region].": "Su uso de este sitio web y cualquier disputa que surja están sujetos a las leyes de [Su país/región].",
        "The content provided on this website is for general information purposes only, and we make no warranties or representations regarding its accuracy or completeness.": "El contenido proporcionado en este sitio web es solo para fines de información general, y no ofrecemos garantías ni representaciones con respecto a su exactitud o integridad.",
        "We use the \"multiform-validator\" library, licensed under the MIT License, to enhance form field validation. However, we are not responsible for its usage or any consequences resulting from third-party use of the library.": "Utilizamos la biblioteca \"multiform-validator\", con licencia MIT License, para mejorar la validación de los campos de formularios. Sin embargo, no somos responsables de su uso ni de las consecuencias que resulten del uso de la biblioteca por parte de terceros.",
        "Thank you for visiting our website and using our services. If you have any questions or concerns, please don’t hesitate to contact us.": "Gracias por visitar nuestro sitio web y utilizar nuestros servicios. Si tiene alguna pregunta o inquietud, no dude en contactarnos."
    },
    "PrivacyPolices": {
        "privacy_questions": "Si tiene alguna pregunta o duda sobre nuestras políticas de privacidad o sobre el uso de la biblioteca \"multiform-validator\", no dude en ponerse en contacto con nosotros. Estamos aquí para atender cualquier consulta y garantizar su tranquilidad.",
        "privacy_intro": "En Gabriel Logan Web Services, nos tomamos muy en serio su privacidad. Queremos asegurarle que no recopilamos ningún dato en nuestro sitio web y que no utilizamos ningún dato a través de la biblioteca \"multiform-validator\". Su información permanece totalmente confidencial y su privacidad es primordial para nosotros.",
        "Privacy Policy": "Política de privacidad",
        "validator_local": "La biblioteca \"multiform-validator\" está diseñada para validar los campos de formulario en sus aplicaciones web sin acceder ni transmitir ningún dato a servidores externos. Toda la validación se realiza localmente dentro de su navegador, lo que garantiza que su información confidencial nunca salga de su dispositivo.",
        "privacy_thanks": "Gracias por elegir Gabriel Logan Web Services. Esperamos poder brindarle soluciones excepcionales mientras salvaguardamos su privacidad en cada paso del camino.",
        "privacy_title": "Políticas de privacidad - Sus datos están seguros con nosotros",
        "validator_secure": "Entendemos la importancia de la seguridad de los datos, y es por eso que hemos desarrollado meticulosamente la biblioteca \"validador multiform\" para que sea 100% segura. Sus datos permanecen bajo su control y no tenemos acceso a ninguna información procesada por la biblioteca.",
        "privacy_no_personal_data": "Cuando visite nuestro sitio web, tenga la seguridad de que no se recopilan ni almacenan datos personales, como su nombre, dirección de correo electrónico o información de contacto. Creemos en brindarle una experiencia de navegación segura y anónima.",
        "privacy_trust": "Su confianza es valiosa para nosotros, y queremos que se sienta seguro al utilizar nuestros servicios y la biblioteca \"multiform-validator\". Nuestro compromiso con su privacidad es inquebrantable y continuaremos priorizando la seguridad y protección de sus datos en todos los aspectos de nuestro trabajo."
    },
    "Info": {
        "info_intro": "Presentamos multiform-validator, una potente biblioteca múltiple desarrollada por Gabriel Logan. Esta biblioteca versátil está diseñada para validar numerosos campos de formularios, incluidas direcciones de correo electrónico, números de teléfono, contraseñas, CPF (números de registro de contribuyentes individuales brasileños), números de tarjetas de crédito y más.",
        "info_conclusion": "Por lo tanto, si está buscando una solución integral para la validación de campos de formularios, no busque más allá de multiform-validator. Aproveche el poder de esta biblioteca y tenga la seguridad de que su proceso de recopilación de datos será ágil, preciso y seguro.",
        "info_title": "multiform-validator - Biblioteca múltiple para la validación de campos de formulario",
        "info_performance": "Gabriel Logan se enorgullece de desarrollar la biblioteca de validadores multiforma con un enfoque en el rendimiento, la eficiencia y la confiabilidad. La biblioteca está optimizada para varios navegadores, lo que garantiza una compatibilidad perfecta para su diversa audiencia.",
        "info_prebuilt_rules": "La biblioteca multiform-validator viene con un amplio conjunto de reglas de validación prediseñadas y opciones personalizables. Puede integrarlo fácilmente en sus aplicaciones web y disfrutar de los beneficios de la validación del lado del cliente, lo que reduce el número de envíos de formularios no válidos y mejora la experiencia general del usuario.",
        "info_flexibility": "Lo que distingue a multiform-validator es su flexibilidad y facilidad de uso. Puede aplicar sin esfuerzo reglas de validación a diferentes campos de formulario simplemente agregando unas pocas líneas de código JavaScript. Además, la biblioteca proporciona mensajes de error informativos, guiando a los usuarios sobre cómo corregir sus entradas, reduciendo así la frustración y las tasas de abandono de formularios.",
        "Info_Page": "Página de información",
        "info_backend": "También puedes usar el validador multiform-validador para hacer validaciones en tu backend, funciona para cualquier tipo de validación de formularios o funciones que usen javascript, python, así que siéntete libre de usarlo",
        "info_ensure": "Con multiform-validator, puede asegurarse de que los datos enviados a través de sus formularios sean precisos y seguros. Ya sea que esté creando un formulario de registro, un proceso de pago o cualquier sistema de entrada de datos, esta biblioteca lo tiene cubierto."
    },
    "Manifest": {
        "Description": "Biblioteca multilingüe hecha para validación, varios campos de formulario, tales como: correo electrónico, teléfono, contraseña, cpf, cnpj, tarjeta de crédito, números mágicos para la validación de mimetype de imágenes y mucho más.",
        "ShortName": "Validador multiforma",
        "Name": "Validador multiforme: su biblioteca de validación multilingüe"
    },
    "DocumentationPage": {
        "doc_java_title": "Java",
        "doc_py_text": "Aquí puede encontrar la documentación para el lenguaje Python.",
        "doc_title": "Página de documentación",
        "doc_subtitle": "Estos son todos los idiomas que admitimos",
        "doc_java_text": "Aquí puede encontrar la documentación para el lenguaje Java.",
        "doc_py_title": "Pitón",
        "doc_js_title": "JavaScript",
        "doc_intro": "Bienvenido a la página de documentación. Aquí puedes encontrar todos los idiomas que admitimos y la documentación de cada uno de ellos.",
        "doc_js_text": "Aquí puede encontrar la documentación para el lenguaje JavaScript.",
        "doc_java_coming": "En la próxima..."
    },
    "About": {
        "about_backend": "Pero mis habilidades no se detienen ahí. Soy igualmente competente en el desarrollo de back-end, con experiencia en lenguajes como Python, Java y JavaScript (Node.js). La creación de aplicaciones web robustas y seguras es mi punto fuerte, ya que entiendo las complejidades de la lógica del lado del servidor. Mis soluciones están orientadas a la eficiencia, la fiabilidad y la escalabilidad, asegurándome de que, incluso durante las horas punta, mis aplicaciones ofrezcan una experiencia de usuario fluida.",
        "about_frontend": "Como desarrollador front-end, tengo buen ojo para la experiencia del usuario y el diseño de la interfaz. Me encanta transformar conceptos creativos en aplicaciones web visualmente cautivadoras e interactivas usando React y Nextjs con mecanografiado. Desde una navegación fluida hasta animaciones fluidas, presto atención a cada detalle para asegurarme de que mis proyectos front-end irradien elegancia y funcionalidad.",
        "About_Page": "Acerca de la página",
        "about_achievement": "Uno de los logros de los que me siento más orgulloso es la creación de una página web innovadora que simplifica y acelera la validación de formularios. Esta ingeniosa solución está diseñada para ayudar a las personas y a las empresas a agilizar su proceso de validación de formularios. Al aprovechar mi amplio conocimiento de desarrollo web e incorporar tecnologías de vanguardia, mi página ofrece una forma ultrarrápida y SÚPER eficiente de validar formularios. Su interfaz fácil de usar y sus funcionalidades intuitivas lo convierten en una herramienta indispensable para los profesionales que buscan mejorar su productividad y precisión en la recopilación de datos.",
        "about_title": "Hola, soy Gabriel Logan",
        "about_inspiration": "Cuando no estoy absorto en el código, es posible que me encuentres buscando inspiración en el mundo que me rodea. Ya sea que esté explorando al aire libre, sumergiéndome en el arte y la cultura, o participando en discusiones que invitan a la reflexión, me baso en una amplia gama de experiencias que dan forma a mi enfoque de la programación y mis interacciones con colegas y clientes.",
        "About_Page_Description": "Conozca a Gabriel Logan, el creador de la biblioteca validadora multiform, y aprenda sobre su pasión por el desarrollo web, las soluciones innovadoras y la dedicación a la experiencia del usuario.",
        "about_creative": "Aparte de mis habilidades técnicas, prospero como un solucionador creativo de problemas. Me encanta abordar los desafíos con una mentalidad innovadora y siempre estoy buscando formas de mejorar la experiencia del usuario. Mi capacidad para pensar fuera de la caja y ofrecer soluciones ingeniosas me distingue como un verdadero líder en el campo del desarrollo web.",
        "about_conclusion": "En conclusión, soy Gabriel Logan, un programador apasionado que entrelaza a la perfección las habilidades de front-end y back-end para crear experiencias web excepcionales. Mi mentalidad innovadora, mi atención al detalle y mi dedicación a la eficiencia me han llevado a desarrollar una página innovadora que creo que tendrá un impacto significativo en el mundo de la validación de formularios. A medida que el panorama digital continúa evolucionando, me mantengo a la vanguardia, listo para aceptar nuevos desafíos y marcar la diferencia a través de mi excepcional trabajo en el desarrollo web.",
        "about_intro": "Me considero un programador versátil apasionado por el desarrollo tanto front-end como back-end. Crear experiencias web excepcionales es lo que me impulsa, y me enorgullezco inmensamente del trabajo que produzco."
    },
    "HomePage": {
        "HelpMsg": "También puedes ayudar al programador comprando un café en el siguiente enlace, gracias de antemano (:",
        "SeeThePypiPage": "Ver la página de pypi",
        "Intro": "Usando mi librería, puedes convertir muchas líneas de código en muy pocas líneas y como resultado tienes un código más limpio, fuerte y seguro, tendrás varias herramientas y funciones que harán varias validaciones de formularios",
        "Hello": "Hola",
        "Documentation": "Documentación",
        "FollowThe": "Siga las instrucciones",
        "Welcome": "Bienvenido al sitio web de multiform-validator",
        "SeeTheGithubSourceCode": "Ver el código fuente de github",
        "ForMoreInfo": "Para más información",
        "SeeTheNpmPage": "Ver la página de npm"
    },
    "DocumentationJsFunctions": {
        "Alternatively, you can import the function using CommonJS syntax with": "Como alternativa, puede importar la función utilizando la sintaxis de CommonJS con",
        "if the input value matches any of the supported postal code formats, and": "si el valor de entrada coincide con cualquiera de los formatos de código postal admitidos, y",
        "The function takes two parameters:": "La función toma dos parámetros:",
        "containing the default error message 'Unknown error'.": "que contiene el mensaje de error predeterminado 'Error desconocido'.",
        "If the conversion is successful (resulting in a valid integer), the function checks if the integer is within the valid port range (1 to 65535). If the value is within this range and it is an integer, the function returns true, indicating that the input value represents a valid port number. Otherwise, it returns false.": "Si la conversión se realiza correctamente (lo que da como resultado un entero válido), la función comprueba si el entero está dentro del intervalo de puertos válido (de 1 a 65535). Si el valor está dentro de este rango y es un entero, la función devuelve true, lo que indica que el valor de entrada representa un número de puerto válido. De lo contrario, devuelve false.",
        "The function can be imported using ES6 syntax from the \"multiform-validator\" package:": "La función se puede importar usando la sintaxis de ES6 desde el paquete \"multiform-validator\":",
        "Brazil: 9 digits (e.g., '123456789')": "Brasil: 9 dígitos (por ejemplo, '123456789')",
        "The US phone number to be validated.": "El número de teléfono de EE. UU. que se va a validar.",
        "if the input string is a valid MD5 hash and follows the supported format, and": "si la cadena de entrada es un hash MD5 válido y sigue el formato admitido, y",
        "parameter (non-array), or if an error occurs during the validation process, the function will return an object with": "(no matriz), o si se produce un error durante el proceso de validación, la función devolverá un objeto con",
        "Note:": "Nota:",
        "function checks if the input string is a valid MAC address. It returns": "comprueba si la cadena de entrada es una dirección MAC válida. Regresa",
        "[optional] - The maximum length allowed for the email address. If not provided, the default value is 400.": "[opcional]: la longitud máxima permitida para la dirección de correo electrónico. Si no se proporciona, el valor predeterminado es 400.",
        "Parameters": "Parámetros",
        "The password to be validated.": "La contraseña que se va a validar.",
        "This function just checks the syntax of the email to see if it's valid or not, if you need a stronger validation, use: ": "Esta función solo verifica la sintaxis del correo electrónico para ver si es válido o no, si necesita una validación más sólida, use: ",
        "function is used to validate Brazilian phone numbers. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"errorMsg\" property will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "se utiliza para validar los números de teléfono brasileños. Devuelve un objeto con dos propiedades: \"isValid\" (booleano) y \"errorMsg\" (cadena). La propiedad \"errorMsg\" contendrá el mensaje de error si el número de teléfono no es válido, o será nulo si el número de teléfono es válido.",
        "if the input string is empty or consists of only whitespace characters, and": "si la cadena de entrada está vacía o consta solo de caracteres de espacio en blanco, y",
        "The CPF number to be validated.": "El número CPF que se va a validar.",
        "The function first checks if the input value is either a string or a number. If the value is a string, it is converted to an integer using": "La función comprueba primero si el valor de entrada es una cadena o un número. Si el valor es una cadena, se convierte en un entero usando",
        "Supported Passport Formats": "Formatos de pasaporte admitidos",
        "Default Error Messages": "Mensajes de error predeterminados",
        "optional array": "Matriz opcional",
        "Whether the password requires at least one number. Default value: false.": "Si la contraseña requiere al menos un número. Valor predeterminado: false.",
        "The function is a text area validation utility that checks the validity of a given textarea string based on certain criteria.": "La función es una utilidad de validación de área de texto que comprueba la validez de una cadena de área de texto determinada en función de ciertos criterios.",
        "The input string to check if it is a valid Brazilian ZIP Code (CEP).": "La cadena de entrada para comprobar si se trata de un código postal brasileño (CEP) válido.",
        "The input text from which emails will be extracted.": "El texto de entrada del que se extraerán los correos electrónicos.",
        "function is used to validate passport numbers. It returns an object with two properties: 'isValid' (boolean) and 'country' (string). The 'isValid' property will be true if the passport number matches the supported formats, and 'country' property will indicate the country associated with the passport number. If the passport number does not match any supported format, 'isValid' will be false, and 'country' will be null.": "se utiliza para validar los números de pasaporte. Devuelve un objeto con dos propiedades: 'isValid' (booleano) y 'country' (cadena). La propiedad 'isValid' será true si el número de pasaporte coincide con los formatos admitidos, y la propiedad 'country' indicará el país asociado con el número de pasaporte. Si el número de pasaporte no coincide con ningún formato admitido, 'isValid' será falso y 'country' será nulo.",
        "How to use the isValidVideo function": "Cómo usar la función isValidVideo",
        "function is used to validate surnames. It returns an object with two properties: 'isValid' (boolean) and 'errorMsg' (string). The 'isValid' property will be true if the surname meets the specified criteria, and 'errorMsg' will contain the error message if the surname is invalid, or it will be null if the surname is valid.": "se utiliza para validar los apellidos. Devuelve un objeto con dos propiedades: 'isValid' (booleano) y 'errorMsg' (cadena). La propiedad 'isValid' será true si el apellido cumple los criterios especificados, y 'errorMsg' contendrá el mensaje de error si el apellido no es válido, o será null si el apellido es válido.",
        "The surname to be validated.": "El apellido a validar.",
        "Contains the corresponding error message, if any, based on the validation result.": "Contiene el mensaje de error correspondiente, si lo hubiera, en función del resultado de la validación.",
        "You can also pass an options object as a second argument to exclude a specific type.": "También puede pasar un objeto options como segundo argumento para excluir un tipo específico.",
        "Australia: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Australia: 1 letra mayúscula seguida de 7 dígitos (por ejemplo, 'A1234567')",
        "United States: 9 digits (e.g., '123456789')": "Estados Unidos: 9 dígitos (por ejemplo, '123456789')",
        "function is used to validate email addresses. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"errorMsg\" property will contain the error message if the email address is invalid, or it will be null if the email address is valid.": "se utiliza para validar las direcciones de correo electrónico. Devuelve un objeto con dos propiedades: \"isValid\" (booleano) y \"errorMsg\" (cadena). La propiedad \"errorMsg\" contendrá el mensaje de error si la dirección de correo electrónico no es válida, o será nula si la dirección de correo electrónico es válida.",
        "The": "El",
        "The function expects the input value to be passed as a string. It checks each character of the string, and if any character has a character code greater than 127 (non-ASCII), the function returns": "La función espera que el valor de entrada se pase como una cadena. Comprueba cada carácter de la cadena y, si algún carácter tiene un código de caracteres mayor que 127 (no ASCII), la función devuelve",
        "The input string to check if it is a valid Base64 string.": "La cadena de entrada para comprobar si es una cadena Base64 válida.",
        "The maximum length of the surname. Default is 25.": "La longitud máxima del apellido. El valor predeterminado es 25.",
        "[optional] - The minimum length of the username. Default is 1.": "[opcional] - La longitud mínima del nombre de usuario. El valor predeterminado es 1.",
        "If the input is not a string or an empty string, it throws an error.": "Si la entrada no es una cadena o una cadena vacía, produce un error.",
        "The function expects the input value to be passed as a string. It checks if the string is a valid Base64 string using a regular expression. If the input is not a string or an empty string, it throws an error.": "La función espera que el valor de entrada se pase como una cadena. Comprueba si la cadena es una cadena Base64 válida mediante una expresión regular. Si la entrada no es una cadena o una cadena vacía, produce un error.",
        "'veryWeak' - Password with less than 6 characters, consisting only of numbers": "'veryWeak' - Contraseña con menos de 6 caracteres, que consta solo de números",
        "if the credit card number is valid, and": "si el número de la tarjeta de crédito es válido, y",
        "The function expects the input value to be passed as a string representing a credit card number. It removes any non-digit characters and applies the Luhn algorithm to validate the credit card number. If the input is not a string, the function throws an error.": "La función espera que el valor de entrada se pase como una cadena que representa un número de tarjeta de crédito. Elimina los caracteres que no sean dígitos y aplica el algoritmo de Luhn para validar el número de la tarjeta de crédito. Si la entrada no es una cadena, la función produce un error.",
        "function from 'multiform-validator'. Then, define the path to the image you want to check. Call the": "de 'multiform-validator'. A continuación, defina la ruta a la imagen que desea comprobar. Llame a la función",
        "function checks if the input string is a valid date.": "comprueba si la cadena de entrada es una fecha válida.",
        "The input string to check if it is empty or contains only whitespace characters.": "La cadena de entrada para comprobar si está vacía o solo contiene caracteres de espacio en blanco.",
        "function checks if the input string is a valid email address. It returns": "comprueba si la cadena de entrada es una dirección de correo electrónico válida. Regresa",
        "Whether the password requires at least one special character": "Si la contraseña requiere al menos un carácter especial",
        "The passport number to be validated.": "El número de pasaporte a validar.",
        "The function returns an object with two properties:": "La función devuelve un objeto con dos propiedades:",
        "The function expects the input to be passed as a string.": "La función espera que la entrada se pase como una cadena.",
        "if the value is a valid port number (within the range 1 to 65535), and": "si el valor es un número de puerto válido (dentro del rango de 1 a 65535), y",
        "The email address to be validated.": "La dirección de correo electrónico que se va a validar.",
        "'regular' - Password greater than 10 and has characters that are repeated more than 5 times in sequence": "'regular': contraseña mayor que 10 y caracteres que se repiten más de 5 veces en secuencia",
        "function evaluates the strength of a given password and returns the type of password strength as a string. The possible strength types are: \"veryWeak\", \"weak\", \"regular\", \"strong\", or \"veryStrong\", based on specific criteria.": "evalúa la seguridad de una contraseña determinada y devuelve el tipo de seguridad de la contraseña como una cadena. Los posibles tipos de fuerza son: \"muyDébil\", \"débil\", \"regular\", \"fuerte\" o \"muyFuerte\", según criterios específicos.",
        "which means it won't clean the email addresses after default domains ['.br', '.io', '.pt', '.us', '.org', '.com'];. If set to": "lo que significa que no limpiará las direcciones de correo electrónico después de los dominios predeterminados ['.br', '.io', '.pt', '.us', '.org', '.com'];. Si se establece en",
        "Using": "Usando",
        "postalCode": "Código postal",
        "The postal code to be checked for validity.": "El código postal cuya validez se va a comprobar.",
        "or not provided, it will return only the first email address found as a string.": "o no se proporciona, devolverá solo la primera dirección de correo electrónico encontrada como cadena.",
        "Function is used to validate phone numbers. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the phone number meets the specified criteria, and \"errorMsg\" will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "La función se utiliza para validar números de teléfono. Devuelve un objeto con dos propiedades: \"isValid\" (booleano) y \"errorMsg\" (cadena). La propiedad \"isValid\" será verdadera si el número de teléfono cumple los criterios especificados, y \"errorMsg\" contendrá el mensaje de error si el número de teléfono no es válido, o será null si el número de teléfono es válido.",
        "otherwise.": "de otra manera.",
        "[optional] - An object with the following optional properties:": "[opcional] - Un objeto con las siguientes propiedades opcionales:",
        "If no email address is found in the input text, the function will return the string 'No email found'.": "Si no se encuentra ninguna dirección de correo electrónico en el texto de entrada, la función devolverá la cadena 'No se encontró ningún correo electrónico'.",
        "function extracts email addresses from a given text. If the optional": "extrae direcciones de correo electrónico de un texto determinado. Si el opcional",
        "Brazil": "Brasil",
        "The input value to check if it represents a valid decimal number.": "El valor de entrada para comprobar si representa un número decimal válido.",
        "Usage Examples": "Ejemplos de uso",
        "Index 2: \"Unknown error\"": "Índice 2: \"Error desconocido\"",
        "The function expects the input value to be passed as a string.": "La función espera que el valor de entrada se pase como una cadena.",
        "the function will return an array with all the email addresses found. If set to": "La función devolverá una matriz con todas las direcciones de correo electrónico encontradas. Si se establece en",
        "The input string to check for ASCII characters.": "La cadena de entrada para comprobar si hay caracteres ASCII.",
        "function checks if the input value represents a valid postal code for supported countries. It returns": "comprueba si el valor de entrada representa un código postal válido para los países admitidos. Regresa",
        "The input string representing the credit card number to validate.": "La cadena de entrada que representa el número de tarjeta de crédito que se va a validar.",
        "method and checks if the resulting string is empty (i.e., has a length of 0). If the input string consists of only whitespace characters, the function also returns.": "y comprueba si la cadena resultante está vacía (es decir, tiene una longitud de 0). Si la cadena de entrada consta solo de caracteres de espacio en blanco, la función también devuelve.",
        "function is used to check whether an image file is valid or not. It accepts a Buffer as an argument.": "se utiliza para comprobar si un archivo de imagen es válido o no. Acepta un Buffer como argumento.",
        "The function expects the input value to be passed as a string or a number representing a decimal number. If the input is not a string or number, or an empty string, the function throws an error. It uses a regular expression to validate decimal numbers, supports both dot (.) and comma (,) as decimal separators, and checks for multiple decimal separators. Additionally, it performs checks for the negative sign to ensure it is only at the beginning of the value.": "La función espera que el valor de entrada se pase como una cadena o un número que representa un número decimal. Si la entrada no es una cadena o un número, o una cadena vacía, la función produce un error. Utiliza una expresión regular para validar números decimales, admite tanto el punto (.) como la coma (,) como separadores decimales y comprueba si hay varios separadores decimales. Además, realiza comprobaciones del signo negativo para asegurarse de que solo está al principio del valor.",
        "Italy": "Italia",
        "function checks if the input string contains only ASCII characters. It returns": "comprueba si la cadena de entrada contiene solo caracteres ASCII. Regresa",
        "[optional] - The country code to check if the email ends with it. If not provided, no country code check will be performed.": "[opcional] - El código de país para comprobar si el correo electrónico termina con él. Si no se proporciona, no se realizará ninguna verificación del código de país.",
        "India: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "India: 1 letra mayúscula seguida de 7 dígitos (por ejemplo, 'A1234567')",
        "function checks if the input value is a valid number. It returns": "comprueba si el valor de entrada es un número válido. Regresa",
        "[optional] - An array of error messages to customize the response. If not provided, the function will use default error messages.": "[opcional]: una matriz de mensajes de error para personalizar la respuesta. Si no se proporciona, la función utilizará mensajes de error predeterminados.",
        "'veryStrong' - Password longer than 16 characters": "'veryStrong' - Contraseña de más de 16 caracteres",
        "function is used to identify the credit card flag based on the first digits of the card number. It returns the name of the card flag as a string.": "se utiliza para identificar la bandera de la tarjeta de crédito en función de los primeros dígitos del número de la tarjeta. Devuelve el nombre de la marca de la tarjeta como una cadena.",
        "United Kingdom: 2 uppercase letters followed by 6 digits (e.g., 'AB123456')": "Reino Unido: 2 letras mayúsculas seguidas de 6 dígitos (por ejemplo, 'AB123456')",
        "How to use the isValidAudio function": "Cómo usar la función isValidAudio",
        "First, import the": "En primer lugar, importe el archivo",
        "if the image is valid and": "si la imagen es válida y",
        "[optional] The minimum length allowed for the name. Default value: 1.": "[Opcional] La longitud mínima permitida para el nombre. Valor predeterminado: 1.",
        "the function will remove duplicate emails from the output list. If set to": "La función eliminará los correos electrónicos duplicados de la lista de salida. Si se establece en",
        "as it considers such strings to be empty.": "ya que considera que dichas cadenas están vacías.",
        "Netherlands": "Países Bajos",
        "or not provided, it will keep the duplicate emails in the output list.": "o no se proporciona, mantendrá los correos electrónicos duplicados en la lista de salida.",
        "[optional] - The maximum length of the username. Default is Infinity.": "[opcional] - La longitud máxima del nombre de usuario. El valor predeterminado es Infinito.",
        "Germany: 2 uppercase letters followed by 8 digits (e.g., 'AB12345678')": "Alemania: 2 letras mayúsculas seguidas de 8 dígitos (por ejemplo, 'AB12345678')",
        "'regular' - Password greater than or equal to 6 and less than 8 characters, containing at least one number and one letter": "'regular': contraseña mayor o igual a 6 y menor de 8 caracteres, que contiene al menos un número y una letra.",
        "'veryStrong' - Password with 8 or more characters, containing at least one uppercase letter, one number, one special character and one lowercase letter": "'veryStrong' - Contraseña con 8 o más caracteres, que contiene al menos una letra mayúscula, un número, un carácter especial y una letra minúscula",
        "Default value: false.": "Valor predeterminado: false.",
        "The input textarea string to be validated.": "La cadena de área de texto de entrada que se va a validar.",
        "function checks if the input string is a valid MD5 hash. It returns": "comprueba si la cadena de entrada es un hash MD5 válido. Regresa",
        "if it is not.": "si no lo es.",
        "Notes": "Notas",
        "Return Value": "Valor devuelto",
        "false": "falso",
        "The examples provided demonstrate how to use the function with different parameters and show the expected return values.": "Los ejemplos proporcionados muestran cómo utilizar la función con diferentes parámetros y muestran los valores devueltos esperados.",
        "Canada: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Canadá: 1 letra mayúscula seguida de 7 dígitos (por ejemplo, 'A1234567')",
        "function is used to validate US phone numbers. It supports various formats, including \"XXX-XXX-XXXX\", \"(XXX) XXX-XXXX\", and \"1 (XXX) XXX-XXXX\". It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the phone number is valid, and \"errorMsg\" will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "se utiliza para validar los números de teléfono de EE. UU. Es compatible con varios formatos, incluidos \"XXX-XXX-XXXX\", \"(XXX) XXX-XXXX\" y \"1 (XXX) XXX-XXXX\". Devuelve un objeto con dos propiedades: \"isValid\" (booleano) y \"errorMsg\" (cadena). La propiedad \"isValid\" será true si el número de teléfono es válido y \"errorMsg\" contendrá el mensaje de error si el número de teléfono no es válido, o será null si el número de teléfono es válido.",
        "The function expects the credit card number to be passed as a string. It uses the first digits of the card number to identify the card flag and returns the corresponding flag name as a string. If the card flag cannot be identified or the input is not a string, it returns 'Unknown'.": "La función espera que el número de tarjeta de crédito se pase como una cadena. Utiliza los primeros dígitos del número de tarjeta para identificar la marca de tarjeta y devuelve el nombre de la marca correspondiente como una cadena. Si no se puede identificar el indicador de la tarjeta o la entrada no es una cadena, devuelve 'Desconocido'.",
        "function with the image path as an argument. The function will return": "con la ruta de la imagen como argumento. La función devolverá",
        "Whether the password requires at least one letter. Default value: false.": "Si la contraseña requiere al menos una letra. Valor predeterminado: false.",
        "function checks if the input string or number represents a valid decimal number. It returns": "comprueba si la cadena o el número de entrada representa un número decimal válido. Regresa",
        "'regular' - Password between 9 and 12 characters": "'regular' - Contraseña entre 9 y 12 caracteres",
        "if the value matches the postal code format for any of the supported countries, and": "si el valor coincide con el formato de código postal de cualquiera de los países admitidos, y",
        "The function can be imported using ES6 syntax from the \"validateBRPhoneNumber\" package:": "La función se puede importar usando la sintaxis ES6 desde el paquete \"validateBRPhoneNumber\":",
        "How to use the isValidTxt function": "Cómo usar la función isValidTxt",
        "set to": "Establézcalo en",
        "if the MAC address is valid and follows the supported formats, and": "si la dirección MAC es válida y sigue los formatos admitidos, y",
        "'weak' - Password that repeats the same character more than 3 times in a row and is less than 10 characters long": "'weak': contraseña que repite el mismo carácter más de 3 veces seguidas y tiene menos de 10 caracteres",
        "This function is a text area validation utility that checks the validity of a given textarea string based on certain criteria.": "Esta función es una utilidad de validación de área de texto que comprueba la validez de una cadena de área de texto determinada en función de ciertos criterios.",
        "The minimum length of the surname. Default is 1.": "La longitud mínima del apellido. El valor predeterminado es 1.",
        "if the input value matches any of the supported formats, and": "si el valor de entrada coincide con cualquiera de los formatos admitidos, y",
        "Passing options to the": "Pasar opciones a la función",
        "The name to be validated.": "El nombre que se va a validar.",
        "function checks if the input string is a valid Brazilian ZIP Code (CEP). It returns": "comprueba si la cadena de entrada es un código postal brasileño (CEP) válido. Regresa",
        "The function takes one parameter, which must be a string representing the password to be evaluated.": "La función toma un parámetro, que debe ser una cadena que represente la contraseña que se va a evaluar.",
        "function is used to validate passwords. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the password meets the specified criteria, and \"errorMsg\" will contain the error message if the password is invalid, or it will be null if the password is valid.": "se utiliza para validar contraseñas. Devuelve un objeto con dos propiedades: \"isValid\" (booleano) y \"errorMsg\" (cadena). La propiedad \"isValid\" será verdadera si la contraseña cumple los criterios especificados, y \"errorMsg\" contendrá el mensaje de error si la contraseña no es válida, o será nula si la contraseña es válida.",
        "France: 2 uppercase letters followed by 7 digits (e.g., 'AB1234567')": "Francia: 2 letras mayúsculas seguidas de 7 dígitos (por ejemplo, 'AB1234567')",
        "Example": "Ejemplo",
        "[optional]": "[Opcional]",
        "the function will use a default list of valid domains. If set to": "La función usará una lista predeterminada de dominios válidos. Si se establece en",
        "Default list of valid domains": "Lista predeterminada de dominios válidos",
        "The input string representing the MD5 hash to validate. The MD5 hash should be a 32-character string consisting of hexadecimal digits (0-9, A-F, a-f).": "La cadena de entrada que representa el hash MD5 que se va a validar. El hash MD5 debe ser una cadena de 32 caracteres que conste de dígitos hexadecimales (0-9, A-F, a-f).",
        "if the email address is valid and follows the supported format, and": "si la dirección de correo electrónico es válida y sigue el formato admitido, y",
        "properties, indicating whether the CPF is valid and, in case of an error, the corresponding error message.": "propiedades, indicando si el CPF es válido y, en caso de error, el mensaje de error correspondiente.",
        "function checks if the input string is empty or contains only whitespace characters. It returns": "comprueba si la cadena de entrada está vacía o contiene solo caracteres de espacio en blanco. Regresa",
        "The maximum length allowed for the password. Default value: Infinity.": "La longitud máxima permitida para la contraseña. Valor predeterminado: Infinito.",
        "Index 1: \"Can not be empty\"": "Índice 1: \"No puede estar vacío\"",
        "Canada": "Canadá",
        "(optional boolean) - If set to": "(booleano opcional) - Si se establece en",
        "The input string representing the date": "La cadena de entrada que representa la fecha",
        "[optional] The maximum length allowed for the name. Default value: 20.": "[Opcional] La longitud máxima permitida para el nombre. Valor predeterminado: 20.",
        "The credit card number for which to identify the flag based on the first digits.": "El número de tarjeta de crédito para el que se identifica la bandera en función de los primeros dígitos.",
        "The phone number to be validated.": "El número de teléfono que se va a validar.",
        "The maximum allowed length for the textarea.": "La longitud máxima permitida para el área de texto.",
        "if the value is a valid decimal number and follows one of the supported formats, and": "si el valor es un número decimal válido y sigue uno de los formatos admitidos, y",
        "South Africa": "Sudáfrica",
        "The minimum length allowed for the password. Default value: 1.": "La longitud mínima permitida para la contraseña. Valor predeterminado: 1.",
        "Examples": "Ejemplos",
        "Germany": "Alemania",
        "How to use the isValidImage function": "Cómo usar la función isValidImage",
        "Function Signature": "Firma de función",
        "An array of error messages to customize the response. If not provided, the function will use default error messages.": "Una matriz de mensajes de error para personalizar la respuesta. Si no se proporciona, la función utilizará mensajes de error predeterminados.",
        "The value to be checked if it represents a valid number.": "El valor que se va a comprobar si representa un número válido.",
        "The function takes one parameter, which must be a string representing the time to be checked.": "La función toma un parámetro, que debe ser una cadena que represente el tiempo que se va a verificar.",
        "function checks if the input string represents a valid credit card number using the Luhn algorithm. It returns": "comprueba si la cadena de entrada representa un número de tarjeta de crédito válido mediante el algoritmo de Luhn. Regresa",
        "if the string is a valid Base64, and": "si la cadena es un Base64 válido, y",
        "The username to be validated.": "El nombre de usuario que se va a validar.",
        "'weak' - Password between 5 and 8 characters, consisting only of numbers": "'weak' - Contraseña de entre 5 y 8 caracteres, que consta solo de números",
        "China: 1 uppercase letter followed by 8 digits (e.g., 'A12345678')": "China: 1 letra mayúscula seguida de 8 dígitos (por ejemplo, 'A12345678')",
        "Whether the password requires at least one uppercase letter. Default value: false.": "Si la contraseña requiere al menos una letra mayúscula. Valor predeterminado: false.",
        "Function Documentation": "Documentación de la función",
        "The function expects the input value to be passed as a string. If the input is not a string, the function throws a TypeError. It removes any leading and trailing whitespace from the input string using the.": "La función espera que el valor de entrada se pase como una cadena. Si la entrada no es una cadena, la función produce un TypeError. Elimina cualquier espacio en blanco inicial y final de la cadena de entrada mediante el comando .",
        "The function uses regular expressions to check the input postal code against supported 'countries' postal code formats. It returns": "La función utiliza expresiones regulares para comprobar el código postal de entrada con los formatos de código postal de \"países\" admitidos. Regresa",
        "'strong' - Password with 8 or more characters, containing at least one uppercase letter, one number and one lowercase letter": "'strong': contraseña con 8 o más caracteres, que contiene al menos una letra mayúscula, un número y una letra minúscula",
        "function is used to validate a Brazilian CNPJ (National Registry of Legal Entities) number. It returns an object containing the": "se utiliza para validar un número del CNPJ (Registro Nacional de Personas Jurídicas) brasileño. Devuelve un objeto que contiene el objeto",
        "The value to be checked if it represents a valid port number.": "El valor que se va a comprobar si representa un número de puerto válido.",
        "United Kingdom": "Reino Unido",
        "isEmail just does simple validations like checking if the string has the formatting of an email like several validators out there,": "isEmail solo realiza validaciones simples, como verificar si la cadena tiene el formato de un correo electrónico como varios validadores que existen,",
        "Switzerland": "Suiza",
        "if the value is a valid number, and": "si el valor es un número válido, y",
        "Spain": "España",
        "The input string representing the email address to validate.": "La cadena de entrada que representa la dirección de correo electrónico que se va a validar.",
        "The function checks the length of the password and applies certain criteria to classify the password strength. The returned strength type is based on the following criteria:": "La función comprueba la longitud de la contraseña y aplica ciertos criterios para clasificar la seguridad de la contraseña. El tipo de fuerza devuelto se basa en los siguientes criterios:",
        "What is the difference between": "¿Cuál es la diferencia entre",
        "The input string representing the MAC address to validate. The MAC address can be in the following formats: \"001A2B3C4D5E\", \"00:1A:2B:3C:4D:5E\", or \"00-1A-2B-3C-4D-5E\".": "La cadena de entrada que representa la dirección MAC que se va a validar. La dirección MAC puede tener los siguientes formatos: \"001A2B3C4D5E\", \"00:1A:2B:3C:4D:5E\" o \"00-1A-2B-3C-4D-5E\".",
        "function checks if the input value represents a valid time in the format \"hh:mm\" or \"hh:mm AM/PM\" or \"hh:mm:ss\" or \"hh:mm:ss AM/PM\". It returns": "comprueba si el valor de entrada representa una hora válida en el formato \"hh:mm\" o \"hh:mm AM/PM\" o \"hh:mm:ss\" o \"hh:mm:ss AM/PM\". Regresa",
        "Index 0: \"This textarea is too big\"": "Índice 0: \"Esta área de texto es demasiado grande\"",
        "The function uses a regular expression to check if the input time string matches any of the supported time formats. It returns": "La función utiliza una expresión regular para comprobar si la cadena de tiempo de entrada coincide con alguno de los formatos de tiempo admitidos. Regresa",
        "[optional] - This parameter determines whether to check for specific valid email domains or not. If set to": "[opcional]: este parámetro determina si se deben comprobar o no dominios de correo electrónico válidos específicos. Si se establece en",
        "it will clean after default domains. If set to an array of strings, it will clean after the specified custom domains.": "Limpiará los dominios predeterminados. Si se establece en una matriz de cadenas, se limpiará después de los dominios personalizados especificados.",
        "The time to be checked for validity. It must be in one of the supported formats: \"hh:mm\", \"hh:mm AM/PM\", \"hh:mm:ss\", or \"hh:mm:ss AM/PM\".": "El tiempo que se va a comprobar para su validez. Debe estar en uno de los formatos admitidos: \"hh:mm\", \"hh:mm AM/PM\", \"hh:mm:ss\" o \"hh:mm:ss AM/PM\".",
        "Supported Countries": "Países admitidos",
        "no domain check will be performed. Alternatively, you can pass an array of custom valid domains to perform the check against a specific list.": "No se realizará ninguna comprobación de dominio. Como alternativa, puede pasar una matriz de dominios válidos personalizados para realizar la comprobación en una lista específica.",
        "it returns an array with all the email addresses found. Otherwise, it returns only the first email address found as a string.": "Devuelve una matriz con todas las direcciones de correo electrónico encontradas. De lo contrario, devuelve solo la primera dirección de correo electrónico encontrada como cadena.",
        "The function takes one parameter that can be either a string or a number: ": "La función toma un parámetro que puede ser una cadena o un número: ",
        "The default error messages are as follows:": "Los mensajes de error predeterminados son los siguientes:",
        "How to use the isValidPdf function": "Cómo usar la función isValidPdf",
        "function is used to validate usernames. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the username meets the specified criteria, and \"errorMsg\" will contain the error message if the username is invalid, or it will be null if the username is valid.": "se utiliza para validar los nombres de usuario. Devuelve un objeto con dos propiedades: \"isValid\" (booleano) y \"errorMsg\" (cadena). La propiedad \"isValid\" será verdadera si el nombre de usuario cumple los criterios especificados, y \"errorMsg\" contendrá el mensaje de error si el nombre de usuario no es válido, o será null si el nombre de usuario es válido.",
        "if the string is composed of ASCII characters, and": "si la cadena está compuesta por caracteres ASCII, y",
        "In this example it only allocates 4 bytes for performance reasons, but you can pass the entire file.": "En este ejemplo, solo asigna 4 bytes por razones de rendimiento, pero puede pasar todo el archivo.",
        "The Brazilian phone number to be validated.": "El número de teléfono brasileño que se va a validar.",
        "'weak' - Password with less than 6 characters, consisting of numbers and letters": "'weak' - Contraseña con menos de 6 caracteres, que consta de números y letras",
        "Japan": "Japón",
        "function checks if the input string is a valid Base64 string. It returns": "comprueba si la cadena de entrada es una cadena Base64 válida. Regresa",
        "A flag to determine if the textarea is required.": "Indicador para determinar si el área de texto es necesaria.",
        "'strong' - Password between 13 and 16 characters": "'strong' - Contraseña entre 13 y 16 caracteres",
        "(optional boolean | string[]) - Either a boolean value indicating whether to clean after default domains or an array of custom domains to clean after. Default is": "(opcional booleano | string[]): un valor booleano que indica si se deben limpiar después de los dominios predeterminados o una matriz de dominios personalizados para limpiar después. El valor predeterminado es",
        "true": "verdadero",
        "The function takes one parameter, which must be a string representing the postal code to be checked.": "La función toma un parámetro, que debe ser una cadena que represente el código postal que se va a comprobar.",
        "function checks if the input value represents a valid port number. It returns": "comprueba si el valor de entrada representa un número de puerto válido. Regresa",
        "function is used to validate a Brazilian CPF (Individual Taxpayer Identification) number. It returns an object containing the": "se utiliza para validar un número brasileño de CPF (Identificación Personal del Contribuyente). Devuelve un objeto que contiene el objeto",
        "The function expects the input MD5 hash to be passed as a string. If the input is not a string, the function throws a TypeError. It removes leading and trailing whitespace from the input string and checks if the resulting string has a valid length (exactly 32 characters). Then, it uses a regular expression to verify if the cleaned MD5 hash consists only of hexadecimal digits. Additionally, the function checks if the MD5 hash is not a known weak hash, such as \"d41d8cd98f00b204e9800998ecf8427e\". If any of the checks fail, the function returns false; otherwise, it returns true, indicating that the input string is a valid MD5 hash.": "La función espera que el hash MD5 de entrada se pase como una cadena. Si la entrada no es una cadena, la función produce un TypeError. Elimina los espacios en blanco iniciales y finales de la cadena de entrada y comprueba si la cadena resultante tiene una longitud válida (exactamente 32 caracteres). A continuación, utiliza una expresión regular para verificar si el hash MD5 limpio consta solo de dígitos hexadecimales. Además, la función comprueba si el hash MD5 no es un hash débil conocido, como \"d41d8cd98f00b204e9800998ecf8427e\". Si se produce un error en alguna de las comprobaciones, la función devuelve false; de lo contrario, devuelve true, lo que indica que la cadena de entrada es un hash MD5 válido.",
        "if the value matches any of these formats, and": "si el valor coincide con cualquiera de estos formatos, y",
        "The function takes one parameter:": "La función toma un parámetro:",
        "The function expects the input MAC address to be passed as a string. If the input is not a string, the function throws a TypeError. It removes all non-alphanumeric characters from the input string using a regular expression and checks if the resulting string has a valid length (exactly 12 characters). Then, it uses another regular expression to verify if the cleaned MAC address matches the supported pattern. The supported pattern is a 12-character string consisting of hexadecimal digits (0-9, A-F, a-f), with optional separators (\":\", \"-\") between pairs of hexadecimal digits.": "La función espera que la dirección MAC de entrada se pase como una cadena. Si la entrada no es una cadena, la función produce un TypeError. Elimina todos los caracteres no alfanuméricos de la cadena de entrada mediante una expresión regular y comprueba si la cadena resultante tiene una longitud válida (exactamente 12 caracteres). A continuación, utiliza otra expresión regular para verificar si la dirección MAC limpia coincide con el patrón admitido. El patrón admitido es una cadena de 12 caracteres que consta de dígitos hexadecimales (0-9, A-F, a-f), con separadores opcionales (\":\", \"-\") entre pares de dígitos hexadecimales.",
        "function to convert the value to a floating-point number. If the conversion results in a valid number and the value is finite (not infinity or NaN), the function returns true, indicating that the input value is a valid number. Otherwise, it returns false.": "para convertir el valor en un número de coma flotante. Si la conversión da como resultado un número válido y el valor es finito (no infinito ni NaN), la función devuelve true, lo que indica que el valor de entrada es un número válido. De lo contrario, devuelve false.",
        "United States of America": "Estados Unidos de América",
        "Function is used to validate names. It returns an object with two properties: 'isValid' (boolean) and 'errorMsg' (string). The 'errorMsg' property will contain the error message if the name is invalid, or it will be null if the name is valid.": "La función se utiliza para validar los nombres. Devuelve un objeto con dos propiedades: 'isValid' (booleano) y 'errorMsg' (cadena). La propiedad 'errorMsg' contendrá el mensaje de error si el nombre no es válido, o será nulo si el nombre es válido.",
        "The function expects the input email to be passed as a string. If the input is not a string, it will throw an error. If the email passed is an invalid email, it will return.": "La función espera que el correo electrónico de entrada se pase como una cadena. Si la entrada no es una cadena, producirá un error. Si el correo electrónico pasado es un correo electrónico no válido, se devolverá.",
        "The function checks if the input value is not null, undefined, or a boolean type. If any of these conditions are met, the function returns false since these values cannot represent valid numbers. For all other types, the function uses the.": "La función comprueba si el valor de entrada no es nulo, indefinido o de tipo booleano. Si se cumple alguna de estas condiciones, la función devuelve false ya que estos valores no pueden representar números válidos. Para todos los demás tipos, la función utiliza el.",
        "function is used to check whether an txt file is valid or not. It accepts a Buffer as an argument.": "se utiliza para comprobar si un archivo txt es válido o no. Acepta un Buffer como argumento.",
        "The password to be evaluated for strength.": "La seguridad de la contraseña que se va a evaluar.",
        "Indicates if the textarea is valid based on the given criteria.": "Indica si el área de texto es válida en función de los criterios especificados.",
        "if the CEP is valid, and": "si el CEP es válido, y",
        "function is used to check whether an audio file is valid or not. It accepts a Buffer as an argument.": "se utiliza para comprobar si un archivo de audio es válido o no. Acepta un Buffer como argumento.",
        "and": "y",
        "does not, it does complex validations and better than that, you can customize the validations passing the information in the parameters.": "no lo hace, hace validaciones complejas y mejor que eso, puede personalizar las validaciones pasando la información en los parámetros.",
        "If the function is called with an invalid value for the": "Si se llama a la función con un valor no válido para el",
        "function is used to check whether an video file is valid or not. It accepts a Buffer as an argument.": "se utiliza para comprobar si un archivo de vídeo es válido o no. Acepta un Buffer como argumento.",
        "France": "Francia",
        "parameter is set to": "se establece en",
        "There are two ways to import the function:": "Hay dos formas de importar la función:",
        "An array of custom error messages for different validation conditions. The array should contain three elements corresponding to different error scenarios. If not provided, default error messages will be used. Default Error Messages:": "Matriz de mensajes de error personalizados para diferentes condiciones de validación. La matriz debe contener tres elementos correspondientes a diferentes escenarios de error. Si no se proporciona, se utilizarán los mensajes de error predeterminados. Mensajes de error predeterminados:",
        "Italy: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "Italia: 1 letra mayúscula seguida de 7 dígitos (por ejemplo, 'A1234567')",
        "The function can be imported using ES6 syntax from the \"password-strength-tester\" package:": "La función se puede importar usando la sintaxis de ES6 desde el paquete \"password-strength-tester\":",
        "Types that are validated": "Tipos que se validan",
        "A list of custom error messages. If not provided, it uses a default list of error messages.": "Una lista de mensajes de error personalizados. Si no se proporciona, utiliza una lista predeterminada de mensajes de error.",
        "The CNPJ number to be validate.": "El número de CNPJ que se va a validar.",
        "Example Usage with Nestjs and Multer": "Ejemplo de uso con Nestjs y Multer",
        "properties, indicating whether the CNPJ is valid and, in case of an error, the corresponding error message.": "indicando si el CNPJ es válido y, en caso de error, el mensaje de error correspondiente.",
        "The function supports postal codes for the following countries:": "La función admite códigos postales para los siguientes países:",
        "function is used to check whether an pdf file is valid or not. It accepts a Buffer as an argument.": "se utiliza para comprobar si un archivo PDF es válido o no. Acepta un Buffer como argumento."
    },
    "Header": {
        "header_docs": "Documentación",
        "header_already_here": "Ya estás aquí (:",
        "header_title": "Validador multiforma",
        "header_buy_coffee": "¿Me compras un café?",
        "header_github": "Mi github",
        "header_home": "Hogar",
        "header_go_home": "Vete a casa",
        "header_info": "Información"
    },
    "Footer": {
        "Services": "Servicios",
        "Terms": "Letra chica",
        "Privacy Policy": "Política de privacidad",
        "CopyRightMsg": "Validador © multiforma 2023 - Gabriel Logan",
        "Home": "Hogar",
        "About": "Acerca de"
    },
    "SidebarWrapperJs": {
        "Documentation": "Documentación",
        "Home": "Hogar"
    },
    "DocumentationPython": {
        "Back to home": "De vuelta a casa",
        "Installation": "Instalación",
        "Install the package using pip: ": "Instale el paquete usando pip: ",
        "Functions signature": "Firma de funciones",
        "All params with default values are optional.": "Todos los parámetros con valores predeterminados son opcionales.",
        "Methods": "Métodos"
    },
    "NotFound": {
        "Msg": "No se ha podido encontrar esta página.",
        "Status": "404"
    },
    "News": {
        "News Ad Page": "Página de anuncios de noticias",
        "News Ad Page for the Multiform Validator library.": "Página de anuncios de noticias para la biblioteca Multiform Validator."
    }
}