{
    "HomeLayout": {
        "Support me on Buy me a coffee": "ادعمني على اشتر لي قهوة!",
        "Description": "مكتبة متعددة اللغات مصممة للتحقق من الصحة ، وحقول النماذج المختلفة ، مثل: البريد الإلكتروني ، والهاتف ، وكلمة المرور ، و cpf ، و cnpj ، وبطاقة الائتمان ، والأرقام السحرية للتحقق من صحة محاكاة الصورة وغير ذلك الكثير.",
        "Technology": "التقنية",
        "Opengraph description": "مكتبة متعددة اللغات مصممة للتحقق من الصحة ، وحقول النماذج المختلفة ، مثل: البريد الإلكتروني ، والصورة ، و cpf ، و cnpj ، وبطاقة الائتمان ، والأرقام السحرية وغير ذلك الكثير.",
        "Classification": "مكتبة التحقق من الصحة",
        "Title": "مدقق متعدد الأشكال",
        "Opengraph title": "مدقق متعدد الأشكال - مكتبة التحقق متعددة اللغات الخاصة بك"
    },
    "DocumentationJs": {
        "By - Gabriel Logan": "بقلم - غابرييل لوغان",
        "Installation": "تركيب",
        "This package contains various modules for validating different types of data. Below are the available validation modules:": "تحتوي هذه الحزمة على وحدات مختلفة للتحقق من صحة أنواع مختلفة من البيانات. فيما يلي وحدات التحقق المتاحة:",
        "INFO: ": "معلومات: ",
        "Welcome Introduction Text": "مرحبا بكم في الصفحة الرئيسية لمدقق الأشكال المتعددة! ستجد هنا وثائق مفصلة لمختلف الوظائف التي يوفرها Multiform Validator ، وهي مكتبة جافا سكريبت مفيدة للتحقق من صحة البيانات. تم تصميم كل وظيفة للمساعدة في التحقق من صحة أنواع مختلفة من البيانات ، مما يجعل التعليمات البرمجية الخاصة بك أكثر قوة وأمانا. يتكون Multiform Validator من سلسلة من الوظائف المتخصصة التي تسمح لك بالتحقق من صحة أنواع البيانات المختلفة ، مثل رسائل البريد الإلكتروني وكلمات المرور والأسماء والألقاب وأرقام جوازات السفر وأرقام الهواتف والمزيد. تحتوي كل وظيفة على معلمات قابلة للتكوين وتوفر رسائل خطأ قابلة للتخصيص لتناسب احتياجات مشروعك. في كل صفحة توثيق ، ستجد وصفا شاملا للوظيفة ، بما في ذلك الغرض منها والمعلمات المقبولة وأمثلة الاستخدام. بالإضافة إلى ذلك ، سيكون لديك حق الوصول إلى تفاصيل حول رسائل الخطأ الافتراضية وكيفية تخصيصها لتناسب التطبيق الخاص بك. باستخدام Multiform Validator، يمكنك التأكد من أن إدخال المستخدم في النماذج الخاصة بك صحيح ومتوافق مع القواعد المعمول بها. يعد التحقق من الصحة هذا ضروريا لمنع حدوث مشكلات مثل الإدخالات غير الصالحة أو البيانات التالفة أو الثغرات الأمنية. نحن نعمل باستمرار على تحسين وتوسيع المدقق متعدد الأشكال بميزات وتحسينات جديدة لجعله أداة أكثر قوة ومرونة لاحتياجات التحقق من الصحة الخاصة بك. نأمل أن تكون هذه الوثائق مفيدة وتبسط استخدام Multiform Validator في مشاريعك. لا تتردد في استكشاف مختلف الوظائف المتاحة ولا تتردد في التواصل معنا إذا كان لديك أي أسئلة أو اقتراحات. شكرا لك على اختيار Multiform Validator كأداة للتحقق من صحة البيانات الخاصة بك ، ونتمنى لك النجاح في مشاريعك! فريق المدقق متعدد الأشكال",
        "if you prefer, you can use importing as:": "إذا كنت تفضل ذلك، يمكنك استخدام الاستيراد على النحو التالي:",
        "Official documentation": "الوثائق الرسمية",
        "Example of use with CDN": "مثال على الاستخدام مع CDN",
        "Data Validator": "مدقق البيانات",
        "FirstInfoText": "تقوم جميع الوظائف التي تحمل اسم \"التحقق من الصحة\" بإرجاع كائن بخاصيتين ، isValid: true | false and errorMsg: 'سلسلة بها أخطاء'",
        "Feel free to find bugs Text Msg": "لا تتردد في العثور على الأخطاء وإبلاغي بها. هو محل تقدير كبير ملاحظاتك. العناق من غابرييل لوجان!",
        "Back to home page": "العودة إلى الصفحة الرئيسية",
        "If you want to help me, you can buy me a coffee (:": "إذا كنت تريد مساعدتي ، يمكنك شراء قهوة لي (:",
        "SecondInfoText": "يمكن للباقي إرجاع true|false|string|array، انظر إلى المستند لكل واحد",
        "Available Validation Modules": "وحدات التحقق المتاحة",
        "Feel free to explore msg": "لا تتردد في استكشاف الوظائف المختلفة وتجربة المدخلات المختلفة لفهم سلوكهم. إذا واجهت أي مشاكل أو لديك اقتراحات ، فلا تتردد في التواصل معي. ملاحظاتك قيمة وتساعد على تحسين الحزمة. ترميز سعيد!",
        "This npm package provides JavaScript functions to validate various forms fields.": "توفر حزمة npm هذه وظائف JavaScript للتحقق من صحة حقول النماذج المختلفة."
    },
    "DocumentationLayout": {
        "Documentation": "توثيق",
        "Documentation for the Multiform Validator library.": "وثائق لمكتبة المدقق متعدد الأشكال."
    },
    "Terms": {
        "Terms and Conditions": "الشروط والأحكام",
        "Unauthorized use of this website is strictly prohibited.": "يمنع منعا باتا الاستخدام غير المصرح به لهذا الموقع.",
        "Terms and Conditions of Multiform Validator library": "شروط وأحكام مكتبة المدقق متعدد الأشكال",
        "Welcome to Gabriel Logan Web Services. By using this website, you agree to the following terms and conditions:": "مرحبا بكم في غابرييل لوجان لخدمات الويب. باستخدام هذا الموقع ، فإنك توافق على الشروط والأحكام التالية:",
        "We do not collect any personal data through this website, and your privacy is important to us.": "نحن لا نجمع أي بيانات شخصية من خلال هذا الموقع ، وخصوصيتك مهمة بالنسبة لنا.",
        "Your use of this website and any disputes arising are subject to the laws of [Your Country/Region].": "يخضع استخدامك لهذا الموقع وأي نزاعات تنشأ لقوانين [بلدك/منطقتك].",
        "The content provided on this website is for general information purposes only, and we make no warranties or representations regarding its accuracy or completeness.": "المحتوى المقدم على هذا الموقع هو لأغراض المعلومات العامة فقط ، ولا نقدم أي ضمانات أو إقرارات فيما يتعلق بدقته أو اكتماله.",
        "We use the \"multiform-validator\" library, licensed under the MIT License, to enhance form field validation. However, we are not responsible for its usage or any consequences resulting from third-party use of the library.": "نحن نستخدم مكتبة \"مدقق النماذج المتعددة\" ، المرخصة بموجب ترخيص معهد ماساتشوستس للتكنولوجيا ، لتحسين التحقق من صحة حقل النموذج. ومع ذلك ، نحن لسنا مسؤولين عن استخدامها أو أي عواقب ناتجة عن استخدام طرف ثالث للمكتبة.",
        "Thank you for visiting our website and using our services. If you have any questions or concerns, please don’t hesitate to contact us.": "شكرا لك على زيارة موقعنا على الانترنت واستخدام خدماتنا. إذا كان لديك أي أسئلة أو استفسارات ، فلا تتردد في الاتصال بنا."
    },
    "PrivacyPolices": {
        "privacy_questions": "إذا كانت لديك أي أسئلة أو مخاوف بشأن سياسات الخصوصية الخاصة بنا أو استخدام مكتبة \"التحقق من صحة النماذج المتعددة\" ، فيرجى عدم التردد في الاتصال بنا. نحن هنا للرد على أي استفسارات وضمان راحة بالك.",
        "privacy_intro": "في غابرييل لوجان لخدمات الويب، نأخذ خصوصيتك على محمل الجد. نريد أن نؤكد لك أننا لا نجمع أي بيانات على موقعنا ، ولا نستخدم أي بيانات من خلال مكتبة \"التحقق من متعدد الأشكال\". تظل معلوماتك سرية تماما ، وخصوصيتك أمر بالغ الأهمية بالنسبة لنا.",
        "Privacy Policy": "سياسة الخصوصية",
        "validator_local": "تم تصميم مكتبة \"مدقق النماذج المتعددة\" للتحقق من صحة حقول النموذج على تطبيقات الويب الخاصة بك دون الوصول إلى أي بيانات أو نقلها إلى خوادم خارجية. تتم جميع عمليات التحقق محليا داخل متصفحك ، مما يضمن عدم مغادرة معلوماتك الحساسة لجهازك أبدا.",
        "privacy_thanks": "شكرا لاختيارك غابرييل لوجان لخدمات الويب. نتطلع إلى تزويدك بحلول استثنائية مع حماية خصوصيتك في كل خطوة على الطريق.",
        "privacy_title": "سياسات الخصوصية - بياناتك آمنة معنا",
        "validator_secure": "نحن نتفهم أهمية أمان البيانات ، ولهذا السبب قمنا بتطوير مكتبة \"التحقق من صحة الأشكال المتعددة\" بدقة لتكون آمنة بنسبة 100٪. تظل بياناتك تحت سيطرتك ، ولا يمكننا الوصول إلى أي معلومات تعالجها المكتبة.",
        "privacy_no_personal_data": "عندما تزور موقعنا ، كن مطمئنا إلى أنه لا يتم جمع أو تخزين أي بيانات شخصية ، مثل اسمك أو عنوان بريدك الإلكتروني أو معلومات الاتصال بك. نحن نؤمن بتزويدك بتجربة تصفح آمنة ومجهولة.",
        "privacy_trust": "ثقتك قيمة بالنسبة لنا ، ونريدك أن تشعر بالثقة في استخدام خدماتنا ومكتبة \"المدقق متعدد الأشكال\". التزامنا بخصوصيتك لا يتزعزع ، وسنواصل إعطاء الأولوية لأمن وحماية بياناتك في جميع جوانب عملنا."
    },
    "Info": {
        "info_intro": "تقديم مدقق متعدد الأشكال ، مكتبة متعددة قوية طورها غابرييل لوجان. تم تصميم هذه المكتبة متعددة الاستخدامات للتحقق من صحة العديد من حقول النماذج ، بما في ذلك عناوين البريد الإلكتروني وأرقام الهواتف وكلمات المرور و CPF (أرقام سجل دافعي الضرائب الفرديين البرازيليين) وأرقام بطاقات الائتمان والمزيد.",
        "info_conclusion": "لذلك ، إذا كنت تبحث عن حل شامل للتحقق من صحة حقل النموذج ، فابحث عن مدقق النماذج المتعددة. احتضن قوة هذه المكتبة ، وكن مطمئنا إلى أن عملية جمع البيانات الخاصة بك ستكون مبسطة ودقيقة وآمنة.",
        "info_title": "مدقق متعدد الأشكال - مكتبة متعددة للتحقق من صحة حقل النموذج",
        "info_performance": "يفخر غابرييل لوغان بتطوير مكتبة المدقق متعدد الأشكال مع التركيز على الأداء والكفاءة والموثوقية. تم تحسين المكتبة لمختلف المتصفحات ، مما يضمن التوافق السلس لجمهورك المتنوع.",
        "info_prebuilt_rules": "تأتي مكتبة التحقق من صحة الأشكال المتعددة مع مجموعة واسعة من قواعد التحقق من الصحة المعدة مسبقا والخيارات القابلة للتخصيص. يمكنك دمجها بسهولة في تطبيقات الويب الخاصة بك والاستمتاع بمزايا التحقق من جانب العميل ، وتقليل عدد عمليات إرسال النماذج غير الصالحة وتحسين تجربة المستخدم الإجمالية.",
        "info_flexibility": "ما يميز المدقق متعدد الأشكال هو مرونته وسهولة استخدامه. يمكنك تطبيق قواعد التحقق من الصحة بسهولة على حقول نموذج مختلفة ببساطة عن طريق إضافة بضعة أسطر من شفرة JavaScript. بالإضافة إلى ذلك ، توفر المكتبة رسائل خطأ إعلامية ، وتوجه المستخدمين حول كيفية تصحيح مدخلاتهم ، وبالتالي تقليل الإحباط ومعدلات التخلي عن الشكل.",
        "Info_Page": "صفحة المعلومات",
        "info_backend": "يمكنك أيضا استخدام أداة التحقق من صحة النماذج المتعددة لإجراء عمليات التحقق من الصحة في الواجهة الخلفية الخاصة بك ، فهي تعمل مع أي نوع من التحقق من صحة النماذج أو الوظائف التي تستخدم جافا سكريبت ، بيثون ، لذلك لا تتردد في استخدامها",
        "info_ensure": "باستخدام مدقق النماذج المتعددة ، يمكنك التأكد من أن البيانات المرسلة من خلال النماذج الخاصة بك دقيقة وآمنة. سواء كنت تقوم بإنشاء نموذج تسجيل أو عملية دفع أو أي نظام إدخال بيانات ، فإن هذه المكتبة قد جعلتك مغطى."
    },
    "Manifest": {
        "Description": "مكتبة متعددة اللغات مصممة للتحقق من الصحة ، وحقول النماذج المختلفة ، مثل: البريد الإلكتروني ، والهاتف ، وكلمة المرور ، و cpf ، و cnpj ، وبطاقة الائتمان ، والأرقام السحرية للتحقق من صحة محاكاة الصورة وغير ذلك الكثير.",
        "ShortName": "مدقق متعدد الأشكال",
        "Name": "مدقق متعدد الأشكال - مكتبة التحقق متعددة اللغات الخاصة بك"
    },
    "DocumentationPage": {
        "doc_java_title": "جاوة",
        "doc_py_text": "هنا يمكنك العثور على الوثائق الخاصة بلغة بايثون.",
        "doc_title": "صفحة الوثائق",
        "doc_subtitle": "إليك جميع اللغات التي ندعمها",
        "doc_java_text": "هنا يمكنك العثور على الوثائق الخاصة بلغة Java.",
        "doc_py_title": "بايثون",
        "doc_js_title": "جافا سكريبت",
        "doc_intro": "مرحبا بك في صفحة الوثائق. هنا يمكنك العثور على جميع اللغات التي ندعمها والوثائق الخاصة بكل منها.",
        "doc_js_text": "هنا يمكنك العثور على الوثائق الخاصة بلغة جافا سكريبت.",
        "doc_java_coming": "في المستقبل ..."
    },
    "About": {
        "about_backend": "لكن مهاراتي لا تتوقف عند هذا الحد. أنا بارع بنفس القدر في تطوير الواجهة الخلفية ، مع خبرة في لغات مثل Python و Java و JavaScript (Node.js). يعد إنشاء تطبيقات ويب قوية وآمنة نقطة قوتي ، حيث أفهم تعقيدات المنطق من جانب الخادم. حلولي موجهة نحو الكفاءة والموثوقية وقابلية التوسع ، مع التأكد من أنه حتى خلال أوقات الذروة ، توفر تطبيقاتي تجربة مستخدم سلسة.",
        "about_frontend": "بصفتي مطورا للواجهة الأمامية ، لدي عين حريصة على تجربة المستخدم وتصميم الواجهة. أحب تحويل المفاهيم الإبداعية إلى تطبيقات ويب جذابة بصريا وتفاعلية باستخدام React و Nextjs مع الكتابة المطبوعة. من التنقل السلس إلى الرسوم المتحركة السلسة ، أهتم بكل التفاصيل للتأكد من أن مشاريعي الأمامية تنضح بالأناقة والوظائف.",
        "About_Page": "حول الصفحة",
        "about_achievement": "أحد أكثر إنجازاتي التي أفتخر بها هو إنشاء صفحة ويب رائدة تبسط وتسرع التحقق من صحة النموذج. تم تصميم هذا الحل المبتكر لمساعدة الأشخاص والشركات على تبسيط عملية التحقق من صحة النموذج الخاصة بهم. من خلال الاستفادة من معرفتي الواسعة بتطوير الويب ودمج التقنيات المتطورة ، تقدم صفحتي طريقة فائقة السرعة وفعالة للغاية للتحقق من صحة النماذج. واجهته سهلة الاستخدام ووظائفه البديهية تجعله أداة لا غنى عنها للمهنيين الذين يسعون إلى تعزيز إنتاجيتهم ودقتهم في جمع البيانات.",
        "about_title": "مرحبا، أنا غابرييل لوغان",
        "about_inspiration": "عندما لا أكون منغمسا في التعليمات البرمجية ، قد تجدني أبحث عن الإلهام في العالم من حولي. سواء كنت أستكشف الهواء الطلق ، أو أغمر في الفن والثقافة ، أو أشارك في مناقشات مثيرة للتفكير ، فأنا أستفيد من مجموعة متنوعة من التجارب التي تشكل نهجي في البرمجة وتفاعلاتي مع الزملاء والعملاء.",
        "About_Page_Description": "تعرف على Gabriel Logan ، منشئ مكتبة التحقق من الأشكال المتعددة ، وتعرف على شغفه بتطوير الويب والحلول المبتكرة وتفانيه في تجربة المستخدم.",
        "about_creative": "بصرف النظر عن مهاراتي التقنية ، فأنا أزدهر كحل إبداعي للمشكلات. أحب مواجهة التحديات بعقلية مبتكرة وأبحث دائما عن طرق لتحسين تجربة المستخدم. إن قدرتي على التفكير خارج الصندوق وتقديم حلول مبتكرة تميزني كقائد حقيقي في مجال تطوير الويب.",
        "about_conclusion": "في الختام ، أنا غابرييل لوجان ، مبرمج شغوف ينسج بسلاسة مهارات الواجهة الأمامية والخلفية لإنشاء تجارب ويب استثنائية. لقد دفعتني عقليتي المبتكرة واهتمامي بالتفاصيل وتفاني في الكفاءة إلى تطوير صفحة رائدة أعتقد أنها ستحدث تأثيرا كبيرا على عالم التحقق من صحة النموذج. مع استمرار تطور المشهد الرقمي ، أقف في المقدمة ، وعلى استعداد لاحتضان تحديات جديدة وإحداث فرق من خلال عملي الاستثنائي في تطوير الويب.",
        "about_intro": "أنا أعتبر مبرمجا متعدد الاستخدامات ولدي شغف بتطوير الواجهة الأمامية والخلفية. إن صياغة تجارب ويب استثنائية هو ما يدفعني ، وأنا فخور للغاية بالعمل الذي أنتجه."
    },
    "HomePage": {
        "HelpMsg": "يمكنك أيضا مساعدة المبرمج عن طريق شراء قهوة على الرابط أدناه ، شكرا مقدما (:",
        "SeeThePypiPage": "انظر صفحة pypi",
        "Intro": "باستخدام مكتبتي ، يمكنك تحويل العديد من أسطر التعليمات البرمجية إلى أسطر قليلة جدا ونتيجة لذلك يكون لديك رمز أنظف وأقوى وأكثر أمانا ، سيكون لديك العديد من الأدوات والوظائف التي ستقوم بالعديد من عمليات التحقق من صحة النماذج",
        "Hello": "مرحبا",
        "Documentation": "توثيق",
        "FollowThe": "اتبع",
        "Welcome": "مرحبا بك في موقع التحقق من صحة النماذج المتعددة",
        "SeeTheGithubSourceCode": "راجع مصدر جيثب",
        "ForMoreInfo": "لمزيد من المعلومات",
        "SeeTheNpmPage": "انظر صفحة npm"
    },
    "DocumentationJsFunctions": {
        "Alternatively, you can import the function using CommonJS syntax with": "بدلا من ذلك ، يمكنك استيراد الوظيفة باستخدام بناء جملة CommonJS مع",
        "if the input value matches any of the supported postal code formats, and": "إذا كانت قيمة الإدخال تتطابق مع أي من تنسيقات الرموز البريدية المدعومة، و",
        "The function takes two parameters:": "تأخذ الوظيفة معلمتين:",
        "containing the default error message 'Unknown error'.": "يحتوي على رسالة الخطأ الافتراضية \"خطأ غير معروف\".",
        "If the conversion is successful (resulting in a valid integer), the function checks if the integer is within the valid port range (1 to 65535). If the value is within this range and it is an integer, the function returns true, indicating that the input value represents a valid port number. Otherwise, it returns false.": "إذا كان التحويل ناجحا (مما أدى إلى عدد صحيح صالح) ، تتحقق الدالة مما إذا كان العدد الصحيح ضمن نطاق المنفذ الصالح (من 1 إلى 65535). إذا كانت القيمة ضمن هذا النطاق وكانت عددا صحيحا ، ترجع الدالة true ، مما يشير إلى أن قيمة الإدخال تمثل رقم منفذ صالحا. خلاف ذلك ، فإنه يرجع خطأ.",
        "The function can be imported using ES6 syntax from the \"multiform-validator\" package:": "يمكن استيراد الدالة باستخدام بناء جملة ES6 من حزمة \"مدقق الأشكال المتعددة\":",
        "Brazil: 9 digits (e.g., '123456789')": "البرازيل: 9 أرقام (على سبيل المثال، \"123456789\")",
        "The US phone number to be validated.": "رقم الهاتف الأمريكي المراد التحقق من صحته.",
        "if the input string is a valid MD5 hash and follows the supported format, and": "إذا كانت سلسلة الإدخال عبارة عن تجزئة MD5 صالحة وتتبع التنسيق المدعوم، و",
        "parameter (non-array), or if an error occurs during the validation process, the function will return an object with": "المعلمة (غير مصفوفة) ، أو في حالة حدوث خطأ أثناء عملية التحقق من الصحة ، سترجع الوظيفة كائنا باستخدام",
        "Note:": "ملاحظه:",
        "function checks if the input string is a valid MAC address. It returns": "تتحقق الوظيفة مما إذا كانت سلسلة الإدخال عبارة عن عنوان MAC صالح. يعود",
        "[optional] - The maximum length allowed for the email address. If not provided, the default value is 400.": "[اختياري] - الحد الأقصى للطول المسموح به لعنوان البريد الإلكتروني. إذا لم يتم توفيرها، تكون القيمة الافتراضية هي 400.",
        "Parameters": "البارامترات",
        "The password to be validated.": "كلمة المرور المراد التحقق من صحتها.",
        "This function just checks the syntax of the email to see if it's valid or not, if you need a stronger validation, use: ": "تتحقق هذه الوظيفة فقط من بناء جملة البريد الإلكتروني لمعرفة ما إذا كان صالحا أم لا ، إذا كنت بحاجة إلى تحقق أقوى ، فاستخدم: ",
        "function is used to validate Brazilian phone numbers. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"errorMsg\" property will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "تستخدم وظيفة للتحقق من صحة أرقام الهواتف البرازيلية. يقوم بإرجاع كائن بخاصيتين: \"isValid\" (منطقي) و \"errorMsg\" (سلسلة). ستحتوي الخاصية \"errorMsg\" على رسالة الخطأ إذا كان رقم الهاتف غير صالح أو سيكون فارغا إذا كان رقم الهاتف صالحا.",
        "if the input string is empty or consists of only whitespace characters, and": "إذا كانت سلسلة الإدخال فارغة أو تتكون من أحرف مسافات بيضاء فقط، و",
        "The CPF number to be validated.": "رقم CPF المراد التحقق من صحته.",
        "The function first checks if the input value is either a string or a number. If the value is a string, it is converted to an integer using": "تتحقق الدالة أولا مما إذا كانت قيمة الإدخال إما سلسلة أو رقما. إذا كانت القيمة عبارة عن سلسلة ، تحويلها إلى عدد صحيح باستخدام",
        "Supported Passport Formats": "تنسيقات جواز السفر المدعومة",
        "Default Error Messages": "رسائل الخطأ الافتراضية",
        "optional array": "صفيف اختياري",
        "Whether the password requires at least one number. Default value: false.": "ما إذا كانت كلمة المرور تتطلب رقما واحدا على الأقل. القيمة الافتراضية: false.",
        "The function is a text area validation utility that checks the validity of a given textarea string based on certain criteria.": "الوظيفة هي أداة مساعدة للتحقق من صحة منطقة النص تتحقق من صحة سلسلة منطقة نص معينة بناء على معايير معينة.",
        "The input string to check if it is a valid Brazilian ZIP Code (CEP).": "سلسلة الإدخال للتحقق مما إذا كان الرمز البريدي البرازيلي صالحا (CEP).",
        "The input text from which emails will be extracted.": "نص الإدخال الذي سيتم استخراج رسائل البريد الإلكتروني منه.",
        "function is used to validate passport numbers. It returns an object with two properties: 'isValid' (boolean) and 'country' (string). The 'isValid' property will be true if the passport number matches the supported formats, and 'country' property will indicate the country associated with the passport number. If the passport number does not match any supported format, 'isValid' will be false, and 'country' will be null.": "تستخدم وظيفة للتحقق من صحة أرقام جوازات السفر. يقوم بإرجاع كائن بخاصيتين: \"isValid\" (منطقي) و \"country\" (سلسلة). ستكون الخاصية \"isValid\" صحيحة إذا تطابق رقم جواز السفر مع التنسيقات المدعومة ، وستشير خاصية \"البلد\" إلى البلد المرتبط برقم جواز السفر. إذا كان رقم جواز السفر لا يتطابق مع أي تنسيق مدعوم ، فسيكون \"isValid\" خاطئا ، وستكون \"الدولة\" فارغة.",
        "How to use the isValidVideo function": "كيفية استخدام الدالة isValidVideo",
        "function is used to validate surnames. It returns an object with two properties: 'isValid' (boolean) and 'errorMsg' (string). The 'isValid' property will be true if the surname meets the specified criteria, and 'errorMsg' will contain the error message if the surname is invalid, or it will be null if the surname is valid.": "تستخدم وظيفة للتحقق من صحة الألقاب. يقوم بإرجاع كائن بخاصيتين: 'isValid' (منطقي) و 'errorMsg' (سلسلة). ستكون الخاصية 'isValid' صحيحة إذا كان اللقب يفي بالمعايير المحددة ، وسيحتوي 'errorMsg' على رسالة الخطأ إذا كان اللقب غير صالح ، أو سيكون فارغا إذا كان اللقب صالحا.",
        "The surname to be validated.": "اللقب المراد التحقق من صحته.",
        "Contains the corresponding error message, if any, based on the validation result.": "يحتوي على رسالة الخطأ المقابلة، إن وجدت، استنادا إلى نتيجة التحقق من الصحة.",
        "You can also pass an options object as a second argument to exclude a specific type.": "يمكنك أيضا تمرير كائن خيارات كوسيطة ثانية لاستثناء نوع معين.",
        "Australia: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "أستراليا: 1 حرف كبير متبوعا ب 7 أرقام (على سبيل المثال ، \"A1234567\")",
        "United States: 9 digits (e.g., '123456789')": "الولايات المتحدة: 9 أرقام (على سبيل المثال، \"123456789\")",
        "function is used to validate email addresses. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"errorMsg\" property will contain the error message if the email address is invalid, or it will be null if the email address is valid.": "تستخدم وظيفة للتحقق من صحة عناوين البريد الإلكتروني. يقوم بإرجاع كائن بخاصيتين: \"isValid\" (منطقي) و \"errorMsg\" (سلسلة). ستحتوي الخاصية \"errorMsg\" على رسالة الخطأ إذا كان عنوان البريد الإلكتروني غير صالح أو سيكون فارغا إذا كان عنوان البريد الإلكتروني صالحا.",
        "The": "ال",
        "The function expects the input value to be passed as a string. It checks each character of the string, and if any character has a character code greater than 127 (non-ASCII), the function returns": "تتوقع الدالة أن يتم تمرير قيمة الإدخال كسلسلة. يتحقق من كل حرف من السلسلة ، وإذا كان لأي حرف رمز حرف أكبر من 127 (غير ASCII) ، فإن الدالة ترجع",
        "The input string to check if it is a valid Base64 string.": "سلسلة الإدخال للتحقق مما إذا كانت سلسلة Base64 صالحة.",
        "The maximum length of the surname. Default is 25.": "الحد الأقصى لطول اللقب. الافتراضي هو 25.",
        "[optional] - The minimum length of the username. Default is 1.": "[اختياري] - الحد الأدنى لطول اسم المستخدم. الافتراضي هو 1.",
        "If the input is not a string or an empty string, it throws an error.": "إذا لم يكن الإدخال سلسلة أو سلسلة فارغة ، فإنه يلقي خطأ.",
        "The function expects the input value to be passed as a string. It checks if the string is a valid Base64 string using a regular expression. If the input is not a string or an empty string, it throws an error.": "تتوقع الدالة أن يتم تمرير قيمة الإدخال كسلسلة. يتحقق مما إذا كانت السلسلة عبارة عن سلسلة Base64 صالحة باستخدام تعبير عادي. إذا لم يكن الإدخال سلسلة أو سلسلة فارغة ، فإنه يلقي خطأ.",
        "'veryWeak' - Password with less than 6 characters, consisting only of numbers": "\"veryWeak\" - كلمة مرور أقل من 6 أحرف ، تتكون فقط من أرقام",
        "if the credit card number is valid, and": "إذا كان رقم بطاقة الائتمان صالحا، و",
        "The function expects the input value to be passed as a string representing a credit card number. It removes any non-digit characters and applies the Luhn algorithm to validate the credit card number. If the input is not a string, the function throws an error.": "تتوقع الدالة أن يتم تمرير قيمة الإدخال كسلسلة تمثل رقم بطاقة ائتمان. يزيل أي أحرف غير رقمية ويطبق خوارزمية Luhn للتحقق من صحة رقم بطاقة الائتمان. إذا لم يكن الإدخال سلسلة ، فإن الوظيفة تلقي خطأ.",
        "function from 'multiform-validator'. Then, define the path to the image you want to check. Call the": "وظيفة من \"مدقق متعدد الأشكال\". ثم حدد المسار إلى الصورة التي تريد التحقق منها. اتصل ب",
        "function checks if the input string is a valid date.": "تتحقق الدالة مما إذا كانت سلسلة الإدخال تاريخا صالحا.",
        "The input string to check if it is empty or contains only whitespace characters.": "سلسلة الإدخال للتحقق مما إذا كانت فارغة أو تحتوي على أحرف مسافات بيضاء فقط.",
        "function checks if the input string is a valid email address. It returns": "تتحقق الوظيفة مما إذا كانت سلسلة الإدخال عنوان بريد إلكتروني صالحا. يعود",
        "Whether the password requires at least one special character": "ما إذا كانت كلمة المرور تتطلب حرفا خاصا واحدا على الأقل",
        "The passport number to be validated.": "رقم جواز السفر المراد التحقق من صحته.",
        "The function returns an object with two properties:": "ترجع الدالة كائنا بخاصيتين:",
        "The function expects the input to be passed as a string.": "تتوقع الدالة أن يتم تمرير الإدخال كسلسلة.",
        "if the value is a valid port number (within the range 1 to 65535), and": "إذا كانت القيمة رقم منفذ صالح (ضمن النطاق من 1 إلى 65535)، و",
        "The email address to be validated.": "عنوان البريد الإلكتروني المراد التحقق من صحته.",
        "'regular' - Password greater than 10 and has characters that are repeated more than 5 times in sequence": "\"عادي\" - كلمة مرور أكبر من 10 ولها أحرف تتكرر أكثر من 5 مرات بالتسلسل",
        "function evaluates the strength of a given password and returns the type of password strength as a string. The possible strength types are: \"veryWeak\", \"weak\", \"regular\", \"strong\", or \"veryStrong\", based on specific criteria.": "تقوم الدالة بتقييم قوة كلمة مرور معينة وإرجاع نوع قوة كلمة المرور كسلسلة. أنواع القوة المحتملة هي: \"ضعيف جدا\" أو \"ضعيف\" أو \"منتظم\" أو \"قوي\" أو \"قوي جدا\" ، بناء على معايير محددة.",
        "which means it won't clean the email addresses after default domains ['.br', '.io', '.pt', '.us', '.org', '.com'];. If set to": "مما يعني أنه لن ينظف عناوين البريد الإلكتروني بعد النطاقات الافتراضية ['.br' و '.io' و '.pt' و '.us' و '.org' و '.com'] ؛. إذا تم التعيين على",
        "Using": "استخدام",
        "postalCode": "الرمز البريدي",
        "The postal code to be checked for validity.": "الرمز البريدي المراد التحقق من صحته.",
        "or not provided, it will return only the first email address found as a string.": "أو لم يتم توفيره ، سيعيد فقط عنوان البريد الإلكتروني الأول الذي تم العثور عليه كسلسلة.",
        "Function is used to validate phone numbers. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the phone number meets the specified criteria, and \"errorMsg\" will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "تستخدم الوظيفة للتحقق من صحة أرقام الهواتف. يقوم بإرجاع كائن بخاصيتين: \"isValid\" (منطقي) و \"errorMsg\" (سلسلة). ستكون الخاصية \"isValid\" صحيحة إذا كان رقم الهاتف يفي بالمعايير المحددة ، وسيحتوي \"errorMsg\" على رسالة الخطأ إذا كان رقم الهاتف غير صالح ، أو سيكون فارغا إذا كان رقم الهاتف صالحا.",
        "otherwise.": "خلاف ذلك.",
        "[optional] - An object with the following optional properties:": "[اختياري] - كائن له الخصائص الاختيارية التالية:",
        "If no email address is found in the input text, the function will return the string 'No email found'.": "إذا لم يتم العثور على عنوان بريد إلكتروني في نص الإدخال ، فسترجع الوظيفة السلسلة \"لم يتم العثور على بريد إلكتروني\".",
        "function extracts email addresses from a given text. If the optional": "وظيفة استخراج عناوين البريد الإلكتروني من نص معين. إذا كان اختياري",
        "Brazil": "البرازيل",
        "The input value to check if it represents a valid decimal number.": "قيمة الإدخال للتحقق مما إذا كانت تمثل رقما عشريا صالحا.",
        "Usage Examples": "أمثلة الاستخدام",
        "Index 2: \"Unknown error\"": "الفهرس 2: \"خطأ غير معروف\"",
        "The function expects the input value to be passed as a string.": "تتوقع الدالة أن يتم تمرير قيمة الإدخال كسلسلة.",
        "the function will return an array with all the email addresses found. If set to": "سترجع الوظيفة مصفوفة تحتوي على جميع عناوين البريد الإلكتروني التي تم العثور عليها. إذا تم التعيين على",
        "The input string to check for ASCII characters.": "سلسلة الإدخال للتحقق من أحرف ASCII.",
        "function checks if the input value represents a valid postal code for supported countries. It returns": "تتحقق الوظيفة مما إذا كانت قيمة الإدخال تمثل رمزا بريديا صالحا للبلدان المدعومة. يعود",
        "The input string representing the credit card number to validate.": "سلسلة الإدخال التي تمثل رقم بطاقة الائتمان للتحقق من صحتها.",
        "method and checks if the resulting string is empty (i.e., has a length of 0). If the input string consists of only whitespace characters, the function also returns.": "ويتحقق مما إذا كانت السلسلة الناتجة فارغة (أي بطول 0). إذا كانت سلسلة الإدخال تتكون من أحرف مسافات بيضاء فقط ، فسترجع الدالة أيضا.",
        "function is used to check whether an image file is valid or not. It accepts a Buffer as an argument.": "يتم استخدام وظيفة للتحقق مما إذا كان ملف الصورة صالحا أم لا. يقبل المخزن المؤقت كوسيطة.",
        "The function expects the input value to be passed as a string or a number representing a decimal number. If the input is not a string or number, or an empty string, the function throws an error. It uses a regular expression to validate decimal numbers, supports both dot (.) and comma (,) as decimal separators, and checks for multiple decimal separators. Additionally, it performs checks for the negative sign to ensure it is only at the beginning of the value.": "تتوقع الدالة أن يتم تمرير قيمة الإدخال كسلسلة أو رقم يمثل رقما عشريا. إذا لم يكن الإدخال سلسلة أو رقما ، أو سلسلة فارغة ، فإن الوظيفة تلقي خطأ. يستخدم تعبيرا عاديا للتحقق من صحة الأرقام العشرية ، ويدعم كلا من النقطة (.) والفاصلة (،) كفواصل عشرية ، ويتحقق من الفواصل العشرية المتعددة. بالإضافة إلى ذلك ، يقوم بإجراء فحوصات للعلامة السلبية للتأكد من أنها في بداية القيمة فقط.",
        "Italy": "إيطاليا",
        "function checks if the input string contains only ASCII characters. It returns": "تتحقق الدالة مما إذا كانت سلسلة الإدخال تحتوي على أحرف ASCII فقط. يعود",
        "[optional] - The country code to check if the email ends with it. If not provided, no country code check will be performed.": "[اختياري] - رمز البلد للتحقق مما إذا كان البريد الإلكتروني ينتهي به. إذا لم يتم توفيره ، فلن يتم إجراء فحص رمز البلد.",
        "India: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "الهند: 1 حرف كبير متبوعا ب 7 أرقام (على سبيل المثال ، \"A1234567\")",
        "function checks if the input value is a valid number. It returns": "تتحقق الوظيفة مما إذا كانت قيمة الإدخال رقما صالحا. يعود",
        "[optional] - An array of error messages to customize the response. If not provided, the function will use default error messages.": "[اختياري] - مجموعة من رسائل الخطأ لتخصيص الاستجابة. إذا لم يتم توفيره ، فستستخدم الوظيفة رسائل الخطأ الافتراضية.",
        "'veryStrong' - Password longer than 16 characters": "\"قوي جدا\" - كلمة مرور أطول من 16 حرفا",
        "function is used to identify the credit card flag based on the first digits of the card number. It returns the name of the card flag as a string.": "تستخدم الوظيفة لتحديد علامة بطاقة الائتمان بناء على الأرقام الأولى من رقم البطاقة. تقوم بإرجاع اسم علامة البطاقة كسلسلة.",
        "United Kingdom: 2 uppercase letters followed by 6 digits (e.g., 'AB123456')": "المملكة المتحدة: 2 حرف كبير متبوعا ب 6 أرقام (على سبيل المثال ، \"AB123456\")",
        "How to use the isValidAudio function": "كيفية استخدام الدالة isValidAudio",
        "First, import the": "أولا ، قم باستيراد ملف",
        "if the image is valid and": "إذا كانت الصورة صالحة و",
        "[optional] The minimum length allowed for the name. Default value: 1.": "[اختياري] الحد الأدنى للطول المسموح به للاسم. القيمة الافتراضية: 1.",
        "the function will remove duplicate emails from the output list. If set to": "ستقوم الوظيفة بإزالة رسائل البريد الإلكتروني المكررة من قائمة الإخراج. إذا تم التعيين على",
        "as it considers such strings to be empty.": "لأنها تعتبر هذه السلاسل فارغة.",
        "Netherlands": "هولندا",
        "or not provided, it will keep the duplicate emails in the output list.": "أو لم يتم توفيره ، سيحتفظ برسائل البريد الإلكتروني المكررة في قائمة الإخراج.",
        "[optional] - The maximum length of the username. Default is Infinity.": "[اختياري] - الحد الأقصى لطول اسم المستخدم. الافتراضي هو اللانهاية.",
        "Germany: 2 uppercase letters followed by 8 digits (e.g., 'AB12345678')": "ألمانيا: 2 أحرف كبيرة متبوعة ب 8 أرقام (على سبيل المثال ، \"AB12345678\")",
        "'regular' - Password greater than or equal to 6 and less than 8 characters, containing at least one number and one letter": "\"عادي\" - كلمة مرور أكبر من أو تساوي 6 أحرف وأقل من 8 أحرف ، تحتوي على رقم واحد وحرف واحد على الأقل",
        "'veryStrong' - Password with 8 or more characters, containing at least one uppercase letter, one number, one special character and one lowercase letter": "\"veryStrong\" - كلمة مرور مكونة من 8 أحرف أو أكثر ، تحتوي على حرف كبير واحد على الأقل ورقم واحد وحرف خاص واحد وحرف صغير واحد",
        "Default value: false.": "القيمة الافتراضية: false.",
        "The input textarea string to be validated.": "سلسلة منطقة نص الإدخال المراد التحقق من صحتها.",
        "function checks if the input string is a valid MD5 hash. It returns": "تتحقق الدالة مما إذا كانت سلسلة الإدخال عبارة عن تجزئة MD5 صالحة. يعود",
        "if it is not.": "إذا لم يكن كذلك.",
        "Notes": "تلاحظ",
        "Return Value": "قيمة الإرجاع",
        "false": "خطأ",
        "The examples provided demonstrate how to use the function with different parameters and show the expected return values.": "توضح الأمثلة المقدمة كيفية استخدام الوظيفة بمعلمات مختلفة وإظهار قيم الإرجاع المتوقعة.",
        "Canada: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "كندا: 1 حرف كبير متبوعا ب 7 أرقام (على سبيل المثال ، \"A1234567\")",
        "function is used to validate US phone numbers. It supports various formats, including \"XXX-XXX-XXXX\", \"(XXX) XXX-XXXX\", and \"1 (XXX) XXX-XXXX\". It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the phone number is valid, and \"errorMsg\" will contain the error message if the phone number is invalid, or it will be null if the phone number is valid.": "تستخدم وظيفة للتحقق من صحة أرقام الهواتف الأمريكية. وهو يدعم تنسيقات مختلفة ، بما في ذلك \"XXX-XXX-XXXX\" و \"(XXX) XXX-XXXX\" و \"1 (XXX) XXX-XXXX\". يقوم بإرجاع كائن بخاصيتين: \"isValid\" (منطقي) و \"errorMsg\" (سلسلة). ستكون الخاصية \"isValid\" صحيحة إذا كان رقم الهاتف صالحا ، وسيحتوي \"errorMsg\" على رسالة الخطأ إذا كان رقم الهاتف غير صالح ، أو سيكون فارغا إذا كان رقم الهاتف صالحا.",
        "The function expects the credit card number to be passed as a string. It uses the first digits of the card number to identify the card flag and returns the corresponding flag name as a string. If the card flag cannot be identified or the input is not a string, it returns 'Unknown'.": "تتوقع الوظيفة أن يتم تمرير رقم بطاقة الائتمان كسلسلة. يستخدم الأرقام الأولى من رقم البطاقة لتحديد علامة البطاقة وإرجاع اسم العلم المقابل كسلسلة. إذا تعذر تحديد علامة البطاقة أو لم يكن الإدخال سلسلة ، إرجاع \"غير معروف\".",
        "function with the image path as an argument. The function will return": "تعمل مع مسار الصورة كوسيطة. ستعود الوظيفة",
        "Whether the password requires at least one letter. Default value: false.": "ما إذا كانت كلمة المرور تتطلب حرفا واحدا على الأقل. القيمة الافتراضية: false.",
        "function checks if the input string or number represents a valid decimal number. It returns": "تتحقق الدالة مما إذا كانت سلسلة الإدخال أو الرقم يمثل رقما عشريا صالحا. يعود",
        "'regular' - Password between 9 and 12 characters": "\"عادي\" - كلمة المرور بين 9 و 12 حرفا",
        "if the value matches the postal code format for any of the supported countries, and": "إذا كانت القيمة تتطابق مع تنسيق الرمز البريدي لأي من البلدان المدعومة، و",
        "The function can be imported using ES6 syntax from the \"validateBRPhoneNumber\" package:": "يمكن استيراد الدالة باستخدام بناء جملة ES6 من حزمة \"validateBRPhoneNumber\":",
        "How to use the isValidTxt function": "كيفية استخدام الدالة isValidTxt",
        "set to": "اضبط على",
        "if the MAC address is valid and follows the supported formats, and": "إذا كان عنوان MAC صالحا ويتبع التنسيقات المدعومة، و",
        "'weak' - Password that repeats the same character more than 3 times in a row and is less than 10 characters long": "\"ضعيف\" - كلمة مرور تكرر نفس الحرف أكثر من 3 مرات متتالية ويبلغ طولها أقل من 10 أحرف",
        "This function is a text area validation utility that checks the validity of a given textarea string based on certain criteria.": "هذه الوظيفة هي أداة مساعدة للتحقق من صحة منطقة النص تتحقق من صحة سلسلة منطقة نص معينة بناء على معايير معينة.",
        "The minimum length of the surname. Default is 1.": "الحد الأدنى لطول اللقب. الافتراضي هو 1.",
        "if the input value matches any of the supported formats, and": "إذا كانت قيمة الإدخال تتطابق مع أي من التنسيقات المدعومة، و",
        "Passing options to the": "خيارات المرور إلى",
        "The name to be validated.": "الاسم المراد التحقق من صحته.",
        "function checks if the input string is a valid Brazilian ZIP Code (CEP). It returns": "تتحقق الدالة مما إذا كانت سلسلة الإدخال رمزا بريديا برازيليا صالحا (CEP). يعود",
        "The function takes one parameter, which must be a string representing the password to be evaluated.": "تأخذ الوظيفة معلمة واحدة ، والتي يجب أن تكون سلسلة تمثل كلمة المرور المراد تقييمها.",
        "function is used to validate passwords. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the password meets the specified criteria, and \"errorMsg\" will contain the error message if the password is invalid, or it will be null if the password is valid.": "تستخدم وظيفة للتحقق من صحة كلمات المرور. يقوم بإرجاع كائن بخاصيتين: \"isValid\" (منطقي) و \"errorMsg\" (سلسلة). ستكون الخاصية \"isValid\" صحيحة إذا كانت كلمة المرور تفي بالمعايير المحددة ، وسيحتوي \"errorMsg\" على رسالة الخطأ إذا كانت كلمة المرور غير صالحة ، أو ستكون فارغة إذا كانت كلمة المرور صالحة.",
        "France: 2 uppercase letters followed by 7 digits (e.g., 'AB1234567')": "فرنسا: 2 حرف كبير متبوعا ب 7 أرقام (على سبيل المثال ، \"AB1234567\")",
        "Example": "مثل",
        "[optional]": "[اختياري]",
        "the function will use a default list of valid domains. If set to": "ستستخدم الوظيفة قائمة افتراضية بالمجالات الصالحة. إذا تم التعيين على",
        "Default list of valid domains": "القائمة الافتراضية للمجالات الصالحة",
        "The input string representing the MD5 hash to validate. The MD5 hash should be a 32-character string consisting of hexadecimal digits (0-9, A-F, a-f).": "سلسلة الإدخال التي تمثل تجزئة MD5 للتحقق من صحتها. يجب أن تكون تجزئة MD5 عبارة عن سلسلة مكونة من 32 حرفا تتكون من أرقام سداسية عشرية (0-9 ، A-F ، a-f).",
        "if the email address is valid and follows the supported format, and": "إذا كان عنوان البريد الإلكتروني صالحا ويتبع التنسيق المدعوم، و",
        "properties, indicating whether the CPF is valid and, in case of an error, the corresponding error message.": "الخصائص ، مع الإشارة إلى ما إذا كان CPF صالحا ، وفي حالة حدوث خطأ ، رسالة الخطأ المقابلة.",
        "function checks if the input string is empty or contains only whitespace characters. It returns": "تتحقق الدالة مما إذا كانت سلسلة الإدخال فارغة أو تحتوي على أحرف مسافات بيضاء فقط. يعود",
        "The maximum length allowed for the password. Default value: Infinity.": "الحد الأقصى للطول المسموح به لكلمة المرور. القيمة الافتراضية: اللانهاية.",
        "Index 1: \"Can not be empty\"": "الفهرس 1: \"لا يمكن أن تكون فارغة\"",
        "Canada": "كندا",
        "(optional boolean) - If set to": "(منطقي اختياري) - إذا تم ضبطه على",
        "The input string representing the date": "سلسلة الإدخال التي تمثل التاريخ",
        "[optional] The maximum length allowed for the name. Default value: 20.": "[اختياري] الحد الأقصى للطول المسموح به للاسم. القيمة الافتراضية: 20.",
        "The credit card number for which to identify the flag based on the first digits.": "رقم بطاقة الائتمان التي يتم تحديد العلم لها بناء على الأرقام الأولى.",
        "The phone number to be validated.": "رقم الهاتف المراد التحقق من صحته.",
        "The maximum allowed length for the textarea.": "الحد الأقصى للطول المسموح به لمنطقة النص.",
        "if the value is a valid decimal number and follows one of the supported formats, and": "إذا كانت القيمة رقما عشريا صالحا وتتبع أحد التنسيقات المدعومة، و",
        "South Africa": "جنوب أفريقيا",
        "The minimum length allowed for the password. Default value: 1.": "الحد الأدنى للطول المسموح به لكلمة المرور. القيمة الافتراضية: 1.",
        "Examples": "امثله",
        "Germany": "ألمانيا",
        "How to use the isValidImage function": "كيفية استخدام الدالة isValidImage",
        "Function Signature": "توقيع الوظيفة",
        "An array of error messages to customize the response. If not provided, the function will use default error messages.": "صفيف من رسائل الخطأ لتخصيص الاستجابة. إذا لم يتم توفيره ، فستستخدم الوظيفة رسائل الخطأ الافتراضية.",
        "The value to be checked if it represents a valid number.": "القيمة المراد التحقق منها إذا كانت تمثل رقما صالحا.",
        "The function takes one parameter, which must be a string representing the time to be checked.": "تأخذ الوظيفة معلمة واحدة ، والتي يجب أن تكون سلسلة تمثل الوقت المراد التحقق منه.",
        "function checks if the input string represents a valid credit card number using the Luhn algorithm. It returns": "تتحقق الدالة مما إذا كانت سلسلة الإدخال تمثل رقم بطاقة ائتمان صالحا باستخدام خوارزمية Luhn. يعود",
        "if the string is a valid Base64, and": "إذا كانت السلسلة Base64 صالحة، و",
        "The username to be validated.": "اسم المستخدم المراد التحقق من صحته.",
        "'weak' - Password between 5 and 8 characters, consisting only of numbers": "\"ضعيف\" - كلمة مرور بين 5 و 8 أحرف ، تتكون فقط من أرقام",
        "China: 1 uppercase letter followed by 8 digits (e.g., 'A12345678')": "الصين: 1 حرف كبير متبوعا ب 8 أرقام (على سبيل المثال ، \"A12345678\")",
        "Whether the password requires at least one uppercase letter. Default value: false.": "ما إذا كانت كلمة المرور تتطلب حرفا كبيرا واحدا على الأقل. القيمة الافتراضية: false.",
        "Function Documentation": "وثائق الوظيفة",
        "The function expects the input value to be passed as a string. If the input is not a string, the function throws a TypeError. It removes any leading and trailing whitespace from the input string using the.": "تتوقع الدالة أن يتم تمرير قيمة الإدخال كسلسلة. إذا لم يكن الإدخال سلسلة ، فإن الدالة تلقي TypeError. يزيل أي مسافة بيضاء بادئة ولاحقة من سلسلة الإدخال باستخدام.",
        "The function uses regular expressions to check the input postal code against supported 'countries' postal code formats. It returns": "تستخدم الوظيفة تعبيرات عادية للتحقق من الرمز البريدي المدخل مقابل تنسيقات الرمز البريدي \"البلدان\" المدعومة. يعود",
        "'strong' - Password with 8 or more characters, containing at least one uppercase letter, one number and one lowercase letter": "\"قوي\" - كلمة مرور مكونة من 8 أحرف أو أكثر ، تحتوي على حرف كبير واحد على الأقل ورقم واحد وحرف صغير واحد",
        "function is used to validate a Brazilian CNPJ (National Registry of Legal Entities) number. It returns an object containing the": "تستخدم الوظيفة للتحقق من صحة رقم CNPJ البرازيلي (السجل الوطني للكيانات القانونية). تقوم بإرجاع كائن يحتوي على",
        "The value to be checked if it represents a valid port number.": "القيمة المراد التحقق منها إذا كانت تمثل رقم منفذ صالحا.",
        "United Kingdom": "المملكة المتحدة",
        "isEmail just does simple validations like checking if the string has the formatting of an email like several validators out there,": "يقوم isEmail فقط بإجراء عمليات تحقق بسيطة مثل التحقق مما إذا كانت السلسلة تحتوي على تنسيق بريد إلكتروني مثل العديد من المدققين هناك ،",
        "Switzerland": "سويسرا",
        "if the value is a valid number, and": "إذا كانت القيمة رقما صحيحا، و",
        "Spain": "إسبانيا",
        "The input string representing the email address to validate.": "سلسلة الإدخال التي تمثل عنوان البريد الإلكتروني للتحقق من صحته.",
        "The function checks the length of the password and applies certain criteria to classify the password strength. The returned strength type is based on the following criteria:": "تتحقق الوظيفة من طول كلمة المرور وتطبق معايير معينة لتصنيف قوة كلمة المرور. يعتمد نوع القوة المرتجعة على المعايير التالية:",
        "What is the difference between": "ما هو الفرق بين",
        "The input string representing the MAC address to validate. The MAC address can be in the following formats: \"001A2B3C4D5E\", \"00:1A:2B:3C:4D:5E\", or \"00-1A-2B-3C-4D-5E\".": "سلسلة الإدخال التي تمثل عنوان MAC للتحقق من صحتها. يمكن أن يكون عنوان MAC بالتنسيقات التالية: \"001A2B3C4D5E\" أو \"00:1A:2B:3C:4D:5E\" أو \"00-1A-2B-3C-4D-5E\".",
        "function checks if the input value represents a valid time in the format \"hh:mm\" or \"hh:mm AM/PM\" or \"hh:mm:ss\" or \"hh:mm:ss AM/PM\". It returns": "تتحقق الوظيفة مما إذا كانت قيمة الإدخال تمثل وقتا صالحا بالتنسيق \"hh: mm\" أو \"hh: mm AM / PM\" أو \"hh: mm: ss\" أو \"hh: mm: ss AM / PM\". يعود",
        "Index 0: \"This textarea is too big\"": "الفهرس 0: \"منطقة النص هذه كبيرة جدا\"",
        "The function uses a regular expression to check if the input time string matches any of the supported time formats. It returns": "تستخدم الدالة تعبيرا عاديا للتحقق مما إذا كانت سلسلة وقت الإدخال تتطابق مع أي من تنسيقات الوقت المدعومة. يعود",
        "[optional] - This parameter determines whether to check for specific valid email domains or not. If set to": "[اختياري] - تحدد هذه المعلمة ما إذا كان سيتم التحقق من وجود نطاقات بريد إلكتروني صالحة محددة أم لا. إذا تم التعيين على",
        "it will clean after default domains. If set to an array of strings, it will clean after the specified custom domains.": "سيتم تنظيفه بعد المجالات الافتراضية. إذا تم تعيينه على صفيف من السلاسل ، تنظيفه بعد المجالات المخصصة المحددة.",
        "The time to be checked for validity. It must be in one of the supported formats: \"hh:mm\", \"hh:mm AM/PM\", \"hh:mm:ss\", or \"hh:mm:ss AM/PM\".": "الوقت المراد التحقق من صلاحيته. يجب أن يكون بأحد التنسيقات المدعومة: \"hh: mm\" أو \"hh: mm AM / PM\" أو \"hh: mm: ss\" أو \"hh: mm: ss AM / PM\".",
        "Supported Countries": "الدول المدعومة",
        "no domain check will be performed. Alternatively, you can pass an array of custom valid domains to perform the check against a specific list.": "لن يتم إجراء أي فحص للمجال. بدلا من ذلك ، يمكنك تمرير صفيف من المجالات الصالحة المخصصة لإجراء التحقق مقابل قائمة معينة.",
        "it returns an array with all the email addresses found. Otherwise, it returns only the first email address found as a string.": "يقوم بإرجاع صفيف مع جميع عناوين البريد الإلكتروني التي تم العثور عليها. خلاف ذلك ، فإنه يرجع فقط عنوان البريد الإلكتروني الأول الذي تم العثور عليه كسلسلة.",
        "The function takes one parameter that can be either a string or a number: ": "تأخذ الوظيفة معلمة واحدة يمكن أن تكون إما سلسلة أو رقما: ",
        "The default error messages are as follows:": "رسائل الخطأ الافتراضية هي كما يلي:",
        "How to use the isValidPdf function": "كيفية استخدام الدالة isValidPdf",
        "function is used to validate usernames. It returns an object with two properties: \"isValid\" (boolean) and \"errorMsg\" (string). The \"isValid\" property will be true if the username meets the specified criteria, and \"errorMsg\" will contain the error message if the username is invalid, or it will be null if the username is valid.": "تستخدم وظيفة للتحقق من صحة أسماء المستخدمين. يقوم بإرجاع كائن بخاصيتين: \"isValid\" (منطقي) و \"errorMsg\" (سلسلة). ستكون الخاصية \"isValid\" صحيحة إذا كان اسم المستخدم يفي بالمعايير المحددة ، وسيحتوي \"errorMsg\" على رسالة الخطأ إذا كان اسم المستخدم غير صالح ، أو سيكون فارغا إذا كان اسم المستخدم صالحا.",
        "if the string is composed of ASCII characters, and": "إذا كانت السلسلة مكونة من أحرف ASCII، و",
        "In this example it only allocates 4 bytes for performance reasons, but you can pass the entire file.": "في هذا المثال ، يخصص 4 بايت فقط لأسباب تتعلق بالأداء ، ولكن يمكنك تمرير الملف بأكمله.",
        "The Brazilian phone number to be validated.": "رقم الهاتف البرازيلي المراد التحقق من صحته.",
        "'weak' - Password with less than 6 characters, consisting of numbers and letters": "\"ضعيف\" - كلمة مرور أقل من 6 أحرف ، تتكون من أرقام وحروف",
        "Japan": "اليابان",
        "function checks if the input string is a valid Base64 string. It returns": "تتحقق الدالة مما إذا كانت سلسلة الإدخال عبارة عن سلسلة Base64 صالحة. يعود",
        "A flag to determine if the textarea is required.": "علامة لتحديد ما إذا كانت منطقة النص مطلوبة.",
        "'strong' - Password between 13 and 16 characters": "\"قوي\" - كلمة مرور بين 13 و 16 حرفا",
        "(optional boolean | string[]) - Either a boolean value indicating whether to clean after default domains or an array of custom domains to clean after. Default is": "(منطقي اختياري | سلسلة []) - إما قيمة منطقية تشير إلى ما إذا كان سيتم تنظيفها بعد المجالات الافتراضية أو صفيف من المجالات المخصصة للتنظيف بعدها. الافتراضي هو",
        "true": "صحيح",
        "The function takes one parameter, which must be a string representing the postal code to be checked.": "تأخذ الوظيفة معلمة واحدة ، والتي يجب أن تكون سلسلة تمثل الرمز البريدي المراد التحقق منه.",
        "function checks if the input value represents a valid port number. It returns": "تتحقق الوظيفة مما إذا كانت قيمة الإدخال تمثل رقم منفذ صالحا. يعود",
        "function is used to validate a Brazilian CPF (Individual Taxpayer Identification) number. It returns an object containing the": "تستخدم الوظيفة للتحقق من صحة رقم CPF البرازيلي (تعريف دافع الضرائب الفردي). تقوم بإرجاع كائن يحتوي على",
        "The function expects the input MD5 hash to be passed as a string. If the input is not a string, the function throws a TypeError. It removes leading and trailing whitespace from the input string and checks if the resulting string has a valid length (exactly 32 characters). Then, it uses a regular expression to verify if the cleaned MD5 hash consists only of hexadecimal digits. Additionally, the function checks if the MD5 hash is not a known weak hash, such as \"d41d8cd98f00b204e9800998ecf8427e\". If any of the checks fail, the function returns false; otherwise, it returns true, indicating that the input string is a valid MD5 hash.": "تتوقع الدالة أن يتم تمرير تجزئة MD5 للإدخال كسلسلة. إذا لم يكن الإدخال سلسلة ، فإن الدالة تلقي TypeError. يزيل المسافة البيضاء البادئة واللاحقة من سلسلة الإدخال ويتحقق مما إذا كانت السلسلة الناتجة لها طول صالح (32 حرفا بالضبط). بعد ذلك ، يستخدم تعبيرا عاديا للتحقق مما إذا كانت تجزئة MD5 التي تم تنظيفها تتكون فقط من أرقام سداسية عشرية. بالإضافة إلى ذلك، تتحقق الدالة مما إذا كانت تجزئة MD5 ليست تجزئة ضعيفة معروفة، مثل \"d41d8cd98f00b204e9800998ecf8427e\". في حالة فشل أي من عمليات التحقق ، ترجع الدالة false ؛ خلاف ذلك ، فإنه يرجع true ، مما يشير إلى أن سلسلة الإدخال هي تجزئة MD5 صالحة.",
        "if the value matches any of these formats, and": "إذا كانت القيمة تتطابق مع أي من هذه التنسيقات، و",
        "The function takes one parameter:": "تأخذ الوظيفة معلمة واحدة:",
        "The function expects the input MAC address to be passed as a string. If the input is not a string, the function throws a TypeError. It removes all non-alphanumeric characters from the input string using a regular expression and checks if the resulting string has a valid length (exactly 12 characters). Then, it uses another regular expression to verify if the cleaned MAC address matches the supported pattern. The supported pattern is a 12-character string consisting of hexadecimal digits (0-9, A-F, a-f), with optional separators (\":\", \"-\") between pairs of hexadecimal digits.": "تتوقع الدالة أن يتم تمرير عنوان MAC للإدخال كسلسلة. إذا لم يكن الإدخال سلسلة ، فإن الدالة تلقي TypeError. يزيل جميع الأحرف غير الأبجدية الرقمية من سلسلة الإدخال باستخدام تعبير عادي ويتحقق مما إذا كانت السلسلة الناتجة لها طول صالح (12 حرفا بالضبط). بعد ذلك ، يستخدم تعبيرا عاديا آخر للتحقق مما إذا كان عنوان MAC الذي تم تنظيفه يطابق النمط المدعوم. النمط المدعوم عبارة عن سلسلة مكونة من 12 حرفا تتكون من أرقام سداسية عشرية (0-9 ، A-F ، a-f) ، مع فواصل اختيارية (\":\" ، \"-\") بين أزواج من الأرقام السداسية العشرية.",
        "function to convert the value to a floating-point number. If the conversion results in a valid number and the value is finite (not infinity or NaN), the function returns true, indicating that the input value is a valid number. Otherwise, it returns false.": "لتحويل القيمة إلى رقم فاصلة عائمة. إذا نتج عن التحويل رقم صالح وكانت القيمة محدودة (وليس ما لا نهاية أو NaN) ، ترجع الدالة true ، مما يشير إلى أن قيمة الإدخال هي رقم صالح. خلاف ذلك ، فإنه يرجع خطأ.",
        "United States of America": "الولايات المتحدة الأمريكية",
        "Function is used to validate names. It returns an object with two properties: 'isValid' (boolean) and 'errorMsg' (string). The 'errorMsg' property will contain the error message if the name is invalid, or it will be null if the name is valid.": "تستخدم الوظيفة للتحقق من صحة الأسماء. يقوم بإرجاع كائن بخاصيتين: 'isValid' (منطقي) و 'errorMsg' (سلسلة). ستحتوي الخاصية 'errorMsg' على رسالة الخطأ إذا كان الاسم غير صالح ، أو سيكون فارغا إذا كان الاسم صالحا.",
        "The function expects the input email to be passed as a string. If the input is not a string, it will throw an error. If the email passed is an invalid email, it will return.": "تتوقع الوظيفة أن يتم تمرير البريد الإلكتروني الإدخال كسلسلة. إذا لم يكن الإدخال سلسلة ، فسيؤدي ذلك إلى حدوث خطأ. إذا كان البريد الإلكتروني الذي تم تمريره عبارة عن بريد إلكتروني غير صالح ، إرجاعه.",
        "The function checks if the input value is not null, undefined, or a boolean type. If any of these conditions are met, the function returns false since these values cannot represent valid numbers. For all other types, the function uses the.": "تتحقق الدالة مما إذا كانت قيمة الإدخال ليست فارغة أو غير معرفة أو من النوع المنطقي. إذا تم استيفاء أي من هذه الشروط ، ترجع الدالة false لأن هذه القيم لا يمكن أن تمثل أرقاما صالحة. بالنسبة لجميع الأنواع الأخرى ، تستخدم الدالة.",
        "function is used to check whether an txt file is valid or not. It accepts a Buffer as an argument.": "يتم استخدام وظيفة للتحقق مما إذا كان ملف txt صالحا أم لا. يقبل المخزن المؤقت كوسيطة.",
        "The password to be evaluated for strength.": "كلمة المرور التي سيتم تقييمها للقوة.",
        "Indicates if the textarea is valid based on the given criteria.": "يشير إلى ما إذا كانت منطقة النص صالحة بناء على المعايير المحددة.",
        "if the CEP is valid, and": "إذا كان المجلس الانتخابي المؤقت صالحا، و",
        "function is used to check whether an audio file is valid or not. It accepts a Buffer as an argument.": "يتم استخدام وظيفة للتحقق مما إذا كان الملف الصوتي صالحا أم لا. يقبل المخزن المؤقت كوسيطة.",
        "and": "و",
        "does not, it does complex validations and better than that, you can customize the validations passing the information in the parameters.": "لا ، فهو يقوم بعمليات التحقق المعقدة والأفضل من ذلك ، يمكنك تخصيص عمليات التحقق من صحة تمرير المعلومات في المعلمات.",
        "If the function is called with an invalid value for the": "إذا تم استدعاء الدالة بقيمة غير صالحة ل",
        "function is used to check whether an video file is valid or not. It accepts a Buffer as an argument.": "يتم استخدام وظيفة للتحقق مما إذا كان ملف الفيديو صالحا أم لا. يقبل المخزن المؤقت كوسيطة.",
        "France": "فرنسا",
        "parameter is set to": "تم تعيين المعلمة إلى",
        "There are two ways to import the function:": "هناك طريقتان لاستيراد الدالة:",
        "An array of custom error messages for different validation conditions. The array should contain three elements corresponding to different error scenarios. If not provided, default error messages will be used. Default Error Messages:": "صفيف من رسائل الخطأ المخصصة لظروف التحقق المختلفة. يجب أن يحتوي الصفيف على ثلاثة عناصر تتوافق مع سيناريوهات خطأ مختلفة. إذا لم يتم توفيره ، استخدام رسائل الخطأ الافتراضية. رسائل الخطأ الافتراضية:",
        "Italy: 1 uppercase letter followed by 7 digits (e.g., 'A1234567')": "إيطاليا: 1 حرف كبير متبوعا ب 7 أرقام (على سبيل المثال ، \"A1234567\")",
        "The function can be imported using ES6 syntax from the \"password-strength-tester\" package:": "يمكن استيراد الوظيفة باستخدام بناء جملة ES6 من حزمة \"اختبار قوة كلمة المرور\":",
        "Types that are validated": "الأنواع التي تم التحقق من صحتها",
        "A list of custom error messages. If not provided, it uses a default list of error messages.": "قائمة برسائل الخطأ المخصصة. إذا لم يتم توفيره ، فإنه يستخدم قائمة افتراضية لرسائل الخطأ.",
        "The CNPJ number to be validate.": "رقم CNPJ المراد التحقق من صحته.",
        "Example Usage with Nestjs and Multer": "مثال على الاستخدام مع Nestjs و Multer",
        "properties, indicating whether the CNPJ is valid and, in case of an error, the corresponding error message.": "الخصائص ، مع الإشارة إلى ما إذا كان CNPJ صالحا ، وفي حالة حدوث خطأ ، رسالة الخطأ المقابلة.",
        "The function supports postal codes for the following countries:": "تدعم الوظيفة الرموز البريدية للبلدان التالية:",
        "function is used to check whether an pdf file is valid or not. It accepts a Buffer as an argument.": "يتم استخدام وظيفة للتحقق مما إذا كان ملف PDF صالحا أم لا. يقبل المخزن المؤقت كوسيطة."
    },
    "Header": {
        "header_docs": "توثيق",
        "header_already_here": "أنت هنا بالفعل (:",
        "header_title": "مدقق متعدد الأشكال",
        "header_buy_coffee": "اشتر لي قهوة؟",
        "header_github": "جيثب الخاص بي",
        "header_home": "وطن",
        "header_go_home": "عد للمنزل",
        "header_info": "معلومات"
    },
    "Footer": {
        "Services": "خدمات",
        "Terms": "حيث",
        "Privacy Policy": "سياسة الخصوصية",
        "CopyRightMsg": "مدقق © متعدد الأشكال 2023 - غابرييل لوجان",
        "Home": "وطن",
        "About": "عن"
    },
    "SidebarWrapperJs": {
        "Documentation": "توثيق",
        "Home": "وطن"
    },
    "DocumentationPython": {
        "Back to home": "العودة إلى الصفحة الرئيسية",
        "Installation": "تركيب",
        "Install the package using pip: ": "قم بتثبيت الحزمة باستخدام النقطة: ",
        "Functions signature": "توقيع الوظائف",
        "All params with default values are optional.": "جميع المعلمات ذات القيم الافتراضية اختيارية.",
        "Methods": "أساليب"
    },
    "NotFound": {
        "Msg": "تعذر العثور على هذه الصفحة.",
        "Status": "404"
    },
    "News": {
        "News Ad Page": "صفحة إعلان الأخبار",
        "News Ad Page for the Multiform Validator library.": "صفحة إعلان الأخبار لمكتبة المدقق متعدد الأشكال."
    }
}